; ModuleID = 'libmodbus.so.5.1.0.0.0.preopt.bc'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._modbus.4 = type { i32, i32, i32, i32, %struct.timeval, %struct.timeval, %struct.timeval, %struct._modbus_backend.3*, i8* }
%struct.timeval = type { i64, i64 }
%struct._modbus_backend.3 = type { i32, i32, i32, i32, {}*, i32 (%struct._modbus.4*, i32, i32, i32, i8*)*, i32 (%struct._sft*, i8*)*, i32 (i8*, i32*)*, i32 (i8*, i32)*, i64 (%struct._modbus.4*, i8*, i32)*, i32 (%struct._modbus.4*, i8*)*, i64 (%struct._modbus.4*, i8*, i32)*, i32 (%struct._modbus.4*, i8*, i32)*, i32 (%struct._modbus.4*, i8*, i8*, i32)*, i32 (%struct._modbus.4*)*, void (%struct._modbus.4*)*, i32 (%struct._modbus.4*)*, i32 (%struct._modbus.4*, %struct.fd_set*, %struct.timeval*, i32)*, void (%struct._modbus.4*)* }
%struct._sft = type { i32, i32, i32 }
%struct.fd_set = type { [16 x i64] }
%struct._modbus.13 = type { i32, i32, i32, i32, %struct.timeval, %struct.timeval, %struct.timeval, %struct._modbus_backend.12*, i8* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "libmodbus_version_major", scope: !2, file: !3, line: 30, type: !71, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !39, globals: !68)
!3 = !DIFile(filename: "../../src/modbus.c", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!4 = !{!5, !10, !15, !21, !35}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 52, size: 32, elements: !7)
!6 = !DIFile(filename: "../../src/modbus-private.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!7 = !{!8, !9}
!8 = !DIEnumerator(name: "MSG_INDICATION", value: 0)
!9 = !DIEnumerator(name: "MSG_CONFIRMATION", value: 1)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 38, size: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "_STEP_FUNCTION", value: 0)
!13 = !DIEnumerator(name: "_STEP_META", value: 1)
!14 = !DIEnumerator(name: "_STEP_DATA", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 172, size: 32, elements: !17)
!16 = !DIFile(filename: "../../src/modbus.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!17 = !{!18, !19, !20}
!18 = !DIEnumerator(name: "MODBUS_ERROR_RECOVERY_NONE", value: 0)
!19 = !DIEnumerator(name: "MODBUS_ERROR_RECOVERY_LINK", value: 2)
!20 = !DIEnumerator(name: "MODBUS_ERROR_RECOVERY_PROTOCOL", value: 4)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 117, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "MODBUS_EXCEPTION_ILLEGAL_FUNCTION", value: 1)
!24 = !DIEnumerator(name: "MODBUS_EXCEPTION_ILLEGAL_DATA_ADDRESS", value: 2)
!25 = !DIEnumerator(name: "MODBUS_EXCEPTION_ILLEGAL_DATA_VALUE", value: 3)
!26 = !DIEnumerator(name: "MODBUS_EXCEPTION_SLAVE_OR_SERVER_FAILURE", value: 4)
!27 = !DIEnumerator(name: "MODBUS_EXCEPTION_ACKNOWLEDGE", value: 5)
!28 = !DIEnumerator(name: "MODBUS_EXCEPTION_SLAVE_OR_SERVER_BUSY", value: 6)
!29 = !DIEnumerator(name: "MODBUS_EXCEPTION_NEGATIVE_ACKNOWLEDGE", value: 7)
!30 = !DIEnumerator(name: "MODBUS_EXCEPTION_MEMORY_PARITY", value: 8)
!31 = !DIEnumerator(name: "MODBUS_EXCEPTION_NOT_DEFINED", value: 9)
!32 = !DIEnumerator(name: "MODBUS_EXCEPTION_GATEWAY_PATH", value: 10)
!33 = !DIEnumerator(name: "MODBUS_EXCEPTION_GATEWAY_TARGET", value: 11)
!34 = !DIEnumerator(name: "MODBUS_EXCEPTION_MAX", value: 12)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 42, size: 32, elements: !36)
!36 = !{!37, !38}
!37 = !DIEnumerator(name: "_MODBUS_BACKEND_TYPE_RTU", value: 0)
!38 = !DIEnumerator(name: "_MODBUS_BACKEND_TYPE_TCP", value: 1)
!39 = !{!40, !41, !44, !45, !48, !61, !64, !43}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !42, line: 54, baseType: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!43 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !46, line: 48, baseType: !47)
!46 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "modbus_mapping_t", file: !16, line: 170, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 157, size: 512, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !62, !63, !67}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bits", scope: !50, file: !16, line: 158, baseType: !44, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "start_bits", scope: !50, file: !16, line: 159, baseType: !44, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nb_input_bits", scope: !50, file: !16, line: 160, baseType: !44, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_bits", scope: !50, file: !16, line: 161, baseType: !44, size: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "nb_input_registers", scope: !50, file: !16, line: 162, baseType: !44, size: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_registers", scope: !50, file: !16, line: 163, baseType: !44, size: 32, offset: 160)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nb_registers", scope: !50, file: !16, line: 164, baseType: !44, size: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "start_registers", scope: !50, file: !16, line: 165, baseType: !44, size: 32, offset: 224)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tab_bits", scope: !50, file: !16, line: 166, baseType: !61, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tab_input_bits", scope: !50, file: !16, line: 167, baseType: !61, size: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tab_input_registers", scope: !50, file: !16, line: 168, baseType: !64, size: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !46, line: 49, baseType: !66)
!66 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tab_registers", scope: !50, file: !16, line: 169, baseType: !64, size: 64, offset: 448)
!68 = !{!0, !69, !73}
!69 = !DIGlobalVariableExpression(var: !70)
!70 = distinct !DIGlobalVariable(name: "libmodbus_version_minor", scope: !2, file: !3, line: 31, type: !71, isLocal: false, isDefinition: true)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!73 = !DIGlobalVariableExpression(var: !74)
!74 = distinct !DIGlobalVariable(name: "libmodbus_version_micro", scope: !2, file: !3, line: 32, type: !71, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76)
!76 = distinct !DIGlobalVariable(name: "_modbus_rtu_backend", scope: !77, file: !78, line: 1199, type: !140, isLocal: false, isDefinition: true)
!77 = distinct !DICompileUnit(language: DW_LANG_C99, file: !78, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !79, retainedTypes: !80, globals: !227)
!78 = !DIFile(filename: "../../src/modbus-rtu.c", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!79 = !{!35, !5, !15, !21}
!80 = !{!40, !81, !119, !87, !41, !44}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "modbus_rtu_t", file: !83, line: 74, baseType: !84)
!83 = !DIFile(filename: "../../src/modbus-rtu-private.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_modbus_rtu", file: !83, line: 45, size: 896, elements: !85)
!85 = !{!86, !89, !90, !91, !92, !93, !111, !112, !113, !114, !115, !226}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !84, file: !83, line: 47, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "baud", scope: !84, file: !83, line: 49, baseType: !44, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit", scope: !84, file: !83, line: 51, baseType: !45, size: 8, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !84, file: !83, line: 53, baseType: !45, size: 8, offset: 104)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !84, file: !83, line: 55, baseType: !88, size: 8, offset: 112)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "old_tios", scope: !84, file: !83, line: 61, baseType: !94, size: 480, offset: 128)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !95, line: 28, size: 480, elements: !96)
!95 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/termios.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!96 = !{!97, !99, !100, !101, !102, !104, !108, !110}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !94, file: !95, line: 30, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !95, line: 25, baseType: !72)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !94, file: !95, line: 31, baseType: !98, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !94, file: !95, line: 32, baseType: !98, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !94, file: !95, line: 33, baseType: !98, size: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !94, file: !95, line: 34, baseType: !103, size: 8, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !95, line: 23, baseType: !47)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !94, file: !95, line: 35, baseType: !105, size: 256, offset: 136)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 256, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !94, file: !95, line: 36, baseType: !109, size: 32, offset: 416)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !95, line: 24, baseType: !72)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !94, file: !95, line: 37, baseType: !109, size: 32, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "serial_mode", scope: !84, file: !83, line: 64, baseType: !44, size: 32, offset: 608)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "rts", scope: !84, file: !83, line: 67, baseType: !44, size: 32, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "rts_delay", scope: !84, file: !83, line: 68, baseType: !44, size: 32, offset: 672)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "onebyte_time", scope: !84, file: !83, line: 69, baseType: !44, size: 32, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "set_rts", scope: !84, file: !83, line: 70, baseType: !116, size: 64, offset: 768)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119, !44}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "modbus_t", file: !16, line: 155, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_modbus", file: !6, line: 92, size: 640, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !136, !137, !138, !225}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "slave", scope: !121, file: !6, line: 94, baseType: !44, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !121, file: !6, line: 96, baseType: !44, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !121, file: !6, line: 97, baseType: !44, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "error_recovery", scope: !121, file: !6, line: 98, baseType: !44, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "response_timeout", scope: !121, file: !6, line: 99, baseType: !128, size: 128, offset: 128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !129, line: 30, size: 128, elements: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!130 = !{!131, !134}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !128, file: !129, line: 32, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !133, line: 139, baseType: !43)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !128, file: !129, line: 33, baseType: !135, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !133, line: 141, baseType: !43)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "byte_timeout", scope: !121, file: !6, line: 100, baseType: !128, size: 128, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "indication_timeout", scope: !121, file: !6, line: 101, baseType: !128, size: 128, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !121, file: !6, line: 102, baseType: !139, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "modbus_backend_t", file: !6, line: 90, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_modbus_backend", file: !6, line: 67, size: 1088, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !152, !156, !167, !174, !178, !185, !189, !193, !198, !202, !206, !210, !211, !224}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "backend_type", scope: !142, file: !6, line: 68, baseType: !72, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "header_length", scope: !142, file: !6, line: 69, baseType: !72, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_length", scope: !142, file: !6, line: 70, baseType: !72, size: 32, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "max_adu_length", scope: !142, file: !6, line: 71, baseType: !72, size: 32, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "set_slave", scope: !142, file: !6, line: 72, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!44, !119, !44}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "build_request_basis", scope: !142, file: !6, line: 73, baseType: !153, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!44, !119, !44, !44, !44, !61}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "build_response_basis", scope: !142, file: !6, line: 75, baseType: !157, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!44, !160, !61}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "sft_t", file: !6, line: 65, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sft", file: !6, line: 61, size: 96, elements: !163)
!163 = !{!164, !165, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "slave", scope: !162, file: !6, line: 62, baseType: !44, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !162, file: !6, line: 63, baseType: !44, size: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "t_id", scope: !162, file: !6, line: 64, baseType: !44, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_response_tid", scope: !142, file: !6, line: 76, baseType: !168, size: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!44, !171, !173}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "send_msg_pre", scope: !142, file: !6, line: 77, baseType: !175, size: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!44, !61, !44}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !142, file: !6, line: 78, baseType: !179, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !119, !171, !44}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !183, line: 102, baseType: !184)
!183 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !133, line: 172, baseType: !43)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "receive", scope: !142, file: !6, line: 79, baseType: !186, size: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!44, !119, !61}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !142, file: !6, line: 80, baseType: !190, size: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!182, !119, !61, !44}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "check_integrity", scope: !142, file: !6, line: 81, baseType: !194, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!44, !119, !61, !197}
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pre_check_confirmation", scope: !142, file: !6, line: 83, baseType: !199, size: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!44, !119, !171, !171, !44}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !142, file: !6, line: 85, baseType: !203, size: 64, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!44, !119}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !142, file: !6, line: 86, baseType: !207, size: 64, offset: 832)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !119}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !142, file: !6, line: 87, baseType: !203, size: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !142, file: !6, line: 88, baseType: !212, size: 64, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!44, !119, !215, !223, !44}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !42, line: 75, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 64, size: 1024, elements: !218)
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !217, file: !42, line: 69, baseType: !220, size: 1024)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1024, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 16)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !142, file: !6, line: 89, baseType: !207, size: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "backend_data", scope: !121, file: !6, line: 103, baseType: !40, size: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "confirmation_to_ignore", scope: !84, file: !83, line: 73, baseType: !44, size: 32, offset: 832)
!227 = !{!75, !228, !233}
!228 = !DIGlobalVariableExpression(var: !229)
!229 = distinct !DIGlobalVariable(name: "table_crc_hi", scope: !77, file: !78, line: 31, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 2048, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 256)
!233 = !DIGlobalVariableExpression(var: !234)
!234 = distinct !DIGlobalVariable(name: "table_crc_lo", scope: !77, file: !78, line: 61, type: !230, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236)
!236 = distinct !DIGlobalVariable(name: "_modbus_tcp_backend", scope: !237, file: !238, line: 736, type: !340, isLocal: false, isDefinition: true)
!237 = distinct !DICompileUnit(language: DW_LANG_C99, file: !238, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !239, retainedTypes: !310, globals: !435)
!238 = !DIFile(filename: "../../src/modbus-tcp.c", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!239 = !{!240, !252, !281, !5, !21, !304}
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !241, line: 24, size: 32, elements: !242)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251}
!243 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!244 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!245 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!246 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!247 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!248 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!249 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!250 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!251 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!252 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !253, line: 40, size: 32, elements: !254)
!253 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!255 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!256 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!257 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!258 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!259 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!260 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!261 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!262 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!263 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!264 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!265 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!266 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!267 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!268 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!269 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!270 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!271 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!272 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!273 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!274 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!275 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!276 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!277 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!278 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!279 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!280 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !282, line: 175, size: 32, elements: !283)
!282 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!284 = !DIEnumerator(name: "MSG_OOB", value: 1)
!285 = !DIEnumerator(name: "MSG_PEEK", value: 2)
!286 = !DIEnumerator(name: "MSG_DONTROUTE", value: 4)
!287 = !DIEnumerator(name: "MSG_TRYHARD", value: 4)
!288 = !DIEnumerator(name: "MSG_CTRUNC", value: 8)
!289 = !DIEnumerator(name: "MSG_PROXY", value: 16)
!290 = !DIEnumerator(name: "MSG_TRUNC", value: 32)
!291 = !DIEnumerator(name: "MSG_DONTWAIT", value: 64)
!292 = !DIEnumerator(name: "MSG_EOR", value: 128)
!293 = !DIEnumerator(name: "MSG_WAITALL", value: 256)
!294 = !DIEnumerator(name: "MSG_FIN", value: 512)
!295 = !DIEnumerator(name: "MSG_SYN", value: 1024)
!296 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048)
!297 = !DIEnumerator(name: "MSG_RST", value: 4096)
!298 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192)
!299 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384)
!300 = !DIEnumerator(name: "MSG_MORE", value: 32768)
!301 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536)
!302 = !DIEnumerator(name: "MSG_FASTOPEN", value: 536870912)
!303 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824)
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !305, line: 52, size: 32, elements: !306)
!305 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/socket.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!306 = !{!307, !308, !309}
!307 = !DIEnumerator(name: "SHUT_RD", value: 0)
!308 = !DIEnumerator(name: "SHUT_WR", value: 1)
!309 = !DIEnumerator(name: "SHUT_RDWR", value: 2)
!310 = !{!40, !87, !311, !313, !323, !410, !419, !431, !433, !41, !44}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !253, line: 30, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !46, line: 51, baseType: !72)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !282, line: 153, size: 128, elements: !315)
!315 = !{!316, !319}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !314, file: !282, line: 155, baseType: !317, size: 16)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !318, line: 28, baseType: !66)
!318 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !314, file: !282, line: 156, baseType: !320, size: 112, offset: 16)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 112, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 14)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "modbus_t", file: !16, line: 155, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_modbus", file: !6, line: 92, size: 640, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !336, !337, !338, !409}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "slave", scope: !325, file: !6, line: 94, baseType: !44, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !325, file: !6, line: 96, baseType: !44, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !325, file: !6, line: 97, baseType: !44, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "error_recovery", scope: !325, file: !6, line: 98, baseType: !44, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "response_timeout", scope: !325, file: !6, line: 99, baseType: !332, size: 128, offset: 128)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !129, line: 30, size: 128, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !332, file: !129, line: 32, baseType: !132, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !332, file: !129, line: 33, baseType: !135, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "byte_timeout", scope: !325, file: !6, line: 100, baseType: !332, size: 128, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "indication_timeout", scope: !325, file: !6, line: 101, baseType: !332, size: 128, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !325, file: !6, line: 102, baseType: !339, size: 64, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "modbus_backend_t", file: !6, line: 90, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_modbus_backend", file: !6, line: 67, size: 1088, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !352, !356, !367, !368, !369, !373, !377, !381, !385, !389, !393, !397, !398, !408}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "backend_type", scope: !342, file: !6, line: 68, baseType: !72, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "header_length", scope: !342, file: !6, line: 69, baseType: !72, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_length", scope: !342, file: !6, line: 70, baseType: !72, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "max_adu_length", scope: !342, file: !6, line: 71, baseType: !72, size: 32, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "set_slave", scope: !342, file: !6, line: 72, baseType: !349, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!44, !323, !44}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "build_request_basis", scope: !342, file: !6, line: 73, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!44, !323, !44, !44, !44, !61}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "build_response_basis", scope: !342, file: !6, line: 75, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!44, !360, !61}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "sft_t", file: !6, line: 65, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sft", file: !6, line: 61, size: 96, elements: !363)
!363 = !{!364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "slave", scope: !362, file: !6, line: 62, baseType: !44, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !362, file: !6, line: 63, baseType: !44, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "t_id", scope: !362, file: !6, line: 64, baseType: !44, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_response_tid", scope: !342, file: !6, line: 76, baseType: !168, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "send_msg_pre", scope: !342, file: !6, line: 77, baseType: !175, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !342, file: !6, line: 78, baseType: !370, size: 64, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!182, !323, !171, !44}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "receive", scope: !342, file: !6, line: 79, baseType: !374, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!44, !323, !61}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !342, file: !6, line: 80, baseType: !378, size: 64, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!182, !323, !61, !44}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "check_integrity", scope: !342, file: !6, line: 81, baseType: !382, size: 64, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!44, !323, !61, !197}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pre_check_confirmation", scope: !342, file: !6, line: 83, baseType: !386, size: 64, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!44, !323, !171, !171, !44}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !342, file: !6, line: 85, baseType: !390, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!44, !323}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !342, file: !6, line: 86, baseType: !394, size: 64, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !323}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !342, file: !6, line: 87, baseType: !390, size: 64, offset: 896)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !342, file: !6, line: 88, baseType: !399, size: 64, offset: 960)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!44, !323, !402, !407, !44}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !42, line: 75, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 64, size: 1024, elements: !405)
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !404, file: !42, line: 69, baseType: !220, size: 1024)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !342, file: !6, line: 89, baseType: !394, size: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "backend_data", scope: !325, file: !6, line: 103, baseType: !40, size: 64, offset: 576)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "modbus_tcp_t", file: !412, line: 28, baseType: !413)
!412 = !DIFile(filename: "../../src/modbus-tcp-private.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_modbus_tcp", file: !412, line: 18, size: 192, elements: !414)
!414 = !{!415, !416, !417}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "t_id", scope: !413, file: !412, line: 23, baseType: !65, size: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !413, file: !412, line: 25, baseType: !44, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !413, file: !412, line: 27, baseType: !418, size: 128, offset: 64)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 128, elements: !221)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "modbus_tcp_pi_t", file: !412, line: 42, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_modbus_tcp_pi", file: !412, line: 33, size: 8544, elements: !422)
!422 = !{!423, !424, !425, !429}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "t_id", scope: !421, file: !412, line: 35, baseType: !65, size: 16)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !421, file: !412, line: 37, baseType: !44, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !421, file: !412, line: 39, baseType: !426, size: 8200, offset: 64)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 8200, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 1025)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "service", scope: !421, file: !412, line: 41, baseType: !430, size: 256, offset: 8264)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 256, elements: !106)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!435 = !{!235, !436}
!436 = !DIGlobalVariableExpression(var: !437)
!437 = distinct !DIGlobalVariable(name: "_modbus_tcp_pi_backend", scope: !237, file: !238, line: 759, type: !340, isLocal: false, isDefinition: true)
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !440, retainedTypes: !441)
!439 = !DIFile(filename: "../../src/modbus-data.c", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!440 = !{}
!441 = !{!312, !66, !65}
!442 = !{!"clang version 5.0.0 (tags/RELEASE_500/final)"}
!443 = !{i32 2, !"Dwarf Version", i32 4}
!444 = !{i32 2, !"Debug Info Version", i32 3}
!445 = !{i32 1, !"wchar_size", i32 4}
!446 = !{i32 7, !"PIC Level", i32 2}
!447 = distinct !DISubprogram(name: "modbus_strerror", scope: !3, file: !3, line: 44, type: !448, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!448 = !DISubroutineType(types: !449)
!449 = !{!431, !44}
!450 = !DILocalVariable(name: "errnum", arg: 1, scope: !447, file: !3, line: 44, type: !44)
!451 = !DIExpression()
!452 = !DILocation(line: 44, column: 33, scope: !447)
!453 = !DILocation(line: 45, column: 13, scope: !447)
!454 = !DILocation(line: 45, column: 5, scope: !447)
!455 = !DILocation(line: 47, column: 9, scope: !456)
!456 = distinct !DILexicalBlock(scope: !447, file: !3, line: 45, column: 21)
!457 = !DILocation(line: 49, column: 9, scope: !456)
!458 = !DILocation(line: 51, column: 9, scope: !456)
!459 = !DILocation(line: 53, column: 9, scope: !456)
!460 = !DILocation(line: 55, column: 9, scope: !456)
!461 = !DILocation(line: 57, column: 9, scope: !456)
!462 = !DILocation(line: 59, column: 9, scope: !456)
!463 = !DILocation(line: 61, column: 9, scope: !456)
!464 = !DILocation(line: 63, column: 9, scope: !456)
!465 = !DILocation(line: 65, column: 9, scope: !456)
!466 = !DILocation(line: 67, column: 9, scope: !456)
!467 = !DILocation(line: 69, column: 9, scope: !456)
!468 = !DILocation(line: 71, column: 9, scope: !456)
!469 = !DILocation(line: 73, column: 9, scope: !456)
!470 = !DILocation(line: 75, column: 9, scope: !456)
!471 = !DILocation(line: 77, column: 25, scope: !456)
!472 = !DILocation(line: 77, column: 16, scope: !456)
!473 = !DILocation(line: 77, column: 9, scope: !456)
!474 = !DILocation(line: 79, column: 1, scope: !447)
!475 = distinct !DISubprogram(name: "_error_print", scope: !3, file: !3, line: 81, type: !476, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !478, !431}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "modbus_t", file: !16, line: 155, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_modbus", file: !6, line: 92, size: 640, elements: !481)
!481 = !{!482, !483, !484, !485, !486, !491, !492, !493, !564}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "slave", scope: !480, file: !6, line: 94, baseType: !44, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !480, file: !6, line: 96, baseType: !44, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !480, file: !6, line: 97, baseType: !44, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "error_recovery", scope: !480, file: !6, line: 98, baseType: !44, size: 32, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "response_timeout", scope: !480, file: !6, line: 99, baseType: !487, size: 128, offset: 128)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !129, line: 30, size: 128, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !487, file: !129, line: 32, baseType: !132, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !487, file: !129, line: 33, baseType: !135, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "byte_timeout", scope: !480, file: !6, line: 100, baseType: !487, size: 128, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "indication_timeout", scope: !480, file: !6, line: 101, baseType: !487, size: 128, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !480, file: !6, line: 102, baseType: !494, size: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "modbus_backend_t", file: !6, line: 90, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_modbus_backend", file: !6, line: 67, size: 1088, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !507, !511, !522, !523, !524, !528, !532, !536, !540, !544, !548, !552, !553, !563}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "backend_type", scope: !497, file: !6, line: 68, baseType: !72, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "header_length", scope: !497, file: !6, line: 69, baseType: !72, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_length", scope: !497, file: !6, line: 70, baseType: !72, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "max_adu_length", scope: !497, file: !6, line: 71, baseType: !72, size: 32, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "set_slave", scope: !497, file: !6, line: 72, baseType: !504, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!44, !478, !44}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "build_request_basis", scope: !497, file: !6, line: 73, baseType: !508, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!44, !478, !44, !44, !44, !61}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "build_response_basis", scope: !497, file: !6, line: 75, baseType: !512, size: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!44, !515, !61}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "sft_t", file: !6, line: 65, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sft", file: !6, line: 61, size: 96, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "slave", scope: !517, file: !6, line: 62, baseType: !44, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !517, file: !6, line: 63, baseType: !44, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "t_id", scope: !517, file: !6, line: 64, baseType: !44, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_response_tid", scope: !497, file: !6, line: 76, baseType: !168, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "send_msg_pre", scope: !497, file: !6, line: 77, baseType: !175, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !497, file: !6, line: 78, baseType: !525, size: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!182, !478, !171, !44}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "receive", scope: !497, file: !6, line: 79, baseType: !529, size: 64, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!44, !478, !61}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !497, file: !6, line: 80, baseType: !533, size: 64, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!182, !478, !61, !44}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "check_integrity", scope: !497, file: !6, line: 81, baseType: !537, size: 64, offset: 640)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!44, !478, !61, !197}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pre_check_confirmation", scope: !497, file: !6, line: 83, baseType: !541, size: 64, offset: 704)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!44, !478, !171, !171, !44}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !497, file: !6, line: 85, baseType: !545, size: 64, offset: 768)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!44, !478}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !497, file: !6, line: 86, baseType: !549, size: 64, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !478}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !497, file: !6, line: 87, baseType: !545, size: 64, offset: 896)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !497, file: !6, line: 88, baseType: !554, size: 64, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!44, !478, !557, !562, !44}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !42, line: 75, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 64, size: 1024, elements: !560)
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !559, file: !42, line: 69, baseType: !220, size: 1024)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !497, file: !6, line: 89, baseType: !549, size: 64, offset: 1024)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "backend_data", scope: !480, file: !6, line: 103, baseType: !40, size: 64, offset: 576)
!565 = !DILocalVariable(name: "ctx", arg: 1, scope: !475, file: !3, line: 81, type: !478)
!566 = !DILocation(line: 81, column: 29, scope: !475)
!567 = !DILocalVariable(name: "context", arg: 2, scope: !475, file: !3, line: 81, type: !431)
!568 = !DILocation(line: 81, column: 46, scope: !475)
!569 = !DILocation(line: 83, column: 9, scope: !570)
!570 = distinct !DILexicalBlock(scope: !475, file: !3, line: 83, column: 9)
!571 = !DILocation(line: 83, column: 14, scope: !570)
!572 = !DILocation(line: 83, column: 9, scope: !475)
!573 = !DILocation(line: 84, column: 17, scope: !574)
!574 = distinct !DILexicalBlock(scope: !570, file: !3, line: 83, column: 21)
!575 = !DILocation(line: 84, column: 53, scope: !574)
!576 = !DILocation(line: 84, column: 37, scope: !574)
!577 = !DILocation(line: 84, column: 9, scope: !574)
!578 = !DILocation(line: 85, column: 13, scope: !579)
!579 = distinct !DILexicalBlock(scope: !574, file: !3, line: 85, column: 13)
!580 = !DILocation(line: 85, column: 21, scope: !579)
!581 = !DILocation(line: 85, column: 13, scope: !574)
!582 = !DILocation(line: 86, column: 21, scope: !583)
!583 = distinct !DILexicalBlock(scope: !579, file: !3, line: 85, column: 30)
!584 = !DILocation(line: 86, column: 39, scope: !583)
!585 = !DILocation(line: 86, column: 13, scope: !583)
!586 = !DILocation(line: 87, column: 9, scope: !583)
!587 = !DILocation(line: 88, column: 21, scope: !588)
!588 = distinct !DILexicalBlock(scope: !579, file: !3, line: 87, column: 16)
!589 = !DILocation(line: 88, column: 13, scope: !588)
!590 = !DILocation(line: 90, column: 5, scope: !574)
!591 = !DILocation(line: 91, column: 1, scope: !475)
!592 = distinct !DISubprogram(name: "modbus_flush", scope: !3, file: !3, line: 111, type: !546, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!593 = !DILocalVariable(name: "ctx", arg: 1, scope: !592, file: !3, line: 111, type: !478)
!594 = !DILocation(line: 111, column: 28, scope: !592)
!595 = !DILocalVariable(name: "rc", scope: !592, file: !3, line: 113, type: !44)
!596 = !DILocation(line: 113, column: 9, scope: !592)
!597 = !DILocation(line: 115, column: 9, scope: !598)
!598 = distinct !DILexicalBlock(scope: !592, file: !3, line: 115, column: 9)
!599 = !DILocation(line: 115, column: 13, scope: !598)
!600 = !DILocation(line: 115, column: 9, scope: !592)
!601 = !DILocation(line: 116, column: 9, scope: !602)
!602 = distinct !DILexicalBlock(scope: !598, file: !3, line: 115, column: 22)
!603 = !DILocation(line: 116, column: 15, scope: !602)
!604 = !DILocation(line: 117, column: 9, scope: !602)
!605 = !DILocation(line: 120, column: 10, scope: !592)
!606 = !DILocation(line: 120, column: 15, scope: !592)
!607 = !DILocation(line: 120, column: 24, scope: !592)
!608 = !DILocation(line: 120, column: 30, scope: !592)
!609 = !DILocation(line: 120, column: 8, scope: !592)
!610 = !DILocation(line: 121, column: 9, scope: !611)
!611 = distinct !DILexicalBlock(scope: !592, file: !3, line: 121, column: 9)
!612 = !DILocation(line: 121, column: 12, scope: !611)
!613 = !DILocation(line: 121, column: 18, scope: !611)
!614 = !DILocation(line: 121, column: 21, scope: !611)
!615 = !DILocation(line: 121, column: 26, scope: !611)
!616 = !DILocation(line: 121, column: 9, scope: !592)
!617 = !DILocation(line: 123, column: 40, scope: !618)
!618 = distinct !DILexicalBlock(scope: !611, file: !3, line: 121, column: 33)
!619 = !DILocation(line: 123, column: 9, scope: !618)
!620 = !DILocation(line: 124, column: 5, scope: !618)
!621 = !DILocation(line: 125, column: 12, scope: !592)
!622 = !DILocation(line: 125, column: 5, scope: !592)
!623 = !DILocation(line: 126, column: 1, scope: !592)
!624 = distinct !DISubprogram(name: "modbus_send_raw_request", scope: !3, file: !3, line: 210, type: !625, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!625 = !DISubroutineType(types: !626)
!626 = !{!44, !478, !61, !44}
!627 = !DILocalVariable(name: "ctx", arg: 1, scope: !624, file: !3, line: 210, type: !478)
!628 = !DILocation(line: 210, column: 39, scope: !624)
!629 = !DILocalVariable(name: "raw_req", arg: 2, scope: !624, file: !3, line: 210, type: !61)
!630 = !DILocation(line: 210, column: 53, scope: !624)
!631 = !DILocalVariable(name: "raw_req_length", arg: 3, scope: !624, file: !3, line: 210, type: !44)
!632 = !DILocation(line: 210, column: 66, scope: !624)
!633 = !DILocalVariable(name: "sft", scope: !624, file: !3, line: 212, type: !516)
!634 = !DILocation(line: 212, column: 11, scope: !624)
!635 = !DILocalVariable(name: "req", scope: !624, file: !3, line: 213, type: !636)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2080, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 260)
!639 = !DILocation(line: 213, column: 13, scope: !624)
!640 = !DILocalVariable(name: "req_length", scope: !624, file: !3, line: 214, type: !44)
!641 = !DILocation(line: 214, column: 9, scope: !624)
!642 = !DILocation(line: 216, column: 9, scope: !643)
!643 = distinct !DILexicalBlock(scope: !624, file: !3, line: 216, column: 9)
!644 = !DILocation(line: 216, column: 13, scope: !643)
!645 = !DILocation(line: 216, column: 9, scope: !624)
!646 = !DILocation(line: 217, column: 9, scope: !647)
!647 = distinct !DILexicalBlock(scope: !643, file: !3, line: 216, column: 22)
!648 = !DILocation(line: 217, column: 15, scope: !647)
!649 = !DILocation(line: 218, column: 9, scope: !647)
!650 = !DILocation(line: 221, column: 9, scope: !651)
!651 = distinct !DILexicalBlock(scope: !624, file: !3, line: 221, column: 9)
!652 = !DILocation(line: 221, column: 24, scope: !651)
!653 = !DILocation(line: 221, column: 28, scope: !651)
!654 = !DILocation(line: 221, column: 31, scope: !651)
!655 = !DILocation(line: 221, column: 46, scope: !651)
!656 = !DILocation(line: 221, column: 9, scope: !624)
!657 = !DILocation(line: 225, column: 9, scope: !658)
!658 = distinct !DILexicalBlock(scope: !651, file: !3, line: 221, column: 77)
!659 = !DILocation(line: 225, column: 15, scope: !658)
!660 = !DILocation(line: 226, column: 9, scope: !658)
!661 = !DILocation(line: 229, column: 17, scope: !624)
!662 = !DILocation(line: 229, column: 9, scope: !624)
!663 = !DILocation(line: 229, column: 15, scope: !624)
!664 = !DILocation(line: 230, column: 20, scope: !624)
!665 = !DILocation(line: 230, column: 9, scope: !624)
!666 = !DILocation(line: 230, column: 18, scope: !624)
!667 = !DILocation(line: 232, column: 9, scope: !624)
!668 = !DILocation(line: 232, column: 14, scope: !624)
!669 = !DILocation(line: 234, column: 18, scope: !624)
!670 = !DILocation(line: 234, column: 23, scope: !624)
!671 = !DILocation(line: 234, column: 32, scope: !624)
!672 = !DILocation(line: 234, column: 59, scope: !624)
!673 = !DILocation(line: 234, column: 16, scope: !624)
!674 = !DILocation(line: 236, column: 9, scope: !675)
!675 = distinct !DILexicalBlock(scope: !624, file: !3, line: 236, column: 9)
!676 = !DILocation(line: 236, column: 24, scope: !675)
!677 = !DILocation(line: 236, column: 9, scope: !624)
!678 = !DILocation(line: 238, column: 16, scope: !679)
!679 = distinct !DILexicalBlock(scope: !675, file: !3, line: 236, column: 29)
!680 = !DILocation(line: 238, column: 22, scope: !679)
!681 = !DILocation(line: 238, column: 20, scope: !679)
!682 = !DILocation(line: 238, column: 34, scope: !679)
!683 = !DILocation(line: 238, column: 42, scope: !679)
!684 = !DILocation(line: 238, column: 47, scope: !679)
!685 = !DILocation(line: 238, column: 62, scope: !679)
!686 = !DILocation(line: 238, column: 9, scope: !679)
!687 = !DILocation(line: 239, column: 23, scope: !679)
!688 = !DILocation(line: 239, column: 38, scope: !679)
!689 = !DILocation(line: 239, column: 20, scope: !679)
!690 = !DILocation(line: 240, column: 5, scope: !679)
!691 = !DILocation(line: 242, column: 21, scope: !624)
!692 = !DILocation(line: 242, column: 26, scope: !624)
!693 = !DILocation(line: 242, column: 31, scope: !624)
!694 = !DILocation(line: 242, column: 12, scope: !624)
!695 = !DILocation(line: 242, column: 5, scope: !624)
!696 = !DILocation(line: 243, column: 1, scope: !624)
!697 = distinct !DISubprogram(name: "send_msg", scope: !3, file: !3, line: 166, type: !625, isLocal: true, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!698 = !DILocalVariable(name: "ctx", arg: 1, scope: !697, file: !3, line: 166, type: !478)
!699 = !DILocation(line: 166, column: 31, scope: !697)
!700 = !DILocalVariable(name: "msg", arg: 2, scope: !697, file: !3, line: 166, type: !61)
!701 = !DILocation(line: 166, column: 45, scope: !697)
!702 = !DILocalVariable(name: "msg_length", arg: 3, scope: !697, file: !3, line: 166, type: !44)
!703 = !DILocation(line: 166, column: 54, scope: !697)
!704 = !DILocalVariable(name: "rc", scope: !697, file: !3, line: 168, type: !44)
!705 = !DILocation(line: 168, column: 9, scope: !697)
!706 = !DILocalVariable(name: "i", scope: !697, file: !3, line: 169, type: !44)
!707 = !DILocation(line: 169, column: 9, scope: !697)
!708 = !DILocation(line: 171, column: 18, scope: !697)
!709 = !DILocation(line: 171, column: 23, scope: !697)
!710 = !DILocation(line: 171, column: 32, scope: !697)
!711 = !DILocation(line: 171, column: 45, scope: !697)
!712 = !DILocation(line: 171, column: 50, scope: !697)
!713 = !DILocation(line: 171, column: 16, scope: !697)
!714 = !DILocation(line: 173, column: 9, scope: !715)
!715 = distinct !DILexicalBlock(scope: !697, file: !3, line: 173, column: 9)
!716 = !DILocation(line: 173, column: 14, scope: !715)
!717 = !DILocation(line: 173, column: 9, scope: !697)
!718 = !DILocation(line: 174, column: 16, scope: !719)
!719 = distinct !DILexicalBlock(scope: !720, file: !3, line: 174, column: 9)
!720 = distinct !DILexicalBlock(scope: !715, file: !3, line: 173, column: 21)
!721 = !DILocation(line: 174, column: 14, scope: !719)
!722 = !DILocation(line: 174, column: 21, scope: !723)
!723 = distinct !DILexicalBlock(scope: !719, file: !3, line: 174, column: 9)
!724 = !DILocation(line: 174, column: 25, scope: !723)
!725 = !DILocation(line: 174, column: 23, scope: !723)
!726 = !DILocation(line: 174, column: 9, scope: !719)
!727 = !DILocation(line: 175, column: 30, scope: !723)
!728 = !DILocation(line: 175, column: 34, scope: !723)
!729 = !DILocation(line: 175, column: 13, scope: !723)
!730 = !DILocation(line: 174, column: 38, scope: !723)
!731 = !DILocation(line: 174, column: 9, scope: !723)
!732 = distinct !{!732, !726, !733}
!733 = !DILocation(line: 175, column: 36, scope: !719)
!734 = !DILocation(line: 176, column: 9, scope: !720)
!735 = !DILocation(line: 177, column: 5, scope: !720)
!736 = !DILocation(line: 181, column: 5, scope: !697)
!737 = distinct !{!737, !736, !738}
!738 = !DILocation(line: 200, column: 22, scope: !697)
!739 = !DILocation(line: 182, column: 14, scope: !740)
!740 = distinct !DILexicalBlock(scope: !697, file: !3, line: 181, column: 8)
!741 = !DILocation(line: 182, column: 19, scope: !740)
!742 = !DILocation(line: 182, column: 28, scope: !740)
!743 = !DILocation(line: 182, column: 33, scope: !740)
!744 = !DILocation(line: 182, column: 38, scope: !740)
!745 = !DILocation(line: 182, column: 43, scope: !740)
!746 = !DILocation(line: 182, column: 12, scope: !740)
!747 = !DILocation(line: 183, column: 13, scope: !748)
!748 = distinct !DILexicalBlock(scope: !740, file: !3, line: 183, column: 13)
!749 = !DILocation(line: 183, column: 16, scope: !748)
!750 = !DILocation(line: 183, column: 13, scope: !740)
!751 = !DILocation(line: 184, column: 26, scope: !752)
!752 = distinct !DILexicalBlock(scope: !748, file: !3, line: 183, column: 23)
!753 = !DILocation(line: 184, column: 13, scope: !752)
!754 = !DILocation(line: 185, column: 17, scope: !755)
!755 = distinct !DILexicalBlock(scope: !752, file: !3, line: 185, column: 17)
!756 = !DILocation(line: 185, column: 22, scope: !755)
!757 = !DILocation(line: 185, column: 37, scope: !755)
!758 = !DILocation(line: 185, column: 17, scope: !752)
!759 = !DILocalVariable(name: "saved_errno", scope: !760, file: !3, line: 186, type: !44)
!760 = distinct !DILexicalBlock(scope: !755, file: !3, line: 185, column: 67)
!761 = !DILocation(line: 186, column: 21, scope: !760)
!762 = !DILocation(line: 186, column: 35, scope: !760)
!763 = !DILocation(line: 188, column: 22, scope: !764)
!764 = distinct !DILexicalBlock(scope: !760, file: !3, line: 188, column: 21)
!765 = !DILocation(line: 188, column: 28, scope: !764)
!766 = !DILocation(line: 188, column: 37, scope: !764)
!767 = !DILocation(line: 188, column: 40, scope: !764)
!768 = !DILocation(line: 188, column: 46, scope: !764)
!769 = !DILocation(line: 188, column: 60, scope: !764)
!770 = !DILocation(line: 188, column: 63, scope: !764)
!771 = !DILocation(line: 188, column: 69, scope: !764)
!772 = !DILocation(line: 188, column: 21, scope: !760)
!773 = !DILocation(line: 189, column: 34, scope: !774)
!774 = distinct !DILexicalBlock(scope: !764, file: !3, line: 188, column: 80)
!775 = !DILocation(line: 189, column: 21, scope: !774)
!776 = !DILocation(line: 190, column: 45, scope: !774)
!777 = !DILocation(line: 190, column: 21, scope: !774)
!778 = !DILocation(line: 191, column: 36, scope: !774)
!779 = !DILocation(line: 191, column: 21, scope: !774)
!780 = !DILocation(line: 192, column: 17, scope: !774)
!781 = !DILocation(line: 193, column: 45, scope: !782)
!782 = distinct !DILexicalBlock(scope: !764, file: !3, line: 192, column: 24)
!783 = !DILocation(line: 193, column: 21, scope: !782)
!784 = !DILocation(line: 194, column: 34, scope: !782)
!785 = !DILocation(line: 194, column: 21, scope: !782)
!786 = !DILocation(line: 196, column: 25, scope: !760)
!787 = !DILocation(line: 196, column: 17, scope: !760)
!788 = !DILocation(line: 196, column: 23, scope: !760)
!789 = !DILocation(line: 197, column: 13, scope: !760)
!790 = !DILocation(line: 198, column: 9, scope: !752)
!791 = !DILocation(line: 199, column: 5, scope: !740)
!792 = !DILocation(line: 199, column: 15, scope: !697)
!793 = !DILocation(line: 199, column: 20, scope: !697)
!794 = !DILocation(line: 199, column: 35, scope: !697)
!795 = !DILocation(line: 199, column: 65, scope: !697)
!796 = !DILocation(line: 200, column: 14, scope: !697)
!797 = !DILocation(line: 200, column: 17, scope: !697)
!798 = !DILocation(line: 202, column: 9, scope: !799)
!799 = distinct !DILexicalBlock(scope: !697, file: !3, line: 202, column: 9)
!800 = !DILocation(line: 202, column: 12, scope: !799)
!801 = !DILocation(line: 202, column: 16, scope: !799)
!802 = !DILocation(line: 202, column: 19, scope: !799)
!803 = !DILocation(line: 202, column: 25, scope: !799)
!804 = !DILocation(line: 202, column: 22, scope: !799)
!805 = !DILocation(line: 202, column: 9, scope: !697)
!806 = !DILocation(line: 203, column: 9, scope: !807)
!807 = distinct !DILexicalBlock(scope: !799, file: !3, line: 202, column: 37)
!808 = !DILocation(line: 203, column: 15, scope: !807)
!809 = !DILocation(line: 204, column: 9, scope: !807)
!810 = !DILocation(line: 207, column: 12, scope: !697)
!811 = !DILocation(line: 207, column: 5, scope: !697)
!812 = !DILocation(line: 208, column: 1, scope: !697)
!813 = distinct !DISubprogram(name: "modbus_close", scope: !3, file: !3, line: 1734, type: !550, isLocal: false, isDefinition: true, scopeLine: 1735, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!814 = !DILocalVariable(name: "ctx", arg: 1, scope: !813, file: !3, line: 1734, type: !478)
!815 = !DILocation(line: 1734, column: 29, scope: !813)
!816 = !DILocation(line: 1736, column: 9, scope: !817)
!817 = distinct !DILexicalBlock(scope: !813, file: !3, line: 1736, column: 9)
!818 = !DILocation(line: 1736, column: 13, scope: !817)
!819 = !DILocation(line: 1736, column: 9, scope: !813)
!820 = !DILocation(line: 1737, column: 9, scope: !817)
!821 = !DILocation(line: 1739, column: 5, scope: !813)
!822 = !DILocation(line: 1739, column: 10, scope: !813)
!823 = !DILocation(line: 1739, column: 19, scope: !813)
!824 = !DILocation(line: 1739, column: 25, scope: !813)
!825 = !DILocation(line: 1740, column: 1, scope: !813)
!826 = distinct !DISubprogram(name: "_sleep_response_timeout", scope: !3, file: !3, line: 93, type: !550, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!827 = !DILocalVariable(name: "ctx", arg: 1, scope: !826, file: !3, line: 93, type: !478)
!828 = !DILocation(line: 93, column: 47, scope: !826)
!829 = !DILocalVariable(name: "request", scope: !826, file: !3, line: 102, type: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !831, line: 120, size: 128, elements: !832)
!831 = !DIFile(filename: "/usr/include/time.h", directory: "/home/kevin/Downloads/libmodbus-master/build/src")
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !830, file: !831, line: 122, baseType: !132, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !830, file: !831, line: 123, baseType: !835, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !133, line: 175, baseType: !43)
!836 = !DILocation(line: 102, column: 21, scope: !826)
!837 = !DILocalVariable(name: "remaining", scope: !826, file: !3, line: 102, type: !830)
!838 = !DILocation(line: 102, column: 30, scope: !826)
!839 = !DILocation(line: 103, column: 22, scope: !826)
!840 = !DILocation(line: 103, column: 27, scope: !826)
!841 = !DILocation(line: 103, column: 44, scope: !826)
!842 = !DILocation(line: 103, column: 13, scope: !826)
!843 = !DILocation(line: 103, column: 20, scope: !826)
!844 = !DILocation(line: 104, column: 34, scope: !826)
!845 = !DILocation(line: 104, column: 39, scope: !826)
!846 = !DILocation(line: 104, column: 56, scope: !826)
!847 = !DILocation(line: 104, column: 65, scope: !826)
!848 = !DILocation(line: 104, column: 13, scope: !826)
!849 = !DILocation(line: 104, column: 21, scope: !826)
!850 = !DILocation(line: 105, column: 5, scope: !826)
!851 = !DILocation(line: 105, column: 12, scope: !826)
!852 = !DILocation(line: 105, column: 44, scope: !826)
!853 = !DILocation(line: 105, column: 50, scope: !826)
!854 = !DILocation(line: 105, column: 53, scope: !826)
!855 = !DILocation(line: 105, column: 59, scope: !826)
!856 = !DILocation(line: 106, column: 19, scope: !857)
!857 = distinct !DILexicalBlock(scope: !826, file: !3, line: 105, column: 69)
!858 = distinct !{!858, !850, !859}
!859 = !DILocation(line: 107, column: 5, scope: !826)
!860 = !DILocation(line: 109, column: 1, scope: !826)
!861 = distinct !DISubprogram(name: "modbus_connect", scope: !3, file: !3, line: 1724, type: !546, isLocal: false, isDefinition: true, scopeLine: 1725, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!862 = !DILocalVariable(name: "ctx", arg: 1, scope: !861, file: !3, line: 1724, type: !478)
!863 = !DILocation(line: 1724, column: 30, scope: !861)
!864 = !DILocation(line: 1726, column: 9, scope: !865)
!865 = distinct !DILexicalBlock(scope: !861, file: !3, line: 1726, column: 9)
!866 = !DILocation(line: 1726, column: 13, scope: !865)
!867 = !DILocation(line: 1726, column: 9, scope: !861)
!868 = !DILocation(line: 1727, column: 9, scope: !869)
!869 = distinct !DILexicalBlock(scope: !865, file: !3, line: 1726, column: 22)
!870 = !DILocation(line: 1727, column: 15, scope: !869)
!871 = !DILocation(line: 1728, column: 9, scope: !869)
!872 = !DILocation(line: 1731, column: 12, scope: !861)
!873 = !DILocation(line: 1731, column: 17, scope: !861)
!874 = !DILocation(line: 1731, column: 26, scope: !861)
!875 = !DILocation(line: 1731, column: 34, scope: !861)
!876 = !DILocation(line: 1731, column: 5, scope: !861)
!877 = !DILocation(line: 1732, column: 1, scope: !861)
!878 = distinct !DISubprogram(name: "_modbus_receive_msg", scope: !3, file: !3, line: 340, type: !879, isLocal: false, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!879 = !DISubroutineType(types: !880)
!880 = !{!44, !478, !61, !881}
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "msg_type_t", file: !6, line: 57, baseType: !5)
!882 = !DILocalVariable(name: "ctx", arg: 1, scope: !878, file: !3, line: 340, type: !478)
!883 = !DILocation(line: 340, column: 35, scope: !878)
!884 = !DILocalVariable(name: "msg", arg: 2, scope: !878, file: !3, line: 340, type: !61)
!885 = !DILocation(line: 340, column: 49, scope: !878)
!886 = !DILocalVariable(name: "msg_type", arg: 3, scope: !878, file: !3, line: 340, type: !881)
!887 = !DILocation(line: 340, column: 65, scope: !878)
!888 = !DILocalVariable(name: "rc", scope: !878, file: !3, line: 342, type: !44)
!889 = !DILocation(line: 342, column: 9, scope: !878)
!890 = !DILocalVariable(name: "rset", scope: !878, file: !3, line: 343, type: !558)
!891 = !DILocation(line: 343, column: 12, scope: !878)
!892 = !DILocalVariable(name: "tv", scope: !878, file: !3, line: 344, type: !487)
!893 = !DILocation(line: 344, column: 20, scope: !878)
!894 = !DILocalVariable(name: "p_tv", scope: !878, file: !3, line: 345, type: !562)
!895 = !DILocation(line: 345, column: 21, scope: !878)
!896 = !DILocalVariable(name: "length_to_read", scope: !878, file: !3, line: 346, type: !44)
!897 = !DILocation(line: 346, column: 9, scope: !878)
!898 = !DILocalVariable(name: "msg_length", scope: !878, file: !3, line: 347, type: !44)
!899 = !DILocation(line: 347, column: 9, scope: !878)
!900 = !DILocalVariable(name: "step", scope: !878, file: !3, line: 348, type: !901)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "_step_t", file: !3, line: 42, baseType: !10)
!902 = !DILocation(line: 348, column: 13, scope: !878)
!903 = !DILocation(line: 350, column: 9, scope: !904)
!904 = distinct !DILexicalBlock(scope: !878, file: !3, line: 350, column: 9)
!905 = !DILocation(line: 350, column: 14, scope: !904)
!906 = !DILocation(line: 350, column: 9, scope: !878)
!907 = !DILocation(line: 351, column: 13, scope: !908)
!908 = distinct !DILexicalBlock(scope: !909, file: !3, line: 351, column: 13)
!909 = distinct !DILexicalBlock(scope: !904, file: !3, line: 350, column: 21)
!910 = !DILocation(line: 351, column: 22, scope: !908)
!911 = !DILocation(line: 351, column: 13, scope: !909)
!912 = !DILocation(line: 352, column: 13, scope: !913)
!913 = distinct !DILexicalBlock(scope: !908, file: !3, line: 351, column: 41)
!914 = !DILocation(line: 353, column: 9, scope: !913)
!915 = !DILocation(line: 354, column: 13, scope: !916)
!916 = distinct !DILexicalBlock(scope: !908, file: !3, line: 353, column: 16)
!917 = !DILocation(line: 356, column: 5, scope: !909)
!918 = !DILocation(line: 359, column: 5, scope: !878)
!919 = distinct !{!919, !918, !918}
!920 = !DILocalVariable(name: "__d0", scope: !921, file: !3, line: 359, type: !44)
!921 = distinct !DILexicalBlock(scope: !878, file: !3, line: 359, column: 5)
!922 = !DILocation(line: 359, column: 5, scope: !921)
!923 = !DILocalVariable(name: "__d1", scope: !921, file: !3, line: 359, type: !44)
!924 = !{i32 -2146758666}
!925 = !DILocation(line: 360, column: 5, scope: !878)
!926 = !DILocation(line: 365, column: 10, scope: !878)
!927 = !DILocation(line: 366, column: 22, scope: !878)
!928 = !DILocation(line: 366, column: 27, scope: !878)
!929 = !DILocation(line: 366, column: 36, scope: !878)
!930 = !DILocation(line: 366, column: 50, scope: !878)
!931 = !DILocation(line: 366, column: 20, scope: !878)
!932 = !DILocation(line: 368, column: 9, scope: !933)
!933 = distinct !DILexicalBlock(scope: !878, file: !3, line: 368, column: 9)
!934 = !DILocation(line: 368, column: 18, scope: !933)
!935 = !DILocation(line: 368, column: 9, scope: !878)
!936 = !DILocation(line: 371, column: 13, scope: !937)
!937 = distinct !DILexicalBlock(scope: !938, file: !3, line: 371, column: 13)
!938 = distinct !DILexicalBlock(scope: !933, file: !3, line: 368, column: 37)
!939 = !DILocation(line: 371, column: 18, scope: !937)
!940 = !DILocation(line: 371, column: 37, scope: !937)
!941 = !DILocation(line: 371, column: 44, scope: !937)
!942 = !DILocation(line: 371, column: 49, scope: !937)
!943 = !DILocation(line: 371, column: 52, scope: !937)
!944 = !DILocation(line: 371, column: 57, scope: !937)
!945 = !DILocation(line: 371, column: 76, scope: !937)
!946 = !DILocation(line: 371, column: 84, scope: !937)
!947 = !DILocation(line: 371, column: 13, scope: !938)
!948 = !DILocation(line: 373, column: 18, scope: !949)
!949 = distinct !DILexicalBlock(scope: !937, file: !3, line: 371, column: 90)
!950 = !DILocation(line: 374, column: 9, scope: !949)
!951 = !DILocation(line: 376, column: 25, scope: !952)
!952 = distinct !DILexicalBlock(scope: !937, file: !3, line: 374, column: 16)
!953 = !DILocation(line: 376, column: 30, scope: !952)
!954 = !DILocation(line: 376, column: 49, scope: !952)
!955 = !DILocation(line: 376, column: 16, scope: !952)
!956 = !DILocation(line: 376, column: 23, scope: !952)
!957 = !DILocation(line: 377, column: 26, scope: !952)
!958 = !DILocation(line: 377, column: 31, scope: !952)
!959 = !DILocation(line: 377, column: 50, scope: !952)
!960 = !DILocation(line: 377, column: 16, scope: !952)
!961 = !DILocation(line: 377, column: 24, scope: !952)
!962 = !DILocation(line: 378, column: 18, scope: !952)
!963 = !DILocation(line: 380, column: 5, scope: !938)
!964 = !DILocation(line: 381, column: 21, scope: !965)
!965 = distinct !DILexicalBlock(scope: !933, file: !3, line: 380, column: 12)
!966 = !DILocation(line: 381, column: 26, scope: !965)
!967 = !DILocation(line: 381, column: 43, scope: !965)
!968 = !DILocation(line: 381, column: 12, scope: !965)
!969 = !DILocation(line: 381, column: 19, scope: !965)
!970 = !DILocation(line: 382, column: 22, scope: !965)
!971 = !DILocation(line: 382, column: 27, scope: !965)
!972 = !DILocation(line: 382, column: 44, scope: !965)
!973 = !DILocation(line: 382, column: 12, scope: !965)
!974 = !DILocation(line: 382, column: 20, scope: !965)
!975 = !DILocation(line: 383, column: 14, scope: !965)
!976 = !DILocation(line: 386, column: 5, scope: !878)
!977 = !DILocation(line: 386, column: 12, scope: !878)
!978 = !DILocation(line: 386, column: 27, scope: !878)
!979 = !DILocation(line: 387, column: 14, scope: !980)
!980 = distinct !DILexicalBlock(scope: !878, file: !3, line: 386, column: 33)
!981 = !DILocation(line: 387, column: 19, scope: !980)
!982 = !DILocation(line: 387, column: 28, scope: !980)
!983 = !DILocation(line: 387, column: 35, scope: !980)
!984 = !DILocation(line: 387, column: 47, scope: !980)
!985 = !DILocation(line: 387, column: 53, scope: !980)
!986 = !DILocation(line: 387, column: 12, scope: !980)
!987 = !DILocation(line: 388, column: 13, scope: !988)
!988 = distinct !DILexicalBlock(scope: !980, file: !3, line: 388, column: 13)
!989 = !DILocation(line: 388, column: 16, scope: !988)
!990 = !DILocation(line: 388, column: 13, scope: !980)
!991 = !DILocation(line: 389, column: 26, scope: !992)
!992 = distinct !DILexicalBlock(scope: !988, file: !3, line: 388, column: 23)
!993 = !DILocation(line: 389, column: 13, scope: !992)
!994 = !DILocation(line: 390, column: 17, scope: !995)
!995 = distinct !DILexicalBlock(scope: !992, file: !3, line: 390, column: 17)
!996 = !DILocation(line: 390, column: 22, scope: !995)
!997 = !DILocation(line: 390, column: 37, scope: !995)
!998 = !DILocation(line: 390, column: 17, scope: !992)
!999 = !DILocalVariable(name: "saved_errno", scope: !1000, file: !3, line: 391, type: !44)
!1000 = distinct !DILexicalBlock(scope: !995, file: !3, line: 390, column: 67)
!1001 = !DILocation(line: 391, column: 21, scope: !1000)
!1002 = !DILocation(line: 391, column: 35, scope: !1000)
!1003 = !DILocation(line: 393, column: 21, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 393, column: 21)
!1005 = !DILocation(line: 393, column: 27, scope: !1004)
!1006 = !DILocation(line: 393, column: 21, scope: !1000)
!1007 = !DILocation(line: 394, column: 45, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 393, column: 41)
!1009 = !DILocation(line: 394, column: 21, scope: !1008)
!1010 = !DILocation(line: 395, column: 34, scope: !1008)
!1011 = !DILocation(line: 395, column: 21, scope: !1008)
!1012 = !DILocation(line: 396, column: 17, scope: !1008)
!1013 = !DILocation(line: 396, column: 28, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 396, column: 28)
!1015 = !DILocation(line: 396, column: 34, scope: !1014)
!1016 = !DILocation(line: 396, column: 28, scope: !1004)
!1017 = !DILocation(line: 397, column: 34, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 396, column: 44)
!1019 = !DILocation(line: 397, column: 21, scope: !1018)
!1020 = !DILocation(line: 398, column: 36, scope: !1018)
!1021 = !DILocation(line: 398, column: 21, scope: !1018)
!1022 = !DILocation(line: 399, column: 17, scope: !1018)
!1023 = !DILocation(line: 400, column: 25, scope: !1000)
!1024 = !DILocation(line: 400, column: 17, scope: !1000)
!1025 = !DILocation(line: 400, column: 23, scope: !1000)
!1026 = !DILocation(line: 401, column: 13, scope: !1000)
!1027 = !DILocation(line: 402, column: 13, scope: !992)
!1028 = !DILocation(line: 405, column: 14, scope: !980)
!1029 = !DILocation(line: 405, column: 19, scope: !980)
!1030 = !DILocation(line: 405, column: 28, scope: !980)
!1031 = !DILocation(line: 405, column: 33, scope: !980)
!1032 = !DILocation(line: 405, column: 38, scope: !980)
!1033 = !DILocation(line: 405, column: 44, scope: !980)
!1034 = !DILocation(line: 405, column: 42, scope: !980)
!1035 = !DILocation(line: 405, column: 56, scope: !980)
!1036 = !DILocation(line: 405, column: 12, scope: !980)
!1037 = !DILocation(line: 406, column: 13, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !980, file: !3, line: 406, column: 13)
!1039 = !DILocation(line: 406, column: 16, scope: !1038)
!1040 = !DILocation(line: 406, column: 13, scope: !980)
!1041 = !DILocation(line: 407, column: 13, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 406, column: 22)
!1043 = !DILocation(line: 407, column: 19, scope: !1042)
!1044 = !DILocation(line: 408, column: 16, scope: !1042)
!1045 = !DILocation(line: 409, column: 9, scope: !1042)
!1046 = !DILocation(line: 411, column: 13, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !980, file: !3, line: 411, column: 13)
!1048 = !DILocation(line: 411, column: 16, scope: !1047)
!1049 = !DILocation(line: 411, column: 13, scope: !980)
!1050 = !DILocation(line: 412, column: 26, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 411, column: 23)
!1052 = !DILocation(line: 412, column: 13, scope: !1051)
!1053 = !DILocation(line: 413, column: 18, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 413, column: 17)
!1055 = !DILocation(line: 413, column: 23, scope: !1054)
!1056 = !DILocation(line: 413, column: 38, scope: !1054)
!1057 = !DILocation(line: 413, column: 68, scope: !1054)
!1058 = !DILocation(line: 414, column: 18, scope: !1054)
!1059 = !DILocation(line: 414, column: 24, scope: !1054)
!1060 = !DILocation(line: 414, column: 38, scope: !1054)
!1061 = !DILocation(line: 414, column: 41, scope: !1054)
!1062 = !DILocation(line: 414, column: 47, scope: !1054)
!1063 = !DILocation(line: 414, column: 63, scope: !1054)
!1064 = !DILocation(line: 415, column: 18, scope: !1054)
!1065 = !DILocation(line: 415, column: 24, scope: !1054)
!1066 = !DILocation(line: 413, column: 17, scope: !1051)
!1067 = !DILocalVariable(name: "saved_errno", scope: !1068, file: !3, line: 416, type: !44)
!1068 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 415, column: 35)
!1069 = !DILocation(line: 416, column: 21, scope: !1068)
!1070 = !DILocation(line: 416, column: 35, scope: !1068)
!1071 = !DILocation(line: 417, column: 30, scope: !1068)
!1072 = !DILocation(line: 417, column: 17, scope: !1068)
!1073 = !DILocation(line: 418, column: 32, scope: !1068)
!1074 = !DILocation(line: 418, column: 17, scope: !1068)
!1075 = !DILocation(line: 420, column: 25, scope: !1068)
!1076 = !DILocation(line: 420, column: 17, scope: !1068)
!1077 = !DILocation(line: 420, column: 23, scope: !1068)
!1078 = !DILocation(line: 421, column: 13, scope: !1068)
!1079 = !DILocation(line: 422, column: 13, scope: !1051)
!1080 = !DILocation(line: 426, column: 13, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !980, file: !3, line: 426, column: 13)
!1082 = !DILocation(line: 426, column: 18, scope: !1081)
!1083 = !DILocation(line: 426, column: 13, scope: !980)
!1084 = !DILocalVariable(name: "i", scope: !1085, file: !3, line: 427, type: !44)
!1085 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 426, column: 25)
!1086 = !DILocation(line: 427, column: 17, scope: !1085)
!1087 = !DILocation(line: 428, column: 19, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 428, column: 13)
!1089 = !DILocation(line: 428, column: 18, scope: !1088)
!1090 = !DILocation(line: 428, column: 23, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 428, column: 13)
!1092 = !DILocation(line: 428, column: 27, scope: !1091)
!1093 = !DILocation(line: 428, column: 25, scope: !1091)
!1094 = !DILocation(line: 428, column: 13, scope: !1088)
!1095 = !DILocation(line: 429, column: 34, scope: !1091)
!1096 = !DILocation(line: 429, column: 38, scope: !1091)
!1097 = !DILocation(line: 429, column: 51, scope: !1091)
!1098 = !DILocation(line: 429, column: 49, scope: !1091)
!1099 = !DILocation(line: 429, column: 17, scope: !1091)
!1100 = !DILocation(line: 428, column: 32, scope: !1091)
!1101 = !DILocation(line: 428, column: 13, scope: !1091)
!1102 = distinct !{!1102, !1094, !1103}
!1103 = !DILocation(line: 429, column: 53, scope: !1088)
!1104 = !DILocation(line: 430, column: 9, scope: !1085)
!1105 = !DILocation(line: 433, column: 23, scope: !980)
!1106 = !DILocation(line: 433, column: 20, scope: !980)
!1107 = !DILocation(line: 435, column: 27, scope: !980)
!1108 = !DILocation(line: 435, column: 24, scope: !980)
!1109 = !DILocation(line: 437, column: 13, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !980, file: !3, line: 437, column: 13)
!1111 = !DILocation(line: 437, column: 28, scope: !1110)
!1112 = !DILocation(line: 437, column: 13, scope: !980)
!1113 = !DILocation(line: 438, column: 21, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 437, column: 34)
!1115 = !DILocation(line: 438, column: 13, scope: !1114)
!1116 = !DILocation(line: 442, column: 21, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 438, column: 27)
!1118 = !DILocation(line: 442, column: 25, scope: !1117)
!1119 = !DILocation(line: 442, column: 30, scope: !1117)
!1120 = !DILocation(line: 442, column: 39, scope: !1117)
!1121 = !DILocation(line: 443, column: 21, scope: !1117)
!1122 = !DILocation(line: 441, column: 34, scope: !1117)
!1123 = !DILocation(line: 441, column: 32, scope: !1117)
!1124 = !DILocation(line: 444, column: 21, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1117, file: !3, line: 444, column: 21)
!1126 = !DILocation(line: 444, column: 36, scope: !1125)
!1127 = !DILocation(line: 444, column: 21, scope: !1117)
!1128 = !DILocation(line: 445, column: 26, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 444, column: 42)
!1130 = !DILocation(line: 446, column: 21, scope: !1129)
!1131 = !DILocation(line: 444, column: 39, scope: !1125)
!1132 = !DILocation(line: 450, column: 21, scope: !1117)
!1133 = !DILocation(line: 450, column: 26, scope: !1117)
!1134 = !DILocation(line: 450, column: 31, scope: !1117)
!1135 = !DILocation(line: 449, column: 34, scope: !1117)
!1136 = !DILocation(line: 449, column: 32, scope: !1117)
!1137 = !DILocation(line: 451, column: 22, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1117, file: !3, line: 451, column: 21)
!1139 = !DILocation(line: 451, column: 35, scope: !1138)
!1140 = !DILocation(line: 451, column: 33, scope: !1138)
!1141 = !DILocation(line: 451, column: 58, scope: !1138)
!1142 = !DILocation(line: 451, column: 63, scope: !1138)
!1143 = !DILocation(line: 451, column: 72, scope: !1138)
!1144 = !DILocation(line: 451, column: 51, scope: !1138)
!1145 = !DILocation(line: 451, column: 21, scope: !1117)
!1146 = !DILocation(line: 452, column: 21, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 451, column: 88)
!1148 = !DILocation(line: 452, column: 27, scope: !1147)
!1149 = !DILocation(line: 453, column: 34, scope: !1147)
!1150 = !DILocation(line: 453, column: 21, scope: !1147)
!1151 = !DILocation(line: 454, column: 21, scope: !1147)
!1152 = !DILocation(line: 456, column: 22, scope: !1117)
!1153 = !DILocation(line: 457, column: 17, scope: !1117)
!1154 = !DILocation(line: 459, column: 17, scope: !1117)
!1155 = !DILocation(line: 461, column: 9, scope: !1114)
!1156 = !DILocation(line: 463, column: 13, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !980, file: !3, line: 463, column: 13)
!1158 = !DILocation(line: 463, column: 28, scope: !1157)
!1159 = !DILocation(line: 463, column: 32, scope: !1157)
!1160 = !DILocation(line: 464, column: 14, scope: !1157)
!1161 = !DILocation(line: 464, column: 19, scope: !1157)
!1162 = !DILocation(line: 464, column: 32, scope: !1157)
!1163 = !DILocation(line: 464, column: 39, scope: !1157)
!1164 = !DILocation(line: 464, column: 43, scope: !1157)
!1165 = !DILocation(line: 464, column: 46, scope: !1157)
!1166 = !DILocation(line: 464, column: 51, scope: !1157)
!1167 = !DILocation(line: 464, column: 64, scope: !1157)
!1168 = !DILocation(line: 464, column: 72, scope: !1157)
!1169 = !DILocation(line: 463, column: 13, scope: !980)
!1170 = !DILocation(line: 468, column: 25, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 464, column: 78)
!1172 = !DILocation(line: 468, column: 30, scope: !1171)
!1173 = !DILocation(line: 468, column: 43, scope: !1171)
!1174 = !DILocation(line: 468, column: 16, scope: !1171)
!1175 = !DILocation(line: 468, column: 23, scope: !1171)
!1176 = !DILocation(line: 469, column: 26, scope: !1171)
!1177 = !DILocation(line: 469, column: 31, scope: !1171)
!1178 = !DILocation(line: 469, column: 44, scope: !1171)
!1179 = !DILocation(line: 469, column: 16, scope: !1171)
!1180 = !DILocation(line: 469, column: 24, scope: !1171)
!1181 = !DILocation(line: 470, column: 18, scope: !1171)
!1182 = !DILocation(line: 471, column: 9, scope: !1171)
!1183 = distinct !{!1183, !976, !1184}
!1184 = !DILocation(line: 474, column: 5, scope: !878)
!1185 = !DILocation(line: 476, column: 9, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !878, file: !3, line: 476, column: 9)
!1187 = !DILocation(line: 476, column: 14, scope: !1186)
!1188 = !DILocation(line: 476, column: 9, scope: !878)
!1189 = !DILocation(line: 477, column: 9, scope: !1186)
!1190 = !DILocation(line: 479, column: 12, scope: !878)
!1191 = !DILocation(line: 479, column: 17, scope: !878)
!1192 = !DILocation(line: 479, column: 26, scope: !878)
!1193 = !DILocation(line: 479, column: 42, scope: !878)
!1194 = !DILocation(line: 479, column: 47, scope: !878)
!1195 = !DILocation(line: 479, column: 52, scope: !878)
!1196 = !DILocation(line: 479, column: 5, scope: !878)
!1197 = !DILocation(line: 480, column: 1, scope: !878)
!1198 = distinct !DISubprogram(name: "compute_meta_length_after_function", scope: !3, file: !3, line: 252, type: !1199, isLocal: true, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!45, !44, !881}
!1201 = !DILocalVariable(name: "function", arg: 1, scope: !1198, file: !3, line: 252, type: !44)
!1202 = !DILocation(line: 252, column: 55, scope: !1198)
!1203 = !DILocalVariable(name: "msg_type", arg: 2, scope: !1198, file: !3, line: 253, type: !881)
!1204 = !DILocation(line: 253, column: 62, scope: !1198)
!1205 = !DILocalVariable(name: "length", scope: !1198, file: !3, line: 255, type: !44)
!1206 = !DILocation(line: 255, column: 9, scope: !1198)
!1207 = !DILocation(line: 257, column: 9, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 257, column: 9)
!1209 = !DILocation(line: 257, column: 18, scope: !1208)
!1210 = !DILocation(line: 257, column: 9, scope: !1198)
!1211 = !DILocation(line: 258, column: 13, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1213, file: !3, line: 258, column: 13)
!1213 = distinct !DILexicalBlock(scope: !1208, file: !3, line: 257, column: 37)
!1214 = !DILocation(line: 258, column: 22, scope: !1212)
!1215 = !DILocation(line: 258, column: 13, scope: !1213)
!1216 = !DILocation(line: 259, column: 20, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 258, column: 58)
!1218 = !DILocation(line: 260, column: 9, scope: !1217)
!1219 = !DILocation(line: 260, column: 20, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 260, column: 20)
!1221 = !DILocation(line: 260, column: 29, scope: !1220)
!1222 = !DILocation(line: 260, column: 63, scope: !1220)
!1223 = !DILocation(line: 261, column: 20, scope: !1220)
!1224 = !DILocation(line: 261, column: 29, scope: !1220)
!1225 = !DILocation(line: 260, column: 20, scope: !1212)
!1226 = !DILocation(line: 262, column: 20, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1220, file: !3, line: 261, column: 68)
!1228 = !DILocation(line: 263, column: 9, scope: !1227)
!1229 = !DILocation(line: 263, column: 20, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1220, file: !3, line: 263, column: 20)
!1231 = !DILocation(line: 263, column: 29, scope: !1230)
!1232 = !DILocation(line: 263, column: 20, scope: !1220)
!1233 = !DILocation(line: 264, column: 20, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1230, file: !3, line: 263, column: 63)
!1235 = !DILocation(line: 265, column: 9, scope: !1234)
!1236 = !DILocation(line: 265, column: 20, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1230, file: !3, line: 265, column: 20)
!1238 = !DILocation(line: 265, column: 29, scope: !1237)
!1239 = !DILocation(line: 265, column: 20, scope: !1230)
!1240 = !DILocation(line: 266, column: 20, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1237, file: !3, line: 265, column: 68)
!1242 = !DILocation(line: 267, column: 9, scope: !1241)
!1243 = !DILocation(line: 269, column: 20, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1237, file: !3, line: 267, column: 16)
!1245 = !DILocation(line: 271, column: 5, scope: !1213)
!1246 = !DILocation(line: 273, column: 17, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1208, file: !3, line: 271, column: 12)
!1248 = !DILocation(line: 273, column: 9, scope: !1247)
!1249 = !DILocation(line: 278, column: 20, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1247, file: !3, line: 273, column: 27)
!1251 = !DILocation(line: 279, column: 13, scope: !1250)
!1252 = !DILocation(line: 281, column: 20, scope: !1250)
!1253 = !DILocation(line: 282, column: 13, scope: !1250)
!1254 = !DILocation(line: 284, column: 20, scope: !1250)
!1255 = !DILocation(line: 285, column: 9, scope: !1250)
!1256 = !DILocation(line: 288, column: 12, scope: !1198)
!1257 = !DILocation(line: 288, column: 5, scope: !1198)
!1258 = distinct !DISubprogram(name: "compute_data_length_after_meta", scope: !3, file: !3, line: 292, type: !879, isLocal: true, isDefinition: true, scopeLine: 294, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!1259 = !DILocalVariable(name: "ctx", arg: 1, scope: !1258, file: !3, line: 292, type: !478)
!1260 = !DILocation(line: 292, column: 53, scope: !1258)
!1261 = !DILocalVariable(name: "msg", arg: 2, scope: !1258, file: !3, line: 292, type: !61)
!1262 = !DILocation(line: 292, column: 67, scope: !1258)
!1263 = !DILocalVariable(name: "msg_type", arg: 3, scope: !1258, file: !3, line: 293, type: !881)
!1264 = !DILocation(line: 293, column: 54, scope: !1258)
!1265 = !DILocalVariable(name: "function", scope: !1258, file: !3, line: 295, type: !44)
!1266 = !DILocation(line: 295, column: 9, scope: !1258)
!1267 = !DILocation(line: 295, column: 20, scope: !1258)
!1268 = !DILocation(line: 295, column: 24, scope: !1258)
!1269 = !DILocation(line: 295, column: 29, scope: !1258)
!1270 = !DILocation(line: 295, column: 38, scope: !1258)
!1271 = !DILocalVariable(name: "length", scope: !1258, file: !3, line: 296, type: !44)
!1272 = !DILocation(line: 296, column: 9, scope: !1258)
!1273 = !DILocation(line: 298, column: 9, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1258, file: !3, line: 298, column: 9)
!1275 = !DILocation(line: 298, column: 18, scope: !1274)
!1276 = !DILocation(line: 298, column: 9, scope: !1258)
!1277 = !DILocation(line: 299, column: 17, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1274, file: !3, line: 298, column: 37)
!1279 = !DILocation(line: 299, column: 9, scope: !1278)
!1280 = !DILocation(line: 302, column: 22, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1278, file: !3, line: 299, column: 27)
!1282 = !DILocation(line: 302, column: 26, scope: !1281)
!1283 = !DILocation(line: 302, column: 31, scope: !1281)
!1284 = !DILocation(line: 302, column: 40, scope: !1281)
!1285 = !DILocation(line: 302, column: 54, scope: !1281)
!1286 = !DILocation(line: 302, column: 20, scope: !1281)
!1287 = !DILocation(line: 303, column: 13, scope: !1281)
!1288 = !DILocation(line: 305, column: 22, scope: !1281)
!1289 = !DILocation(line: 305, column: 26, scope: !1281)
!1290 = !DILocation(line: 305, column: 31, scope: !1281)
!1291 = !DILocation(line: 305, column: 40, scope: !1281)
!1292 = !DILocation(line: 305, column: 54, scope: !1281)
!1293 = !DILocation(line: 305, column: 20, scope: !1281)
!1294 = !DILocation(line: 306, column: 13, scope: !1281)
!1295 = !DILocation(line: 308, column: 20, scope: !1281)
!1296 = !DILocation(line: 309, column: 9, scope: !1281)
!1297 = !DILocation(line: 310, column: 5, scope: !1278)
!1298 = !DILocation(line: 312, column: 13, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1300, file: !3, line: 312, column: 13)
!1300 = distinct !DILexicalBlock(scope: !1274, file: !3, line: 310, column: 12)
!1301 = !DILocation(line: 312, column: 22, scope: !1299)
!1302 = !DILocation(line: 312, column: 56, scope: !1299)
!1303 = !DILocation(line: 313, column: 13, scope: !1299)
!1304 = !DILocation(line: 313, column: 22, scope: !1299)
!1305 = !DILocation(line: 313, column: 51, scope: !1299)
!1306 = !DILocation(line: 314, column: 13, scope: !1299)
!1307 = !DILocation(line: 314, column: 22, scope: !1299)
!1308 = !DILocation(line: 312, column: 13, scope: !1300)
!1309 = !DILocation(line: 315, column: 22, scope: !1310)
!1310 = distinct !DILexicalBlock(scope: !1299, file: !3, line: 314, column: 61)
!1311 = !DILocation(line: 315, column: 26, scope: !1310)
!1312 = !DILocation(line: 315, column: 31, scope: !1310)
!1313 = !DILocation(line: 315, column: 40, scope: !1310)
!1314 = !DILocation(line: 315, column: 54, scope: !1310)
!1315 = !DILocation(line: 315, column: 20, scope: !1310)
!1316 = !DILocation(line: 316, column: 9, scope: !1310)
!1317 = !DILocation(line: 317, column: 20, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1299, file: !3, line: 316, column: 16)
!1319 = !DILocation(line: 321, column: 15, scope: !1258)
!1320 = !DILocation(line: 321, column: 20, scope: !1258)
!1321 = !DILocation(line: 321, column: 29, scope: !1258)
!1322 = !DILocation(line: 321, column: 12, scope: !1258)
!1323 = !DILocation(line: 323, column: 12, scope: !1258)
!1324 = !DILocation(line: 323, column: 5, scope: !1258)
!1325 = distinct !DISubprogram(name: "modbus_receive", scope: !3, file: !3, line: 483, type: !530, isLocal: false, isDefinition: true, scopeLine: 484, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!1326 = !DILocalVariable(name: "ctx", arg: 1, scope: !1325, file: !3, line: 483, type: !478)
!1327 = !DILocation(line: 483, column: 30, scope: !1325)
!1328 = !DILocalVariable(name: "req", arg: 2, scope: !1325, file: !3, line: 483, type: !61)
!1329 = !DILocation(line: 483, column: 44, scope: !1325)
!1330 = !DILocation(line: 485, column: 9, scope: !1331)
!1331 = distinct !DILexicalBlock(scope: !1325, file: !3, line: 485, column: 9)
!1332 = !DILocation(line: 485, column: 13, scope: !1331)
!1333 = !DILocation(line: 485, column: 9, scope: !1325)
!1334 = !DILocation(line: 486, column: 9, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !1331, file: !3, line: 485, column: 22)
!1336 = !DILocation(line: 486, column: 15, scope: !1335)
!1337 = !DILocation(line: 487, column: 9, scope: !1335)
!1338 = !DILocation(line: 490, column: 12, scope: !1325)
!1339 = !DILocation(line: 490, column: 17, scope: !1325)
!1340 = !DILocation(line: 490, column: 26, scope: !1325)
!1341 = !DILocation(line: 490, column: 34, scope: !1325)
!1342 = !DILocation(line: 490, column: 39, scope: !1325)
!1343 = !DILocation(line: 490, column: 5, scope: !1325)
!1344 = !DILocation(line: 491, column: 1, scope: !1325)
!1345 = distinct !DISubprogram(name: "modbus_receive_confirmation", scope: !3, file: !3, line: 501, type: !530, isLocal: false, isDefinition: true, scopeLine: 502, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!1346 = !DILocalVariable(name: "ctx", arg: 1, scope: !1345, file: !3, line: 501, type: !478)
!1347 = !DILocation(line: 501, column: 43, scope: !1345)
!1348 = !DILocalVariable(name: "rsp", arg: 2, scope: !1345, file: !3, line: 501, type: !61)
!1349 = !DILocation(line: 501, column: 57, scope: !1345)
!1350 = !DILocation(line: 503, column: 9, scope: !1351)
!1351 = distinct !DILexicalBlock(scope: !1345, file: !3, line: 503, column: 9)
!1352 = !DILocation(line: 503, column: 13, scope: !1351)
!1353 = !DILocation(line: 503, column: 9, scope: !1345)
!1354 = !DILocation(line: 504, column: 9, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1351, file: !3, line: 503, column: 22)
!1356 = !DILocation(line: 504, column: 15, scope: !1355)
!1357 = !DILocation(line: 505, column: 9, scope: !1355)
!1358 = !DILocation(line: 508, column: 32, scope: !1345)
!1359 = !DILocation(line: 508, column: 37, scope: !1345)
!1360 = !DILocation(line: 508, column: 12, scope: !1345)
!1361 = !DILocation(line: 508, column: 5, scope: !1345)
!1362 = !DILocation(line: 509, column: 1, scope: !1345)
!1363 = distinct !DISubprogram(name: "modbus_reply", scope: !3, file: !3, line: 705, type: !1364, isLocal: false, isDefinition: true, scopeLine: 707, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !440)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{!44, !478, !171, !44, !48}
!1366 = !DILocalVariable(name: "ctx", arg: 1, scope: !1363, file: !3, line: 705, type: !478)
!1367 = !DILocation(line: 705, column: 28, scope: !1363)
!1368 = !DILocalVariable(name: "req", arg: 2, scope: !1363, file: !3, line: 705, type: !171)
!1369 = !DILocation(line: 705, column: 48, scope: !1363)
!1370 = !DILocalVariable(name: "req_length", arg: 3, scope: !1363, file: !3, line: 706, type: !44)
!1371 = !DILocation(line: 706, column: 22, scope: !1363)
