; ModuleID = 'libnfc.so.5.0.1.0.0.preopt.bc'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nfc_driver_list = type { %struct.nfc_driver_list*, %struct.nfc_driver* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ByteMirror", scope: !2, file: !3, line: 40, type: !11, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !10)
!3 = !DIFile(filename: "mirror-subr.c", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 48, baseType: !9)
!8 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc")
!9 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = !{!0}
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2048, elements: !13)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!13 = !{!14}
!14 = !DISubrange(count: 256)
!15 = !DIGlobalVariableExpression(var: !16)
!16 = distinct !DIGlobalVariable(name: "nfc_drivers", scope: !17, file: !18, line: 130, type: !75, isLocal: false, isDefinition: true)
!17 = distinct !DICompileUnit(language: DW_LANG_C99, file: !18, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !19, retainedTypes: !70, globals: !368)
!18 = !DIFile(filename: "nfc.c", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc")
!19 = !{!20, !26, !37, !44, !49, !66}
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 116, size: 32, elements: !22)
!21 = !DIFile(filename: "./nfc-internal.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc")
!22 = !{!23, !24, !25}
!23 = !DIEnumerator(name: "NOT_INTRUSIVE", value: 0)
!24 = !DIEnumerator(name: "INTRUSIVE", value: 1)
!25 = !DIEnumerator(name: "NOT_AVAILABLE", value: 2)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 295, size: 32, elements: !28)
!27 = !DIFile(filename: "../include/nfc/nfc-types.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36}
!29 = !DIEnumerator(name: "NMT_ISO14443A", value: 1)
!30 = !DIEnumerator(name: "NMT_JEWEL", value: 2)
!31 = !DIEnumerator(name: "NMT_ISO14443B", value: 3)
!32 = !DIEnumerator(name: "NMT_ISO14443BI", value: 4)
!33 = !DIEnumerator(name: "NMT_ISO14443B2SR", value: 5)
!34 = !DIEnumerator(name: "NMT_ISO14443B2CT", value: 6)
!35 = !DIEnumerator(name: "NMT_FELICA", value: 7)
!36 = !DIEnumerator(name: "NMT_DEP", value: 8)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 283, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "NBR_UNDEFINED", value: 0)
!40 = !DIEnumerator(name: "NBR_106", value: 1)
!41 = !DIEnumerator(name: "NBR_212", value: 2)
!42 = !DIEnumerator(name: "NBR_424", value: 3)
!43 = !DIEnumerator(name: "NBR_847", value: 4)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 151, size: 32, elements: !45)
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "NDM_UNDEFINED", value: 0)
!47 = !DIEnumerator(name: "NDM_PASSIVE", value: 1)
!48 = !DIEnumerator(name: "NDM_ACTIVE", value: 2)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 67, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!51 = !DIEnumerator(name: "NP_TIMEOUT_COMMAND", value: 0)
!52 = !DIEnumerator(name: "NP_TIMEOUT_ATR", value: 1)
!53 = !DIEnumerator(name: "NP_TIMEOUT_COM", value: 2)
!54 = !DIEnumerator(name: "NP_HANDLE_CRC", value: 3)
!55 = !DIEnumerator(name: "NP_HANDLE_PARITY", value: 4)
!56 = !DIEnumerator(name: "NP_ACTIVATE_FIELD", value: 5)
!57 = !DIEnumerator(name: "NP_ACTIVATE_CRYPTO1", value: 6)
!58 = !DIEnumerator(name: "NP_INFINITE_SELECT", value: 7)
!59 = !DIEnumerator(name: "NP_ACCEPT_INVALID_FRAMES", value: 8)
!60 = !DIEnumerator(name: "NP_ACCEPT_MULTIPLE_FRAMES", value: 9)
!61 = !DIEnumerator(name: "NP_AUTO_ISO14443_4", value: 10)
!62 = !DIEnumerator(name: "NP_EASY_FRAMING", value: 11)
!63 = !DIEnumerator(name: "NP_FORCE_ISO14443_A", value: 12)
!64 = !DIEnumerator(name: "NP_FORCE_ISO14443_B", value: 13)
!65 = !DIEnumerator(name: "NP_FORCE_SPEED_106", value: 14)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 310, size: 32, elements: !67)
!67 = !{!68, !69}
!68 = !DIEnumerator(name: "N_TARGET", value: 0)
!69 = !DIEnumerator(name: "N_INITIATOR", value: 1)
!70 = !{!71, !134, !364, !95}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nfc_driver_list", file: !18, line: 125, size: 128, elements: !73)
!73 = !{!74, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !72, file: !18, line: 126, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !72, file: !18, line: 127, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nfc_driver", file: !21, line: 122, size: 1920, elements: !81)
!81 = !{!82, !86, !89, !124, !146, !150, !156, !160, !161, !273, !278, !287, !288, !292, !296, !301, !305, !311, !315, !319, !323, !327, !331, !338, !342, !352, !359, !365, !366, !367}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !21, line: 123, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "scan_type", scope: !80, file: !21, line: 124, baseType: !87, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "scan_type_enum", file: !21, line: 120, baseType: !20)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "scan", scope: !80, file: !21, line: 125, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!93, !96, !122, !123}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 62, baseType: !95)
!94 = !DIFile(filename: "/home/stly/Documents/llvm/llvm-build/lib/clang/5.0.0/include/stddef.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc")
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_context", file: !27, line: 47, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nfc_context", file: !21, line: 175, size: 41088, elements: !100)
!100 = !{!101, !103, !104, !107, !121}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "allow_autoscan", scope: !99, file: !21, line: 176, baseType: !102, size: 8)
!102 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "allow_intrusive_scan", scope: !99, file: !21, line: 177, baseType: !102, size: 8, offset: 8)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !99, file: !21, line: 178, baseType: !105, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 51, baseType: !106)
!106 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "user_defined_devices", scope: !99, file: !21, line: 179, baseType: !108, size: 40992, offset: 64)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 40992, elements: !119)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nfc_user_defined_device", file: !21, line: 164, size: 10248, elements: !110)
!110 = !{!111, !113, !118}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !21, line: 165, baseType: !112, size: 2048)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 2048, elements: !13)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "connstring", scope: !109, file: !21, line: 166, baseType: !114, size: 8192, offset: 2048)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_connstring", file: !27, line: 62, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 8192, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1024)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "optional", scope: !109, file: !21, line: 167, baseType: !102, size: 8, offset: 10240)
!119 = !{!120}
!120 = !DISubrange(count: 4)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "user_defined_device_count", scope: !99, file: !21, line: 180, baseType: !106, size: 32, offset: 41056)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !80, file: !21, line: 126, baseType: !125, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !96, !83}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nfc_device", file: !21, line: 190, size: 10624, elements: !130)
!130 = !{!131, !132, !133, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !129, file: !21, line: 191, baseType: !96, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !129, file: !21, line: 192, baseType: !78, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "driver_data", scope: !129, file: !21, line: 193, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "chip_data", scope: !129, file: !21, line: 194, baseType: !134, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !21, line: 197, baseType: !112, size: 2048, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "connstring", scope: !129, file: !21, line: 199, baseType: !114, size: 8192, offset: 2304)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "bCrc", scope: !129, file: !21, line: 201, baseType: !102, size: 8, offset: 10496)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "bPar", scope: !129, file: !21, line: 203, baseType: !102, size: 8, offset: 10504)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "bEasyFraming", scope: !129, file: !21, line: 205, baseType: !102, size: 8, offset: 10512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "bInfiniteSelect", scope: !129, file: !21, line: 207, baseType: !102, size: 8, offset: 10520)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "bAutoIso14443_4", scope: !129, file: !21, line: 210, baseType: !102, size: 8, offset: 10528)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "btSupportByte", scope: !129, file: !21, line: 212, baseType: !7, size: 8, offset: 10536)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !129, file: !21, line: 214, baseType: !145, size: 32, offset: 10560)
!145 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !80, file: !21, line: 127, baseType: !147, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !128}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "strerror", scope: !80, file: !21, line: 128, baseType: !151, size: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!83, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_init", scope: !80, file: !21, line: 130, baseType: !157, size: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!145, !128}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_init_secure_element", scope: !80, file: !21, line: 131, baseType: !157, size: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_select_passive_target", scope: !80, file: !21, line: 132, baseType: !162, size: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!145, !128, !165, !173, !123, !174}
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_modulation", file: !27, line: 322, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 319, size: 64, elements: !168)
!168 = !{!169, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nmt", scope: !167, file: !27, line: 320, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_modulation_type", file: !27, line: 304, baseType: !26)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nbr", scope: !167, file: !27, line: 321, baseType: !172, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_baud_rate", file: !27, line: 289, baseType: !37)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_target", file: !27, line: 331, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 328, size: 2328, elements: !177)
!177 = !{!178, !272}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nti", scope: !176, file: !27, line: 329, baseType: !179, size: 2264)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_target_info", file: !27, line: 277, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !27, line: 268, size: 2264, elements: !181)
!181 = !{!182, !201, !213, !225, !237, !242, !249, !255}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nai", scope: !180, file: !27, line: 269, baseType: !183, size: 2264)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_iso14443a_info", file: !27, line: 192, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 185, size: 2264, elements: !185)
!185 = !{!186, !190, !191, !192, !196, !197}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "abtAtqa", scope: !184, file: !27, line: 186, baseType: !187, size: 16)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 2)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "btSak", scope: !184, file: !27, line: 187, baseType: !7, size: 8, offset: 16)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "szUidLen", scope: !184, file: !27, line: 188, baseType: !93, size: 64, offset: 24)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "abtUid", scope: !184, file: !27, line: 189, baseType: !193, size: 80, offset: 88)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 80, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 10)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "szAtsLen", scope: !184, file: !27, line: 190, baseType: !93, size: 64, offset: 168)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "abtAts", scope: !184, file: !27, line: 191, baseType: !198, size: 2032, offset: 232)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2032, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 254)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nfi", scope: !180, file: !27, line: 270, baseType: !202, size: 216)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_felica_info", file: !27, line: 204, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 198, size: 216, elements: !204)
!204 = !{!205, !206, !207, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "szLen", scope: !203, file: !27, line: 199, baseType: !93, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "btResCode", scope: !203, file: !27, line: 200, baseType: !7, size: 8, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "abtId", scope: !203, file: !27, line: 201, baseType: !208, size: 64, offset: 72)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 8)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "abtPad", scope: !203, file: !27, line: 202, baseType: !208, size: 64, offset: 136)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "abtSysCode", scope: !203, file: !27, line: 203, baseType: !187, size: 16, offset: 200)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nbi", scope: !180, file: !27, line: 271, baseType: !214, size: 96)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_iso14443b_info", file: !27, line: 219, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 210, size: 96, elements: !216)
!216 = !{!217, !219, !220, !224}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "abtPupi", scope: !215, file: !27, line: 212, baseType: !218, size: 32)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !119)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "abtApplicationData", scope: !215, file: !27, line: 214, baseType: !218, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "abtProtocolInfo", scope: !215, file: !27, line: 216, baseType: !221, size: 24, offset: 64)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 3)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ui8CardIdentifier", scope: !215, file: !27, line: 218, baseType: !7, size: 8, offset: 88)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nii", scope: !180, file: !27, line: 272, baseType: !226, size: 376)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_iso14443bi_info", file: !27, line: 235, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 225, size: 376, elements: !228)
!228 = !{!229, !230, !231, !232, !233}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "abtDIV", scope: !227, file: !27, line: 227, baseType: !218, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "btVerLog", scope: !227, file: !27, line: 229, baseType: !7, size: 8, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "btConfig", scope: !227, file: !27, line: 231, baseType: !7, size: 8, offset: 40)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "szAtrLen", scope: !227, file: !27, line: 233, baseType: !93, size: 64, offset: 48)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "abtAtr", scope: !227, file: !27, line: 234, baseType: !234, size: 264, offset: 112)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 264, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 33)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nsi", scope: !180, file: !27, line: 273, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_iso14443b2sr_info", file: !27, line: 243, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 241, size: 64, elements: !240)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "abtUID", scope: !239, file: !27, line: 242, baseType: !208, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nci", scope: !180, file: !27, line: 274, baseType: !243, size: 48)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_iso14443b2ct_info", file: !27, line: 253, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 249, size: 48, elements: !245)
!245 = !{!246, !247, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "abtUID", scope: !244, file: !27, line: 250, baseType: !218, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "btProdCode", scope: !244, file: !27, line: 251, baseType: !7, size: 8, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "btFabCode", scope: !244, file: !27, line: 252, baseType: !7, size: 8, offset: 40)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nji", scope: !180, file: !27, line: 275, baseType: !250, size: 48)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_jewel_info", file: !27, line: 262, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 259, size: 48, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "btSensRes", scope: !251, file: !27, line: 260, baseType: !187, size: 16)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "btId", scope: !251, file: !27, line: 261, baseType: !218, size: 32, offset: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ndi", scope: !180, file: !27, line: 276, baseType: !256, size: 600)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_dep_info", file: !27, line: 179, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 161, size: 600, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !269, !270}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "abtNFCID3", scope: !257, file: !27, line: 163, baseType: !193, size: 80)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "btDID", scope: !257, file: !27, line: 165, baseType: !7, size: 8, offset: 80)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "btBS", scope: !257, file: !27, line: 167, baseType: !7, size: 8, offset: 88)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "btBR", scope: !257, file: !27, line: 169, baseType: !7, size: 8, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "btTO", scope: !257, file: !27, line: 171, baseType: !7, size: 8, offset: 104)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "btPP", scope: !257, file: !27, line: 173, baseType: !7, size: 8, offset: 112)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "abtGB", scope: !257, file: !27, line: 175, baseType: !266, size: 384, offset: 120)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 384, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 48)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "szGB", scope: !257, file: !27, line: 176, baseType: !93, size: 64, offset: 504)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ndm", scope: !257, file: !27, line: 178, baseType: !271, size: 32, offset: 568)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_dep_mode", file: !27, line: 155, baseType: !44)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "nm", scope: !176, file: !27, line: 330, baseType: !166, size: 64, offset: 2264)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_poll_target", scope: !80, file: !21, line: 133, baseType: !274, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!145, !128, !277, !123, !12, !12, !174}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_select_dep_target", scope: !80, file: !21, line: 134, baseType: !279, size: 64, offset: 640)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!145, !128, !282, !283, !284, !174, !286}
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_deselect_target", scope: !80, file: !21, line: 135, baseType: !157, size: 64, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_transceive_bytes", scope: !80, file: !21, line: 136, baseType: !289, size: 64, offset: 768)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!145, !128, !173, !123, !6, !123, !145}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_transceive_bits", scope: !80, file: !21, line: 137, baseType: !293, size: 64, offset: 832)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!145, !128, !173, !123, !173, !6, !6}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_transceive_bytes_timed", scope: !80, file: !21, line: 138, baseType: !297, size: 64, offset: 896)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!145, !128, !173, !123, !6, !123, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_transceive_bits_timed", scope: !80, file: !21, line: 139, baseType: !302, size: 64, offset: 960)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!145, !128, !173, !123, !173, !6, !6, !300}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_target_is_present", scope: !80, file: !21, line: 140, baseType: !306, size: 64, offset: 1024)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!145, !128, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "target_init", scope: !80, file: !21, line: 142, baseType: !312, size: 64, offset: 1088)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!145, !128, !174, !6, !123, !145}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "target_send_bytes", scope: !80, file: !21, line: 143, baseType: !316, size: 64, offset: 1152)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!145, !128, !173, !123, !145}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "target_receive_bytes", scope: !80, file: !21, line: 144, baseType: !320, size: 64, offset: 1216)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!145, !128, !6, !123, !145}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "target_send_bits", scope: !80, file: !21, line: 145, baseType: !324, size: 64, offset: 1280)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!145, !128, !173, !123, !173}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "target_receive_bits", scope: !80, file: !21, line: 146, baseType: !328, size: 64, offset: 1344)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!145, !128, !6, !123, !6}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "device_set_property_bool", scope: !80, file: !21, line: 148, baseType: !332, size: 64, offset: 1408)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!145, !128, !335, !337}
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_property", file: !27, line: 142, baseType: !49)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "device_set_property_int", scope: !80, file: !21, line: 149, baseType: !339, size: 64, offset: 1472)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!145, !128, !335, !286}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "get_supported_modulation", scope: !80, file: !21, line: 150, baseType: !343, size: 64, offset: 1536)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!145, !128, !346, !348}
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_mode", file: !27, line: 313, baseType: !66)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "get_supported_baud_rate", scope: !80, file: !21, line: 151, baseType: !353, size: 64, offset: 1600)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!145, !128, !351, !356}
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_information_about", scope: !80, file: !21, line: 152, baseType: !360, size: 64, offset: 1664)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!145, !128, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "abort_command", scope: !80, file: !21, line: 154, baseType: !157, size: 64, offset: 1728)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !80, file: !21, line: 155, baseType: !157, size: 64, offset: 1792)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "powerdown", scope: !80, file: !21, line: 156, baseType: !157, size: 64, offset: 1856)
!368 = !{!15, !369}
!369 = !DIGlobalVariableExpression(var: !370)
!370 = distinct !DIGlobalVariable(name: "sErrorMessages", scope: !17, file: !18, line: 1079, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 1664, elements: !376)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sErrorMessage", file: !18, line: 1076, size: 128, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "iErrorCode", scope: !372, file: !18, line: 1077, baseType: !145, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pcErrorMsg", scope: !372, file: !18, line: 1078, baseType: !83, size: 64, offset: 64)
!376 = !{!377}
!377 = !DISubrange(count: 13)
!378 = !DIGlobalVariableExpression(var: !379)
!379 = distinct !DIGlobalVariable(name: "iMaxFrameSizes", scope: !380, file: !381, line: 544, type: !490, isLocal: true, isDefinition: true)
!380 = distinct !DISubprogram(name: "snprint_nfc_iso14443b_info", scope: !381, file: !381, line: 505, type: !382, isLocal: false, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: true, unit: !393, variables: !493)
!381 = !DIFile(filename: "target-subr.c", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc")
!382 = !DISubroutineType(types: !383)
!383 = !{null, !364, !93, !384, !102}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_iso14443b_info", file: !27, line: 219, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 210, size: 96, elements: !388)
!388 = !{!389, !390, !391, !392}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "abtPupi", scope: !387, file: !27, line: 212, baseType: !218, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "abtApplicationData", scope: !387, file: !27, line: 214, baseType: !218, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "abtProtocolInfo", scope: !387, file: !27, line: 216, baseType: !221, size: 24, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ui8CardIdentifier", scope: !387, file: !27, line: 218, baseType: !7, size: 8, offset: 88)
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !394, retainedTypes: !395, globals: !398)
!394 = !{!44, !26, !37}
!395 = !{!396, !7, !105, !134}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 49, baseType: !397)
!397 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!398 = !{!399, !414, !422, !378}
!399 = !DIGlobalVariableExpression(var: !400)
!400 = distinct !DIGlobalVariable(name: "const_ca", scope: !393, file: !381, line: 50, type: !401, isLocal: false, isDefinition: true)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 18368, elements: !412)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "card_atqa", file: !381, line: 36, size: 1312, elements: !403)
!403 = !{!404, !405, !406, !410}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "atqa", scope: !402, file: !381, line: 37, baseType: !396, size: 16)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !402, file: !381, line: 38, baseType: !396, size: 16, offset: 16)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !402, file: !381, line: 39, baseType: !407, size: 1024, offset: 32)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 1024, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "saklist", scope: !402, file: !381, line: 41, baseType: !411, size: 256, offset: 1056)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 256, elements: !209)
!412 = !{!413}
!413 = !DISubrange(count: 14)
!414 = !DIGlobalVariableExpression(var: !415)
!415 = distinct !DIGlobalVariable(name: "const_cs", scope: !393, file: !381, line: 109, type: !416, isLocal: false, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 13520, elements: !376)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "card_sak", file: !381, line: 44, size: 1040, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sak", scope: !417, file: !381, line: 45, baseType: !7, size: 8)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !417, file: !381, line: 46, baseType: !7, size: 8, offset: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !417, file: !381, line: 47, baseType: !407, size: 1024, offset: 16)
!422 = !DIGlobalVariableExpression(var: !423)
!423 = distinct !DIGlobalVariable(name: "iMaxFrameSizes", scope: !424, file: !381, line: 207, type: !490, isLocal: true, isDefinition: true)
!424 = distinct !DISubprogram(name: "snprint_nfc_iso14443a_info", scope: !381, file: !381, line: 142, type: !425, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, unit: !393, variables: !438)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !364, !93, !427, !102}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_iso14443a_info", file: !27, line: 192, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 185, size: 2264, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "abtAtqa", scope: !430, file: !27, line: 186, baseType: !187, size: 16)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "btSak", scope: !430, file: !27, line: 187, baseType: !7, size: 8, offset: 16)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "szUidLen", scope: !430, file: !27, line: 188, baseType: !93, size: 64, offset: 24)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "abtUid", scope: !430, file: !27, line: 189, baseType: !193, size: 80, offset: 88)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "szAtsLen", scope: !430, file: !27, line: 190, baseType: !93, size: 64, offset: 168)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "abtAts", scope: !430, file: !27, line: 191, baseType: !198, size: 2032, offset: 232)
!438 = !{!439, !440, !441, !442, !443, !444, !447, !450, !453, !456, !459, !464, !467, !470, !473, !476, !477, !478, !479, !480, !489}
!439 = !DILocalVariable(name: "dst", arg: 1, scope: !424, file: !381, line: 142, type: !364)
!440 = !DILocalVariable(name: "size", arg: 2, scope: !424, file: !381, line: 142, type: !93)
!441 = !DILocalVariable(name: "pnai", arg: 3, scope: !424, file: !381, line: 142, type: !427)
!442 = !DILocalVariable(name: "verbose", arg: 4, scope: !424, file: !381, line: 142, type: !102)
!443 = !DILocalVariable(name: "off", scope: !424, file: !381, line: 144, type: !145)
!444 = !DILocalVariable(name: "offset", scope: !445, file: !381, line: 210, type: !93)
!445 = distinct !DILexicalBlock(scope: !446, file: !381, line: 205, column: 34)
!446 = distinct !DILexicalBlock(scope: !424, file: !381, line: 205, column: 7)
!447 = !DILocalVariable(name: "TA", scope: !448, file: !381, line: 212, type: !7)
!448 = distinct !DILexicalBlock(scope: !449, file: !381, line: 211, column: 33)
!449 = distinct !DILexicalBlock(scope: !445, file: !381, line: 211, column: 9)
!450 = !DILocalVariable(name: "TB", scope: !451, file: !381, line: 244, type: !7)
!451 = distinct !DILexicalBlock(scope: !452, file: !381, line: 243, column: 33)
!452 = distinct !DILexicalBlock(scope: !445, file: !381, line: 243, column: 9)
!453 = !DILocalVariable(name: "TC", scope: !454, file: !381, line: 254, type: !7)
!454 = distinct !DILexicalBlock(scope: !455, file: !381, line: 253, column: 33)
!455 = distinct !DILexicalBlock(scope: !445, file: !381, line: 253, column: 9)
!456 = !DILocalVariable(name: "CIB", scope: !457, file: !381, line: 270, type: !7)
!457 = distinct !DILexicalBlock(scope: !458, file: !381, line: 267, column: 34)
!458 = distinct !DILexicalBlock(scope: !445, file: !381, line: 267, column: 9)
!459 = !DILocalVariable(name: "L", scope: !460, file: !381, line: 276, type: !7)
!460 = distinct !DILexicalBlock(scope: !461, file: !381, line: 274, column: 26)
!461 = distinct !DILexicalBlock(scope: !462, file: !381, line: 274, column: 13)
!462 = distinct !DILexicalBlock(scope: !463, file: !381, line: 272, column: 63)
!463 = distinct !DILexicalBlock(scope: !457, file: !381, line: 272, column: 11)
!464 = !DILocalVariable(name: "CTC", scope: !465, file: !381, line: 283, type: !7)
!465 = distinct !DILexicalBlock(scope: !466, file: !381, line: 282, column: 50)
!466 = distinct !DILexicalBlock(scope: !460, file: !381, line: 282, column: 15)
!467 = !DILocalVariable(name: "CVC", scope: !468, file: !381, line: 326, type: !7)
!468 = distinct !DILexicalBlock(scope: !469, file: !381, line: 325, column: 46)
!469 = distinct !DILexicalBlock(scope: !460, file: !381, line: 325, column: 15)
!470 = !DILocalVariable(name: "VCS", scope: !471, file: !381, line: 360, type: !7)
!471 = distinct !DILexicalBlock(scope: !472, file: !381, line: 359, column: 46)
!472 = distinct !DILexicalBlock(scope: !460, file: !381, line: 359, column: 15)
!473 = !DILocalVariable(name: "atqa", scope: !474, file: !381, line: 404, type: !396)
!474 = distinct !DILexicalBlock(scope: !475, file: !381, line: 402, column: 16)
!475 = distinct !DILexicalBlock(scope: !424, file: !381, line: 402, column: 7)
!476 = !DILocalVariable(name: "sak", scope: !474, file: !381, line: 405, type: !7)
!477 = !DILocalVariable(name: "i", scope: !474, file: !381, line: 406, type: !7)
!478 = !DILocalVariable(name: "j", scope: !474, file: !381, line: 406, type: !7)
!479 = !DILocalVariable(name: "found_possible_match", scope: !474, file: !381, line: 407, type: !102)
!480 = !DILocalVariable(name: "sakindex", scope: !481, file: !381, line: 416, type: !145)
!481 = distinct !DILexicalBlock(scope: !482, file: !381, line: 415, column: 127)
!482 = distinct !DILexicalBlock(scope: !483, file: !381, line: 415, column: 9)
!483 = distinct !DILexicalBlock(scope: !484, file: !381, line: 415, column: 9)
!484 = distinct !DILexicalBlock(scope: !485, file: !381, line: 414, column: 58)
!485 = distinct !DILexicalBlock(scope: !486, file: !381, line: 414, column: 11)
!486 = distinct !DILexicalBlock(scope: !487, file: !381, line: 413, column: 66)
!487 = distinct !DILexicalBlock(scope: !488, file: !381, line: 413, column: 5)
!488 = distinct !DILexicalBlock(scope: !474, file: !381, line: 413, column: 5)
!489 = !DILocalVariable(name: "atqasak", scope: !474, file: !381, line: 428, type: !105)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 288, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 9)
!493 = !{!494, !495, !496, !497, !498}
!494 = !DILocalVariable(name: "dst", arg: 1, scope: !380, file: !381, line: 505, type: !364)
!495 = !DILocalVariable(name: "size", arg: 2, scope: !380, file: !381, line: 505, type: !93)
!496 = !DILocalVariable(name: "pnbi", arg: 3, scope: !380, file: !381, line: 505, type: !384)
!497 = !DILocalVariable(name: "verbose", arg: 4, scope: !380, file: !381, line: 505, type: !102)
!498 = !DILocalVariable(name: "off", scope: !380, file: !381, line: 507, type: !145)
!499 = !DIGlobalVariableExpression(var: !500)
!500 = distinct !DIGlobalVariable(name: "pn53x_supported_modulation_as_target", scope: !501, file: !502, line: 61, type: !1042, isLocal: false, isDefinition: true)
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !503, retainedTypes: !573, globals: !882)
!502 = !DIFile(filename: "pn53x.c", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/chips")
!503 = !{!504, !506, !507, !509, !510, !511, !512, !520, !526, !531, !537, !556, !562}
!504 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !505, line: 283, size: 32, elements: !38)
!505 = !DIFile(filename: "../../include/nfc/nfc-types.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/chips")
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !505, line: 295, size: 32, elements: !28)
!507 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !508, line: 116, size: 32, elements: !22)
!508 = !DIFile(filename: "../../libnfc/nfc-internal.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/chips")
!509 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !505, line: 151, size: 32, elements: !45)
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !505, line: 67, size: 32, elements: !50)
!511 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !505, line: 310, size: 32, elements: !67)
!512 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !513, line: 130, size: 32, elements: !514)
!513 = !DIFile(filename: "./pn53x-internal.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/chips")
!514 = !{!515, !516, !517, !518, !519}
!515 = !DIEnumerator(name: "PN53X", value: 0)
!516 = !DIEnumerator(name: "PN531", value: 1)
!517 = !DIEnumerator(name: "PN532", value: 2)
!518 = !DIEnumerator(name: "PN533", value: 4)
!519 = !DIEnumerator(name: "RCS360", value: 8)
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !521, line: 126, size: 32, elements: !522)
!521 = !DIFile(filename: "./pn53x.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/chips")
!522 = !{!523, !524, !525}
!523 = !DIEnumerator(name: "NORMAL", value: 0)
!524 = !DIEnumerator(name: "POWERDOWN", value: 1)
!525 = !DIEnumerator(name: "LOWVBAT", value: 2)
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !521, line: 136, size: 32, elements: !527)
!527 = !{!528, !529, !530}
!528 = !DIEnumerator(name: "IDLE", value: 0)
!529 = !DIEnumerator(name: "INITIATOR", value: 1)
!530 = !DIEnumerator(name: "TARGET", value: 2)
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !521, line: 146, size: 32, elements: !532)
!532 = !{!533, !534, !535, !536}
!533 = !DIEnumerator(name: "PSM_NORMAL", value: 1)
!534 = !DIEnumerator(name: "PSM_VIRTUAL_CARD", value: 2)
!535 = !DIEnumerator(name: "PSM_WIRED_CARD", value: 3)
!536 = !DIEnumerator(name: "PSM_DUAL_CARD", value: 4)
!537 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !521, line: 246, size: 32, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!539 = !DIEnumerator(name: "PTT_UNDEFINED", value: -1)
!540 = !DIEnumerator(name: "PTT_GENERIC_PASSIVE_106", value: 0)
!541 = !DIEnumerator(name: "PTT_GENERIC_PASSIVE_212", value: 1)
!542 = !DIEnumerator(name: "PTT_GENERIC_PASSIVE_424", value: 2)
!543 = !DIEnumerator(name: "PTT_ISO14443_4B_106", value: 3)
!544 = !DIEnumerator(name: "PTT_JEWEL_106", value: 4)
!545 = !DIEnumerator(name: "PTT_MIFARE", value: 16)
!546 = !DIEnumerator(name: "PTT_FELICA_212", value: 17)
!547 = !DIEnumerator(name: "PTT_FELICA_424", value: 18)
!548 = !DIEnumerator(name: "PTT_ISO14443_4A_106", value: 32)
!549 = !DIEnumerator(name: "PTT_ISO14443_4B_TCL_106", value: 35)
!550 = !DIEnumerator(name: "PTT_DEP_PASSIVE_106", value: 64)
!551 = !DIEnumerator(name: "PTT_DEP_PASSIVE_212", value: 65)
!552 = !DIEnumerator(name: "PTT_DEP_PASSIVE_424", value: 66)
!553 = !DIEnumerator(name: "PTT_DEP_ACTIVE_106", value: 128)
!554 = !DIEnumerator(name: "PTT_DEP_ACTIVE_212", value: 129)
!555 = !DIEnumerator(name: "PTT_DEP_ACTIVE_424", value: 130)
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !521, line: 287, size: 32, elements: !557)
!557 = !{!558, !559, !560, !561}
!558 = !DIEnumerator(name: "PTM_NORMAL", value: 0)
!559 = !DIEnumerator(name: "PTM_PASSIVE_ONLY", value: 1)
!560 = !DIEnumerator(name: "PTM_DEP_ONLY", value: 2)
!561 = !DIEnumerator(name: "PTM_ISO14443_4_PICC_ONLY", value: 4)
!562 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !521, line: 221, size: 32, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572}
!564 = !DIEnumerator(name: "PM_UNDEFINED", value: -1)
!565 = !DIEnumerator(name: "PM_ISO14443A_106", value: 0)
!566 = !DIEnumerator(name: "PM_FELICA_212", value: 1)
!567 = !DIEnumerator(name: "PM_FELICA_424", value: 2)
!568 = !DIEnumerator(name: "PM_ISO14443B_106", value: 3)
!569 = !DIEnumerator(name: "PM_JEWEL_106", value: 4)
!570 = !DIEnumerator(name: "PM_ISO14443B_212", value: 6)
!571 = !DIEnumerator(name: "PM_ISO14443B_424", value: 7)
!572 = !DIEnumerator(name: "PM_ISO14443B_847", value: 8)
!573 = !{!574, !879, !606, !145, !777, !134, !602, !881}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pn53x_data", file: !521, line: 173, size: 1856, elements: !576)
!576 = !{!577, !579, !583, !585, !587, !684, !686, !860, !861, !862, !863, !864, !867, !869, !873, !874, !875, !876, !877, !878, !880}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !575, file: !521, line: 175, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "pn53x_type", file: !513, line: 136, baseType: !512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "firmware_text", scope: !575, file: !521, line: 177, baseType: !580, size: 176, offset: 32)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 176, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 22)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "power_mode", scope: !575, file: !521, line: 179, baseType: !584, size: 32, offset: 224)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "pn53x_power_mode", file: !521, line: 130, baseType: !520)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "operating_mode", scope: !575, file: !521, line: 181, baseType: !586, size: 32, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "pn53x_operating_mode", file: !521, line: 140, baseType: !526)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "current_target", scope: !575, file: !521, line: 183, baseType: !588, size: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_target", file: !505, line: 331, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 328, size: 2328, elements: !591)
!591 = !{!592, !676}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nti", scope: !590, file: !505, line: 329, baseType: !593, size: 2264)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_target_info", file: !505, line: 277, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !505, line: 268, size: 2264, elements: !595)
!595 = !{!596, !613, !623, !633, !643, !648, !655, !661}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "nai", scope: !594, file: !505, line: 269, baseType: !597, size: 2264)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_iso14443a_info", file: !505, line: 192, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 185, size: 2264, elements: !599)
!599 = !{!600, !604, !605, !608, !610, !611}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "abtAtqa", scope: !598, file: !505, line: 186, baseType: !601, size: 16)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 16, elements: !188)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !603, line: 200, baseType: !9)
!603 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/chips")
!604 = !DIDerivedType(tag: DW_TAG_member, name: "btSak", scope: !598, file: !505, line: 187, baseType: !602, size: 8, offset: 16)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "szUidLen", scope: !598, file: !505, line: 188, baseType: !606, size: 64, offset: 24)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !607, line: 62, baseType: !95)
!607 = !DIFile(filename: "/home/stly/Documents/llvm/llvm-build/lib/clang/5.0.0/include/stddef.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/chips")
!608 = !DIDerivedType(tag: DW_TAG_member, name: "abtUid", scope: !598, file: !505, line: 189, baseType: !609, size: 80, offset: 88)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 80, elements: !194)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "szAtsLen", scope: !598, file: !505, line: 190, baseType: !606, size: 64, offset: 168)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "abtAts", scope: !598, file: !505, line: 191, baseType: !612, size: 2032, offset: 232)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 2032, elements: !199)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nfi", scope: !594, file: !505, line: 270, baseType: !614, size: 216)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_felica_info", file: !505, line: 204, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 198, size: 216, elements: !616)
!616 = !{!617, !618, !619, !621, !622}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "szLen", scope: !615, file: !505, line: 199, baseType: !606, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "btResCode", scope: !615, file: !505, line: 200, baseType: !602, size: 8, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "abtId", scope: !615, file: !505, line: 201, baseType: !620, size: 64, offset: 72)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 64, elements: !209)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "abtPad", scope: !615, file: !505, line: 202, baseType: !620, size: 64, offset: 136)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "abtSysCode", scope: !615, file: !505, line: 203, baseType: !601, size: 16, offset: 200)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nbi", scope: !594, file: !505, line: 271, baseType: !624, size: 96)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_iso14443b_info", file: !505, line: 219, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 210, size: 96, elements: !626)
!626 = !{!627, !629, !630, !632}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "abtPupi", scope: !625, file: !505, line: 212, baseType: !628, size: 32)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 32, elements: !119)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "abtApplicationData", scope: !625, file: !505, line: 214, baseType: !628, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "abtProtocolInfo", scope: !625, file: !505, line: 216, baseType: !631, size: 24, offset: 64)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 24, elements: !222)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ui8CardIdentifier", scope: !625, file: !505, line: 218, baseType: !602, size: 8, offset: 88)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nii", scope: !594, file: !505, line: 272, baseType: !634, size: 376)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_iso14443bi_info", file: !505, line: 235, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 225, size: 376, elements: !636)
!636 = !{!637, !638, !639, !640, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "abtDIV", scope: !635, file: !505, line: 227, baseType: !628, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "btVerLog", scope: !635, file: !505, line: 229, baseType: !602, size: 8, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "btConfig", scope: !635, file: !505, line: 231, baseType: !602, size: 8, offset: 40)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "szAtrLen", scope: !635, file: !505, line: 233, baseType: !606, size: 64, offset: 48)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "abtAtr", scope: !635, file: !505, line: 234, baseType: !642, size: 264, offset: 112)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 264, elements: !235)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "nsi", scope: !594, file: !505, line: 273, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_iso14443b2sr_info", file: !505, line: 243, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 241, size: 64, elements: !646)
!646 = !{!647}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "abtUID", scope: !645, file: !505, line: 242, baseType: !620, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nci", scope: !594, file: !505, line: 274, baseType: !649, size: 48)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_iso14443b2ct_info", file: !505, line: 253, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 249, size: 48, elements: !651)
!651 = !{!652, !653, !654}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "abtUID", scope: !650, file: !505, line: 250, baseType: !628, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "btProdCode", scope: !650, file: !505, line: 251, baseType: !602, size: 8, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "btFabCode", scope: !650, file: !505, line: 252, baseType: !602, size: 8, offset: 40)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nji", scope: !594, file: !505, line: 275, baseType: !656, size: 48)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_jewel_info", file: !505, line: 262, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 259, size: 48, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "btSensRes", scope: !657, file: !505, line: 260, baseType: !601, size: 16)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "btId", scope: !657, file: !505, line: 261, baseType: !628, size: 32, offset: 16)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ndi", scope: !594, file: !505, line: 276, baseType: !662, size: 600)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_dep_info", file: !505, line: 179, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 161, size: 600, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670, !671, !673, !674}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "abtNFCID3", scope: !663, file: !505, line: 163, baseType: !609, size: 80)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "btDID", scope: !663, file: !505, line: 165, baseType: !602, size: 8, offset: 80)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "btBS", scope: !663, file: !505, line: 167, baseType: !602, size: 8, offset: 88)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "btBR", scope: !663, file: !505, line: 169, baseType: !602, size: 8, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "btTO", scope: !663, file: !505, line: 171, baseType: !602, size: 8, offset: 104)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "btPP", scope: !663, file: !505, line: 173, baseType: !602, size: 8, offset: 112)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "abtGB", scope: !663, file: !505, line: 175, baseType: !672, size: 384, offset: 120)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 384, elements: !267)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "szGB", scope: !663, file: !505, line: 176, baseType: !606, size: 64, offset: 504)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ndm", scope: !663, file: !505, line: 178, baseType: !675, size: 32, offset: 568)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_dep_mode", file: !505, line: 155, baseType: !509)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nm", scope: !590, file: !505, line: 330, baseType: !677, size: 64, offset: 2264)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_modulation", file: !505, line: 322, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 319, size: 64, elements: !679)
!679 = !{!680, !682}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "nmt", scope: !678, file: !505, line: 320, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_modulation_type", file: !505, line: 304, baseType: !506)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nbr", scope: !678, file: !505, line: 321, baseType: !683, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_baud_rate", file: !505, line: 289, baseType: !504)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "sam_mode", scope: !575, file: !521, line: 185, baseType: !685, size: 32, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "pn532_sam_mode", file: !521, line: 151, baseType: !531)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !575, file: !521, line: 187, baseType: !687, size: 64, offset: 448)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pn53x_io", file: !521, line: 158, size: 128, elements: !690)
!690 = !{!691, !859}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !689, file: !521, line: 159, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!145, !695, !757, !732, !145}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nfc_device", file: !508, line: 190, size: 10624, elements: !697)
!697 = !{!698, !718, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !696, file: !508, line: 191, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_context", file: !505, line: 47, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nfc_context", file: !508, line: 175, size: 41088, elements: !703)
!703 = !{!704, !705, !706, !709, !717}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "allow_autoscan", scope: !702, file: !508, line: 176, baseType: !102, size: 8)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "allow_intrusive_scan", scope: !702, file: !508, line: 177, baseType: !102, size: 8, offset: 8)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !702, file: !508, line: 178, baseType: !707, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !708, line: 51, baseType: !106)
!708 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/chips")
!709 = !DIDerivedType(tag: DW_TAG_member, name: "user_defined_devices", scope: !702, file: !508, line: 179, baseType: !710, size: 40992, offset: 64)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 40992, elements: !119)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nfc_user_defined_device", file: !508, line: 164, size: 10248, elements: !712)
!712 = !{!713, !714, !716}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !711, file: !508, line: 165, baseType: !112, size: 2048)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "connstring", scope: !711, file: !508, line: 166, baseType: !715, size: 8192, offset: 2048)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_connstring", file: !505, line: 62, baseType: !115)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "optional", scope: !711, file: !508, line: 167, baseType: !102, size: 8, offset: 10240)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "user_defined_device_count", scope: !702, file: !508, line: 180, baseType: !106, size: 32, offset: 41056)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !696, file: !508, line: 192, baseType: !719, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nfc_driver", file: !508, line: 122, size: 1920, elements: !722)
!722 = !{!723, !724, !727, !733, !737, !741, !747, !751, !752, !759, !764, !772, !773, !778, !782, !787, !791, !797, !801, !802, !806, !810, !814, !820, !824, !834, !841, !845, !846, !847}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !721, file: !508, line: 123, baseType: !83, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "scan_type", scope: !721, file: !508, line: 124, baseType: !725, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "scan_type_enum", file: !508, line: 120, baseType: !507)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "scan", scope: !721, file: !508, line: 125, baseType: !728, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!606, !699, !731, !732}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !721, file: !508, line: 126, baseType: !734, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!695, !699, !83}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !721, file: !508, line: 127, baseType: !738, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !695}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "strerror", scope: !721, file: !508, line: 128, baseType: !742, size: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!83, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !696)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_init", scope: !721, file: !508, line: 130, baseType: !748, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!145, !695}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_init_secure_element", scope: !721, file: !508, line: 131, baseType: !748, size: 64, offset: 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_select_passive_target", scope: !721, file: !508, line: 132, baseType: !753, size: 64, offset: 512)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!145, !695, !756, !757, !732, !588}
!756 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !677)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_poll_target", scope: !721, file: !508, line: 133, baseType: !760, size: 64, offset: 576)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!145, !695, !763, !732, !758, !758, !588}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_select_dep_target", scope: !721, file: !508, line: 134, baseType: !765, size: 64, offset: 640)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!145, !695, !768, !769, !770, !588, !286}
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !662)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_deselect_target", scope: !721, file: !508, line: 135, baseType: !748, size: 64, offset: 704)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_transceive_bytes", scope: !721, file: !508, line: 136, baseType: !774, size: 64, offset: 768)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!145, !695, !757, !732, !777, !732, !145}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_transceive_bits", scope: !721, file: !508, line: 137, baseType: !779, size: 64, offset: 832)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!145, !695, !757, !732, !757, !777, !777}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_transceive_bytes_timed", scope: !721, file: !508, line: 138, baseType: !783, size: 64, offset: 896)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!145, !695, !757, !732, !777, !732, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_transceive_bits_timed", scope: !721, file: !508, line: 139, baseType: !788, size: 64, offset: 960)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!145, !695, !757, !732, !757, !777, !777, !786}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "initiator_target_is_present", scope: !721, file: !508, line: 140, baseType: !792, size: 64, offset: 1024)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!145, !695, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !589)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "target_init", scope: !721, file: !508, line: 142, baseType: !798, size: 64, offset: 1088)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!145, !695, !588, !777, !732, !145}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "target_send_bytes", scope: !721, file: !508, line: 143, baseType: !692, size: 64, offset: 1152)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "target_receive_bytes", scope: !721, file: !508, line: 144, baseType: !803, size: 64, offset: 1216)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!145, !695, !777, !732, !145}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "target_send_bits", scope: !721, file: !508, line: 145, baseType: !807, size: 64, offset: 1280)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!145, !695, !757, !732, !757}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "target_receive_bits", scope: !721, file: !508, line: 146, baseType: !811, size: 64, offset: 1344)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!145, !695, !777, !732, !777}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "device_set_property_bool", scope: !721, file: !508, line: 148, baseType: !815, size: 64, offset: 1408)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!145, !695, !818, !337}
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_property", file: !505, line: 142, baseType: !510)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "device_set_property_int", scope: !721, file: !508, line: 149, baseType: !821, size: 64, offset: 1472)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!145, !695, !818, !286}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "get_supported_modulation", scope: !721, file: !508, line: 150, baseType: !825, size: 64, offset: 1536)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!145, !695, !828, !830}
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfc_mode", file: !505, line: 313, baseType: !511)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "get_supported_baud_rate", scope: !721, file: !508, line: 151, baseType: !835, size: 64, offset: 1600)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!145, !695, !833, !838}
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_information_about", scope: !721, file: !508, line: 152, baseType: !842, size: 64, offset: 1664)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!145, !695, !363}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "abort_command", scope: !721, file: !508, line: 154, baseType: !748, size: 64, offset: 1728)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !721, file: !508, line: 155, baseType: !748, size: 64, offset: 1792)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "powerdown", scope: !721, file: !508, line: 156, baseType: !748, size: 64, offset: 1856)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "driver_data", scope: !696, file: !508, line: 193, baseType: !134, size: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "chip_data", scope: !696, file: !508, line: 194, baseType: !134, size: 64, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !696, file: !508, line: 197, baseType: !112, size: 2048, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "connstring", scope: !696, file: !508, line: 199, baseType: !715, size: 8192, offset: 2304)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bCrc", scope: !696, file: !508, line: 201, baseType: !102, size: 8, offset: 10496)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "bPar", scope: !696, file: !508, line: 203, baseType: !102, size: 8, offset: 10504)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "bEasyFraming", scope: !696, file: !508, line: 205, baseType: !102, size: 8, offset: 10512)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "bInfiniteSelect", scope: !696, file: !508, line: 207, baseType: !102, size: 8, offset: 10520)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bAutoIso14443_4", scope: !696, file: !508, line: 210, baseType: !102, size: 8, offset: 10528)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "btSupportByte", scope: !696, file: !508, line: 212, baseType: !602, size: 8, offset: 10536)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !696, file: !508, line: 214, baseType: !145, size: 32, offset: 10560)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "receive", scope: !689, file: !521, line: 160, baseType: !803, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "last_status_byte", scope: !575, file: !521, line: 189, baseType: !602, size: 8, offset: 512)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ui8TxBits", scope: !575, file: !521, line: 191, baseType: !602, size: 8, offset: 520)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ui8Parameters", scope: !575, file: !521, line: 193, baseType: !602, size: 8, offset: 528)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "last_command", scope: !575, file: !521, line: 195, baseType: !602, size: 8, offset: 536)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "timer_correction", scope: !575, file: !521, line: 197, baseType: !865, size: 16, offset: 544)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !708, line: 37, baseType: !866)
!866 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "timer_prescaler", scope: !575, file: !521, line: 199, baseType: !868, size: 16, offset: 560)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !603, line: 201, baseType: !397)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "wb_data", scope: !575, file: !521, line: 201, baseType: !870, size: 496, offset: 576)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 496, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 62)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "wb_mask", scope: !575, file: !521, line: 202, baseType: !870, size: 496, offset: 1072)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "wb_trigged", scope: !575, file: !521, line: 203, baseType: !102, size: 8, offset: 1568)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_command", scope: !575, file: !521, line: 205, baseType: !145, size: 32, offset: 1600)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_atr", scope: !575, file: !521, line: 207, baseType: !145, size: 32, offset: 1632)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_communication", scope: !575, file: !521, line: 209, baseType: !145, size: 32, offset: 1664)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "supported_modulation_as_initiator", scope: !575, file: !521, line: 211, baseType: !879, size: 64, offset: 1728)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "supported_modulation_as_target", scope: !575, file: !521, line: 212, baseType: !879, size: 64, offset: 1792)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!882 = !{!883, !888, !890, !893, !896, !899, !901, !903, !499, !908, !919, !931, !934, !947, !959, !969, !1010, !1023, !1031, !1040}
!883 = !DIGlobalVariableExpression(var: !884)
!884 = distinct !DIGlobalVariable(name: "pn53x_ack_frame", scope: !501, file: !502, line: 52, type: !885, isLocal: false, isDefinition: true)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 48, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 6)
!888 = !DIGlobalVariableExpression(var: !889)
!889 = distinct !DIGlobalVariable(name: "pn53x_nack_frame", scope: !501, file: !502, line: 53, type: !885, isLocal: false, isDefinition: true)
!890 = !DIGlobalVariableExpression(var: !891)
!891 = distinct !DIGlobalVariable(name: "pn53x_iso14443a_supported_baud_rates", scope: !501, file: !502, line: 55, type: !892, isLocal: false, isDefinition: true)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 64, elements: !188)
!893 = !DIGlobalVariableExpression(var: !894)
!894 = distinct !DIGlobalVariable(name: "pn53x_felica_supported_baud_rates", scope: !501, file: !502, line: 56, type: !895, isLocal: false, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 96, elements: !222)
!896 = !DIGlobalVariableExpression(var: !897)
!897 = distinct !DIGlobalVariable(name: "pn53x_dep_supported_baud_rates", scope: !501, file: !502, line: 57, type: !898, isLocal: false, isDefinition: true)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 128, elements: !119)
!899 = !DIGlobalVariableExpression(var: !900)
!900 = distinct !DIGlobalVariable(name: "pn53x_jewel_supported_baud_rates", scope: !501, file: !502, line: 58, type: !892, isLocal: false, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902)
!902 = distinct !DIGlobalVariable(name: "pn532_iso14443b_supported_baud_rates", scope: !501, file: !502, line: 59, type: !892, isLocal: false, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904)
!904 = distinct !DIGlobalVariable(name: "pn533_iso14443b_supported_baud_rates", scope: !501, file: !502, line: 60, type: !905, isLocal: false, isDefinition: true)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 160, elements: !906)
!906 = !{!907}
!907 = !DISubrange(count: 5)
!908 = !DIGlobalVariableExpression(var: !909)
!909 = distinct !DIGlobalVariable(name: "abtCmd", scope: !910, file: !502, line: 748, type: !916, isLocal: true, isDefinition: true)
!910 = distinct !DISubprogram(name: "pn53x_decode_firmware_version", scope: !502, file: !502, line: 746, type: !749, isLocal: false, isDefinition: true, scopeLine: 747, flags: DIFlagPrototyped, isOptimized: true, unit: !501, variables: !911)
!911 = !{!912, !913, !914, !915}
!912 = !DILocalVariable(name: "pnd", arg: 1, scope: !910, file: !502, line: 746, type: !695)
!913 = !DILocalVariable(name: "abtFw", scope: !910, file: !502, line: 749, type: !628)
!914 = !DILocalVariable(name: "szFwLen", scope: !910, file: !502, line: 750, type: !606)
!915 = !DILocalVariable(name: "res", scope: !910, file: !502, line: 751, type: !145)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 8, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 1)
!919 = !DIGlobalVariableExpression(var: !920)
!920 = distinct !DIGlobalVariable(name: "abtCmd", scope: !921, file: !502, line: 1020, type: !930, isLocal: true, isDefinition: true)
!921 = distinct !DISubprogram(name: "pn53x_check_communication", scope: !502, file: !502, line: 1018, type: !749, isLocal: false, isDefinition: true, scopeLine: 1019, flags: DIFlagPrototyped, isOptimized: true, unit: !501, variables: !922)
!922 = !{!923, !924, !928, !929}
!923 = !DILocalVariable(name: "pnd", arg: 1, scope: !921, file: !502, line: 1018, type: !695)
!924 = !DILocalVariable(name: "abtRx", scope: !921, file: !502, line: 1022, type: !925)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 56, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 7)
!928 = !DILocalVariable(name: "szRx", scope: !921, file: !502, line: 1023, type: !606)
!929 = !DILocalVariable(name: "res", scope: !921, file: !502, line: 1024, type: !145)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 64, elements: !209)
!931 = !DIGlobalVariableExpression(var: !932)
!932 = distinct !DIGlobalVariable(name: "abtExpectedRx", scope: !921, file: !502, line: 1021, type: !933, isLocal: true, isDefinition: true)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 56, elements: !926)
!934 = !DIGlobalVariableExpression(var: !935)
!935 = distinct !DIGlobalVariable(name: "abtPassiveInitiatorData", scope: !936, file: !502, line: 1290, type: !946, isLocal: true, isDefinition: true)
!936 = distinct !DISubprogram(name: "pn53x_initiator_select_dep_target", scope: !502, file: !502, line: 1284, type: !766, isLocal: false, isDefinition: true, scopeLine: 1289, flags: DIFlagPrototyped, isOptimized: true, unit: !501, variables: !937)
!937 = !{!938, !939, !940, !941, !942, !943, !944, !945}
!938 = !DILocalVariable(name: "pnd", arg: 1, scope: !936, file: !502, line: 1284, type: !695)
!939 = !DILocalVariable(name: "ndm", arg: 2, scope: !936, file: !502, line: 1285, type: !768)
!940 = !DILocalVariable(name: "nbr", arg: 3, scope: !936, file: !502, line: 1285, type: !769)
!941 = !DILocalVariable(name: "pndiInitiator", arg: 4, scope: !936, file: !502, line: 1286, type: !770)
!942 = !DILocalVariable(name: "pnt", arg: 5, scope: !936, file: !502, line: 1287, type: !588)
!943 = !DILocalVariable(name: "timeout", arg: 6, scope: !936, file: !502, line: 1288, type: !286)
!944 = !DILocalVariable(name: "pbtPassiveInitiatorData", scope: !936, file: !502, line: 1291, type: !757)
!945 = !DILocalVariable(name: "res", scope: !936, file: !502, line: 1310, type: !145)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 40, elements: !906)
!947 = !DIGlobalVariableExpression(var: !948)
!948 = distinct !DIGlobalVariable(name: "pn53x_commands", scope: !501, file: !513, line: 153, type: !949, isLocal: true, isDefinition: true)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 4736, elements: !957)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "pn53x_command", file: !513, line: 128, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 122, size: 128, elements: !953)
!953 = !{!954, !955, !956}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ui8Code", scope: !952, file: !513, line: 123, baseType: !602, size: 8)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ui8CompatFlags", scope: !952, file: !513, line: 124, baseType: !602, size: 8, offset: 8)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "abtCommandText", scope: !952, file: !513, line: 126, baseType: !83, size: 64, offset: 64)
!957 = !{!958}
!958 = !DISubrange(count: 37)
!959 = !DIGlobalVariableExpression(var: !960)
!960 = distinct !DIGlobalVariable(name: "pn53x_registers", scope: !501, file: !513, line: 340, type: !961, isLocal: true, isDefinition: true)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 11904, elements: !871)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "pn53x_register", file: !513, line: 216, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 212, size: 192, elements: !965)
!965 = !{!966, !967, !968}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ui16Address", scope: !964, file: !513, line: 213, baseType: !868, size: 16)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "abtRegisterText", scope: !964, file: !513, line: 214, baseType: !83, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "abtRegisterDescription", scope: !964, file: !513, line: 215, baseType: !83, size: 64, offset: 128)
!969 = !DIGlobalVariableExpression(var: !970)
!970 = distinct !DIGlobalVariable(name: "abtReqt", scope: !971, file: !502, line: 1113, type: !916, isLocal: true, isDefinition: true)
!971 = distinct !DISubprogram(name: "pn53x_initiator_select_passive_target_ext", scope: !502, file: !502, line: 1061, type: !972, isLocal: true, isDefinition: true, scopeLine: 1066, flags: DIFlagPrototyped, isOptimized: true, unit: !501, variables: !974)
!972 = !DISubroutineType(types: !973)
!973 = !{!145, !695, !756, !757, !732, !588, !145}
!974 = !{!975, !976, !977, !978, !979, !980, !981, !985, !986, !987, !988, !991, !995, !996, !997, !999, !1002, !1006}
!975 = !DILocalVariable(name: "pnd", arg: 1, scope: !971, file: !502, line: 1061, type: !695)
!976 = !DILocalVariable(name: "nm", arg: 2, scope: !971, file: !502, line: 1062, type: !756)
!977 = !DILocalVariable(name: "pbtInitData", arg: 3, scope: !971, file: !502, line: 1063, type: !757)
!978 = !DILocalVariable(name: "szInitData", arg: 4, scope: !971, file: !502, line: 1063, type: !732)
!979 = !DILocalVariable(name: "pnt", arg: 5, scope: !971, file: !502, line: 1064, type: !588)
!980 = !DILocalVariable(name: "timeout", arg: 6, scope: !971, file: !502, line: 1065, type: !145)
!981 = !DILocalVariable(name: "abtTargetsData", scope: !971, file: !502, line: 1067, type: !982)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 2112, elements: !983)
!983 = !{!984}
!984 = !DISubrange(count: 264)
!985 = !DILocalVariable(name: "szTargetsData", scope: !971, file: !502, line: 1068, type: !606)
!986 = !DILocalVariable(name: "res", scope: !971, file: !502, line: 1069, type: !145)
!987 = !DILocalVariable(name: "nttmp", scope: !971, file: !502, line: 1070, type: !589)
!988 = !DILocalVariable(name: "found", scope: !989, file: !502, line: 1091, type: !102)
!989 = distinct !DILexicalBlock(scope: !990, file: !502, line: 1072, column: 93)
!990 = distinct !DILexicalBlock(scope: !971, file: !502, line: 1072, column: 7)
!991 = !DILocalVariable(name: "abtInitiate", scope: !992, file: !502, line: 1095, type: !631)
!992 = distinct !DILexicalBlock(scope: !993, file: !502, line: 1093, column: 39)
!993 = distinct !DILexicalBlock(scope: !994, file: !502, line: 1093, column: 11)
!994 = distinct !DILexicalBlock(scope: !989, file: !502, line: 1092, column: 8)
!995 = !DILocalVariable(name: "szInitiateLen", scope: !992, file: !502, line: 1096, type: !606)
!996 = !DILocalVariable(name: "abtSelect", scope: !992, file: !502, line: 1097, type: !601)
!997 = !DILocalVariable(name: "abtRx", scope: !992, file: !502, line: 1098, type: !998)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 8, elements: !917)
!999 = !DILocalVariable(name: "abtRead", scope: !1000, file: !502, line: 1134, type: !998)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !502, line: 1131, column: 39)
!1001 = distinct !DILexicalBlock(scope: !994, file: !502, line: 1131, column: 11)
!1002 = !DILocalVariable(name: "abtAttrib", scope: !1003, file: !502, line: 1146, type: !1005)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !502, line: 1144, column: 37)
!1004 = distinct !DILexicalBlock(scope: !994, file: !502, line: 1144, column: 11)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 48, elements: !886)
!1006 = !DILocalVariable(name: "pm", scope: !1007, file: !502, line: 1161, type: !1008)
!1007 = distinct !DILexicalBlock(scope: !990, file: !502, line: 1159, column: 10)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "pn53x_modulation", file: !521, line: 240, baseType: !562)
!1010 = !DIGlobalVariableExpression(var: !1011)
!1011 = distinct !DIGlobalVariable(name: "abtCmd", scope: !1012, file: !502, line: 1797, type: !1022, isLocal: true, isDefinition: true)
!1012 = distinct !DISubprogram(name: "pn53x_ISO14443A_4_is_present", scope: !502, file: !502, line: 1788, type: !749, isLocal: true, isDefinition: true, scopeLine: 1789, flags: DIFlagPrototyped, isOptimized: true, unit: !501, variables: !1013)
!1013 = !{!1014, !1015, !1016, !1020, !1021}
!1014 = !DILocalVariable(name: "pnd", arg: 1, scope: !1012, file: !502, line: 1788, type: !695)
!1015 = !DILocalVariable(name: "ret", scope: !1012, file: !502, line: 1790, type: !145)
!1016 = !DILocalVariable(name: "abtCmd", scope: !1017, file: !502, line: 1805, type: !998)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !502, line: 1801, column: 45)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !502, line: 1801, column: 14)
!1019 = distinct !DILexicalBlock(scope: !1012, file: !502, line: 1792, column: 7)
!1020 = !DILocalVariable(name: "failures", scope: !1017, file: !502, line: 1806, type: !145)
!1021 = !DILocalVariable(name: "ret2", scope: !1017, file: !502, line: 1820, type: !145)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 16, elements: !188)
!1023 = !DIGlobalVariableExpression(var: !1024)
!1024 = distinct !DIGlobalVariable(name: "abtCmd", scope: !1025, file: !502, line: 1764, type: !1022, isLocal: true, isDefinition: true)
!1025 = distinct !DISubprogram(name: "pn53x_Diagnose06", scope: !502, file: !502, line: 1761, type: !749, isLocal: true, isDefinition: true, scopeLine: 1762, flags: DIFlagPrototyped, isOptimized: true, unit: !501, variables: !1026)
!1026 = !{!1027, !1028, !1029, !1030}
!1027 = !DILocalVariable(name: "pnd", arg: 1, scope: !1025, file: !502, line: 1761, type: !695)
!1028 = !DILocalVariable(name: "abtRx", scope: !1025, file: !502, line: 1765, type: !998)
!1029 = !DILocalVariable(name: "ret", scope: !1025, file: !502, line: 1766, type: !145)
!1030 = !DILocalVariable(name: "failures", scope: !1025, file: !502, line: 1767, type: !145)
!1031 = !DIGlobalVariableExpression(var: !1032)
!1032 = distinct !DIGlobalVariable(name: "sErrorMessages", scope: !501, file: !502, line: 2533, type: !1033, isLocal: true, isDefinition: true)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 3584, elements: !1038)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sErrorMessage", file: !502, line: 2530, size: 128, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "iErrorCode", scope: !1034, file: !502, line: 2531, baseType: !145, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "pcErrorMsg", scope: !1034, file: !502, line: 2532, baseType: !83, size: 64, offset: 64)
!1038 = !{!1039}
!1039 = !DISubrange(count: 28)
!1040 = !DIGlobalVariableExpression(var: !1041)
!1041 = distinct !DIGlobalVariable(name: "pn53x_error_frame", scope: !501, file: !502, line: 54, type: !930, isLocal: true, isDefinition: true)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 128, elements: !119)
!1043 = !DIGlobalVariableExpression(var: !1044)
!1044 = distinct !DIGlobalVariable(name: "spi_ports_device_radix", scope: !1045, file: !1046, line: 66, type: !1074, isLocal: false, isDefinition: true)
!1045 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1046, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1047, retainedTypes: !1063, globals: !1073)
!1046 = !DIFile(filename: "spi.c", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/buses")
!1047 = !{!1048}
!1048 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1049, line: 46, size: 32, elements: !1050)
!1049 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/buses")
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062}
!1051 = !DIEnumerator(name: "_ISupper", value: 256)
!1052 = !DIEnumerator(name: "_ISlower", value: 512)
!1053 = !DIEnumerator(name: "_ISalpha", value: 1024)
!1054 = !DIEnumerator(name: "_ISdigit", value: 2048)
!1055 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!1056 = !DIEnumerator(name: "_ISspace", value: 8192)
!1057 = !DIEnumerator(name: "_ISprint", value: 16384)
!1058 = !DIEnumerator(name: "_ISgraph", value: 32768)
!1059 = !DIEnumerator(name: "_ISblank", value: 1)
!1060 = !DIEnumerator(name: "_IScntrl", value: 2)
!1061 = !DIEnumerator(name: "_ISpunct", value: 4)
!1062 = !DIEnumerator(name: "_ISalnum", value: 8)
!1063 = !{!134, !1064, !145, !1068, !1070, !95, !397}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spi_port_unix", file: !1046, line: 72, size: 32, elements: !1066)
!1066 = !{!1067}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1065, file: !1046, line: 73, baseType: !145, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1069, line: 62, baseType: !95)
!1069 = !DIFile(filename: "/home/stly/Documents/llvm/llvm-build/lib/clang/5.0.0/include/stddef.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/buses")
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1072, line: 48, baseType: !9)
!1072 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/buses")
!1073 = !{!1043}
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, elements: !188)
!1075 = !DIGlobalVariableExpression(var: !1076)
!1076 = distinct !DIGlobalVariable(name: "serial_ports_device_radix", scope: !1077, file: !1078, line: 81, type: !1108, isLocal: false, isDefinition: true)
!1077 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1078, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1047, retainedTypes: !1079, globals: !1107)
!1078 = !DIFile(filename: "uart.c", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/buses")
!1079 = !{!134, !1080, !1103, !145, !1104, !1068, !1070, !397}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "serial_port_unix", file: !1078, line: 89, size: 992, elements: !1082)
!1082 = !{!1083, !1084, !1102}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1081, file: !1078, line: 90, baseType: !145, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "termios_backup", scope: !1081, file: !1078, line: 91, baseType: !1085, size: 480, offset: 32)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !1086, line: 28, size: 480, elements: !1087)
!1086 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/termios.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/buses")
!1087 = !{!1088, !1090, !1091, !1092, !1093, !1095, !1099, !1101}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !1085, file: !1086, line: 30, baseType: !1089, size: 32)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !1086, line: 25, baseType: !106)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !1085, file: !1086, line: 31, baseType: !1089, size: 32, offset: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !1085, file: !1086, line: 32, baseType: !1089, size: 32, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !1085, file: !1086, line: 33, baseType: !1089, size: 32, offset: 96)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !1085, file: !1086, line: 34, baseType: !1094, size: 8, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !1086, line: 23, baseType: !9)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !1085, file: !1086, line: 35, baseType: !1096, size: 256, offset: 136)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 256, elements: !1097)
!1097 = !{!1098}
!1098 = !DISubrange(count: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !1085, file: !1086, line: 36, baseType: !1100, size: 32, offset: 416)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !1086, line: 24, baseType: !106)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !1085, file: !1086, line: 37, baseType: !1100, size: 32, offset: 448)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "termios_new", scope: !1081, file: !1078, line: 92, baseType: !1085, size: 480, offset: 512)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !1105, line: 54, baseType: !1106)
!1105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/buses")
!1106 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1107 = !{!1075}
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 384, elements: !886)
!1109 = !DIGlobalVariableExpression(var: !1110)
!1110 = distinct !DIGlobalVariable(name: "i2c_ports_device_radix", scope: !1111, file: !1112, line: 62, type: !1074, isLocal: false, isDefinition: true)
!1111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1112, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !1113, globals: !1122)
!1112 = !DIFile(filename: "i2c.c", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/buses")
!1113 = !{!134, !1114, !1118, !145, !1068, !1070}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_device_unix", file: !1112, line: 69, size: 32, elements: !1116)
!1116 = !{!1117}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1115, file: !1112, line: 70, baseType: !145, size: 32)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !1119, line: 109, baseType: !1120)
!1119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/stly/Documents/ProtocolEx/stubs/libnfc-1.7.1/libnfc/buses")
