; ModuleID = 'lwm2mserver.0.0.preopt.bc'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.command_desc_t = type { i8*, i8*, i8*, void (i8*, i8*)*, i8* }
%struct.coap_packet_t = type { i8*, i8, i32, i8, i16, [5 x i8], i32, i32, i64, i8*, i8, [8 x i8], i64, i8*, %struct._multi_option_t*, i16, i64, i8*, %struct._multi_option_t*, i32, i8, [8 x i8], i8, [2 x i16], i8, [8 x i8], i32, i8, i16, i32, i32, i8, i16, i32, i32, %struct._multi_option_t*, i8, i16, i8* }
%struct._multi_option_t = type { %struct._multi_option_t*, i8, i8, i8* }
%struct.fd_set = type { [16 x i64] }
%struct.timeval = type { i64, i64 }
%struct.lwm2m_context_t = type { %struct._lwm2m_client_*, void (i16, %struct.lwm2m_uri_t*, i32, i32, i8*, i32, i8*)*, i8*, i16, %struct._lwm2m_transaction_*, i8* }
%struct._lwm2m_client_ = type { %struct._lwm2m_client_*, i16, i8*, i32, i8*, i8*, i8, i32, i64, i8*, %struct._lwm2m_client_object_*, %struct._lwm2m_observation_* }
%struct._lwm2m_client_object_ = type { %struct._lwm2m_client_object_*, i16, %struct._lwm2m_list_t* }
%struct._lwm2m_list_t = type { %struct._lwm2m_list_t*, i16 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "g_quit", scope: !2, file: !3, line: 78, type: !58, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !53, globals: !213)
!3 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/examples/server/lwm2mserver.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!4 = !{!5, !15, !32, !41}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 435, size: 32, elements: !7)
!6 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/liblwm2m.h", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!7 = !{!8, !9, !10, !11, !12, !13, !14}
!8 = !DIEnumerator(name: "BINDING_UNKNOWN", value: 0)
!9 = !DIEnumerator(name: "BINDING_U", value: 1)
!10 = !DIEnumerator(name: "BINDING_UQ", value: 2)
!11 = !DIEnumerator(name: "BINDING_S", value: 3)
!12 = !DIEnumerator(name: "BINDING_SQ", value: 4)
!13 = !DIEnumerator(name: "BINDING_US", value: 5)
!14 = !DIEnumerator(name: "BINDING_UQS", value: 6)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 416, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!17 = !DIEnumerator(name: "STATE_DEREGISTERED", value: 0)
!18 = !DIEnumerator(name: "STATE_REG_PENDING", value: 1)
!19 = !DIEnumerator(name: "STATE_REGISTERED", value: 2)
!20 = !DIEnumerator(name: "STATE_REG_FAILED", value: 3)
!21 = !DIEnumerator(name: "STATE_REG_UPDATE_PENDING", value: 4)
!22 = !DIEnumerator(name: "STATE_REG_UPDATE_NEEDED", value: 5)
!23 = !DIEnumerator(name: "STATE_REG_FULL_UPDATE_NEEDED", value: 6)
!24 = !DIEnumerator(name: "STATE_DEREG_PENDING", value: 7)
!25 = !DIEnumerator(name: "STATE_BS_HOLD_OFF", value: 8)
!26 = !DIEnumerator(name: "STATE_BS_INITIATED", value: 9)
!27 = !DIEnumerator(name: "STATE_BS_PENDING", value: 10)
!28 = !DIEnumerator(name: "STATE_BS_FINISHING", value: 11)
!29 = !DIEnumerator(name: "STATE_BS_FINISHED", value: 12)
!30 = !DIEnumerator(name: "STATE_BS_FAILING", value: 13)
!31 = !DIEnumerator(name: "STATE_BS_FAILED", value: 14)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40}
!34 = !DIEnumerator(name: "LWM2M_CONTENT_TEXT", value: 0)
!35 = !DIEnumerator(name: "LWM2M_CONTENT_LINK", value: 40)
!36 = !DIEnumerator(name: "LWM2M_CONTENT_OPAQUE", value: 42)
!37 = !DIEnumerator(name: "LWM2M_CONTENT_TLV_OLD", value: 1542)
!38 = !DIEnumerator(name: "LWM2M_CONTENT_TLV", value: 11542)
!39 = !DIEnumerator(name: "LWM2M_CONTENT_JSON_OLD", value: 1543)
!40 = !DIEnumerator(name: "LWM2M_CONTENT_JSON", value: 11543)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 282, size: 32, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!43 = !DIEnumerator(name: "LWM2M_TYPE_UNDEFINED", value: 0)
!44 = !DIEnumerator(name: "LWM2M_TYPE_OBJECT", value: 1)
!45 = !DIEnumerator(name: "LWM2M_TYPE_OBJECT_INSTANCE", value: 2)
!46 = !DIEnumerator(name: "LWM2M_TYPE_MULTIPLE_RESOURCE", value: 3)
!47 = !DIEnumerator(name: "LWM2M_TYPE_STRING", value: 4)
!48 = !DIEnumerator(name: "LWM2M_TYPE_OPAQUE", value: 5)
!49 = !DIEnumerator(name: "LWM2M_TYPE_INTEGER", value: 6)
!50 = !DIEnumerator(name: "LWM2M_TYPE_FLOAT", value: 7)
!51 = !DIEnumerator(name: "LWM2M_TYPE_BOOLEAN", value: 8)
!52 = !DIEnumerator(name: "LWM2M_TYPE_OBJECT_LINK", value: 9)
!53 = !{!54, !55, !58, !59, !72, !93, !117, !118, !79, !107, !186, !123, !153}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !56, line: 54, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!57 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !61, line: 153, size: 128, elements: !62)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!62 = !{!63, !67}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !60, file: !61, line: 155, baseType: !64, size: 16)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !65, line: 28, baseType: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!66 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !60, file: !61, line: 156, baseType: !68, size: 112, offset: 16)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 112, elements: !70)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!70 = !{!71}
!71 = !DISubrange(count: 14)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !74, line: 239, size: 128, elements: !75)
!74 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!75 = !{!76, !77, !81, !88}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !73, file: !74, line: 241, baseType: !64, size: 16)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !73, file: !74, line: 242, baseType: !78, size: 16, offset: 16)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !74, line: 119, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !80, line: 49, baseType: !66)
!80 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !73, file: !74, line: 243, baseType: !82, size: 32, offset: 32)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !74, line: 31, size: 32, elements: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !82, file: !74, line: 33, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !74, line: 30, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !80, line: 51, baseType: !87)
!87 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !73, file: !74, line: 246, baseType: !89, size: 64, offset: 64)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 64, elements: !91)
!90 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!91 = !{!92}
!92 = !DISubrange(count: 8)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !74, line: 254, size: 224, elements: !95)
!95 = !{!96, !97, !98, !99, !116}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !94, file: !74, line: 256, baseType: !64, size: 16)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !94, file: !74, line: 257, baseType: !78, size: 16, offset: 16)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !94, file: !74, line: 258, baseType: !86, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !94, file: !74, line: 259, baseType: !100, size: 128, offset: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !74, line: 211, size: 128, elements: !101)
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !100, file: !74, line: 220, baseType: !103, size: 128)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !74, line: 213, size: 128, elements: !104)
!104 = !{!105, !110, !112}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !103, file: !74, line: 215, baseType: !106, size: 128)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 128, elements: !108)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !80, line: 48, baseType: !90)
!108 = !{!109}
!109 = !DISubrange(count: 16)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !103, file: !74, line: 217, baseType: !111, size: 128)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 128, elements: !91)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !103, file: !74, line: 218, baseType: !113, size: 128)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 4)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !94, file: !74, line: 260, baseType: !86, size: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_context_t", file: !6, line: 670, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 646, size: 384, elements: !121)
!121 = !{!122, !188, !189, !190, !191, !212}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "clientList", scope: !120, file: !6, line: 659, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_client_t", file: !6, line: 557, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_client_", file: !6, line: 543, size: 704, elements: !126)
!126 = !{!127, !129, !130, !131, !133, !134, !135, !137, !138, !143, !144, !160}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !6, line: 545, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "internalID", scope: !125, file: !6, line: 546, baseType: !79, size: 16, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !6, line: 547, baseType: !117, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "binding", scope: !125, file: !6, line: 548, baseType: !132, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_binding_t", file: !6, line: 444, baseType: !5)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "msisdn", scope: !125, file: !6, line: 549, baseType: !117, size: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "altPath", scope: !125, file: !6, line: 550, baseType: !117, size: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "supportJSON", scope: !125, file: !6, line: 551, baseType: !136, size: 8, offset: 384)
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !125, file: !6, line: 552, baseType: !86, size: 32, offset: 416)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "endOfLife", scope: !125, file: !6, line: 553, baseType: !139, size: 64, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !140, line: 75, baseType: !141)
!140 = !DIFile(filename: "/usr/include/time.h", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !142, line: 139, baseType: !57)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sessionH", scope: !125, file: !6, line: 554, baseType: !54, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "objectList", scope: !125, file: !6, line: 555, baseType: !145, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_client_object_t", file: !6, line: 541, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_client_object_", file: !6, line: 536, size: 192, elements: !148)
!148 = !{!149, !151, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !6, line: 538, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !147, file: !6, line: 539, baseType: !79, size: 16, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "instanceList", scope: !147, file: !6, line: 540, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_list_t", file: !6, line: 216, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_list_t", file: !6, line: 212, size: 128, elements: !156)
!156 = !{!157, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !6, line: 214, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !155, file: !6, line: 215, baseType: !79, size: 16, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "observationList", scope: !125, file: !6, line: 556, baseType: !161, size: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_observation_t", file: !6, line: 502, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_observation_", file: !6, line: 493, size: 448, elements: !164)
!164 = !{!165, !167, !168, !169, !177, !179, !187}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !6, line: 495, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !163, file: !6, line: 496, baseType: !79, size: 16, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "clientP", scope: !163, file: !6, line: 497, baseType: !128, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !163, file: !6, line: 498, baseType: !170, size: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_uri_t", file: !6, line: 259, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 253, size: 64, elements: !172)
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !6, line: 255, baseType: !107, size: 8)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "objectId", scope: !171, file: !6, line: 256, baseType: !79, size: 16, offset: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !171, file: !6, line: 257, baseType: !79, size: 16, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "resourceId", scope: !171, file: !6, line: 258, baseType: !79, size: 16, offset: 48)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !163, file: !6, line: 499, baseType: !178, size: 32, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_status_t", file: !6, line: 433, baseType: !15)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !163, file: !6, line: 500, baseType: !180, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_result_callback_t", file: !6, line: 482, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !79, !184, !58, !185, !186, !58, !54}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_media_type_t", file: !6, line: 336, baseType: !32)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !163, file: !6, line: 501, baseType: !54, size: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "monitorCallback", scope: !120, file: !6, line: 660, baseType: !180, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "monitorUserData", scope: !120, file: !6, line: 661, baseType: !54, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nextMID", scope: !120, file: !6, line: 667, baseType: !79, size: 16, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "transactionList", scope: !120, file: !6, line: 668, baseType: !192, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_transaction_t", file: !6, line: 566, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_transaction_", file: !6, line: 570, size: 768, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !211}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !6, line: 572, baseType: !192, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mID", scope: !194, file: !6, line: 573, baseType: !79, size: 16, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "peerH", scope: !194, file: !6, line: 574, baseType: !54, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ack_received", scope: !194, file: !6, line: 575, baseType: !107, size: 8, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "response_timeout", scope: !194, file: !6, line: 576, baseType: !139, size: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_counter", scope: !194, file: !6, line: 577, baseType: !107, size: 8, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_time", scope: !194, file: !6, line: 578, baseType: !139, size: 64, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !194, file: !6, line: 579, baseType: !54, size: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_len", scope: !194, file: !6, line: 580, baseType: !79, size: 16, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !194, file: !6, line: 581, baseType: !186, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !194, file: !6, line: 582, baseType: !207, size: 64, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_transaction_callback_t", file: !6, line: 568, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !192, !54}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !194, file: !6, line: 583, baseType: !54, size: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !120, file: !6, line: 669, baseType: !54, size: 64, offset: 320)
!213 = !{!0}
!214 = !DIGlobalVariableExpression(var: !215)
!215 = distinct !DIGlobalVariable(name: "b64Alphabet", scope: !216, file: !217, line: 469, type: !256, isLocal: true, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !218, retainedTypes: !252, globals: !255)
!217 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/utils.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!218 = !{!5, !32, !219, !15, !41, !245}
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !220, line: 185, size: 32, elements: !221)
!220 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/er-coap-13/er-coap-13.h", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!222 = !DIEnumerator(name: "TEXT_PLAIN", value: 0)
!223 = !DIEnumerator(name: "TEXT_XML", value: 1)
!224 = !DIEnumerator(name: "TEXT_CSV", value: 2)
!225 = !DIEnumerator(name: "TEXT_HTML", value: 3)
!226 = !DIEnumerator(name: "IMAGE_GIF", value: 21)
!227 = !DIEnumerator(name: "IMAGE_JPEG", value: 22)
!228 = !DIEnumerator(name: "IMAGE_PNG", value: 23)
!229 = !DIEnumerator(name: "IMAGE_TIFF", value: 24)
!230 = !DIEnumerator(name: "AUDIO_RAW", value: 25)
!231 = !DIEnumerator(name: "VIDEO_RAW", value: 26)
!232 = !DIEnumerator(name: "APPLICATION_LINK_FORMAT", value: 40)
!233 = !DIEnumerator(name: "APPLICATION_XML", value: 41)
!234 = !DIEnumerator(name: "APPLICATION_OCTET_STREAM", value: 42)
!235 = !DIEnumerator(name: "APPLICATION_RDF_XML", value: 43)
!236 = !DIEnumerator(name: "APPLICATION_SOAP_XML", value: 44)
!237 = !DIEnumerator(name: "APPLICATION_ATOM_XML", value: 45)
!238 = !DIEnumerator(name: "APPLICATION_XMPP_XML", value: 46)
!239 = !DIEnumerator(name: "APPLICATION_EXI", value: 47)
!240 = !DIEnumerator(name: "APPLICATION_FASTINFOSET", value: 48)
!241 = !DIEnumerator(name: "APPLICATION_SOAP_FASTINFOSET", value: 49)
!242 = !DIEnumerator(name: "APPLICATION_JSON", value: 50)
!243 = !DIEnumerator(name: "APPLICATION_X_OBIX_BINARY", value: 51)
!244 = !DIEnumerator(name: "CONTENT_MAX_VALUE", value: 65535)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !246, line: 225, size: 32, elements: !247)
!246 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/internals.h", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!247 = !{!248, !249, !250, !251}
!248 = !DIEnumerator(name: "URI_DEPTH_OBJECT", value: 0)
!249 = !DIEnumerator(name: "URI_DEPTH_OBJECT_INSTANCE", value: 1)
!250 = !DIEnumerator(name: "URI_DEPTH_RESOURCE", value: 2)
!251 = !DIEnumerator(name: "URI_DEPTH_RESOURCE_INSTANCE", value: 3)
!252 = !{!253, !254, !79, !54, !58, !186}
!253 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !80, line: 40, baseType: !57)
!255 = !{!214}
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 512, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 64)
!259 = !DIGlobalVariableExpression(var: !260)
!260 = distinct !DIGlobalVariable(name: "message", scope: !261, file: !262, line: 206, type: !420, isLocal: true, isDefinition: true)
!261 = distinct !DISubprogram(name: "lwm2m_handle_packet", scope: !262, file: !262, line: 200, type: !263, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: false, unit: !351, variables: !488)
!262 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/packet.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!263 = !DISubroutineType(types: !264)
!264 = !{null, !265, !186, !58, !54}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_context_t", file: !6, line: 670, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 646, size: 384, elements: !268)
!268 = !{!269, !326, !327, !328, !329, !350}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "clientList", scope: !267, file: !6, line: 659, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_client_t", file: !6, line: 557, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_client_", file: !6, line: 543, size: 704, elements: !273)
!273 = !{!274, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !301}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !6, line: 545, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "internalID", scope: !272, file: !6, line: 546, baseType: !79, size: 16, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !272, file: !6, line: 547, baseType: !117, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "binding", scope: !272, file: !6, line: 548, baseType: !132, size: 32, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "msisdn", scope: !272, file: !6, line: 549, baseType: !117, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "altPath", scope: !272, file: !6, line: 550, baseType: !117, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "supportJSON", scope: !272, file: !6, line: 551, baseType: !136, size: 8, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !272, file: !6, line: 552, baseType: !86, size: 32, offset: 416)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "endOfLife", scope: !272, file: !6, line: 553, baseType: !139, size: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sessionH", scope: !272, file: !6, line: 554, baseType: !54, size: 64, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "objectList", scope: !272, file: !6, line: 555, baseType: !286, size: 64, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_client_object_t", file: !6, line: 541, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_client_object_", file: !6, line: 536, size: 192, elements: !289)
!289 = !{!290, !292, !293}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !6, line: 538, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !288, file: !6, line: 539, baseType: !79, size: 16, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "instanceList", scope: !288, file: !6, line: 540, baseType: !294, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_list_t", file: !6, line: 216, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_list_t", file: !6, line: 212, size: 128, elements: !297)
!297 = !{!298, !300}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !6, line: 214, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !296, file: !6, line: 215, baseType: !79, size: 16, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "observationList", scope: !272, file: !6, line: 556, baseType: !302, size: 64, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_observation_t", file: !6, line: 502, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_observation_", file: !6, line: 493, size: 448, elements: !305)
!305 = !{!306, !308, !309, !310, !318, !319, !325}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !6, line: 495, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !304, file: !6, line: 496, baseType: !79, size: 16, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "clientP", scope: !304, file: !6, line: 497, baseType: !275, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !304, file: !6, line: 498, baseType: !311, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_uri_t", file: !6, line: 259, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 253, size: 64, elements: !313)
!313 = !{!314, !315, !316, !317}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !312, file: !6, line: 255, baseType: !107, size: 8)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "objectId", scope: !312, file: !6, line: 256, baseType: !79, size: 16, offset: 16)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !312, file: !6, line: 257, baseType: !79, size: 16, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "resourceId", scope: !312, file: !6, line: 258, baseType: !79, size: 16, offset: 48)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !304, file: !6, line: 499, baseType: !178, size: 32, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !304, file: !6, line: 500, baseType: !320, size: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_result_callback_t", file: !6, line: 482, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !79, !324, !58, !185, !186, !58, !54}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !304, file: !6, line: 501, baseType: !54, size: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "monitorCallback", scope: !267, file: !6, line: 660, baseType: !320, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "monitorUserData", scope: !267, file: !6, line: 661, baseType: !54, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "nextMID", scope: !267, file: !6, line: 667, baseType: !79, size: 16, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "transactionList", scope: !267, file: !6, line: 668, baseType: !330, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_transaction_t", file: !6, line: 566, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_transaction_", file: !6, line: 570, size: 768, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !349}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !6, line: 572, baseType: !330, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mID", scope: !332, file: !6, line: 573, baseType: !79, size: 16, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "peerH", scope: !332, file: !6, line: 574, baseType: !54, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ack_received", scope: !332, file: !6, line: 575, baseType: !107, size: 8, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "response_timeout", scope: !332, file: !6, line: 576, baseType: !139, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_counter", scope: !332, file: !6, line: 577, baseType: !107, size: 8, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_time", scope: !332, file: !6, line: 578, baseType: !139, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !332, file: !6, line: 579, baseType: !54, size: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_len", scope: !332, file: !6, line: 580, baseType: !79, size: 16, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !332, file: !6, line: 581, baseType: !186, size: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !332, file: !6, line: 582, baseType: !345, size: 64, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_transaction_callback_t", file: !6, line: 568, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !330, !54}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !332, file: !6, line: 583, baseType: !54, size: 64, offset: 704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !267, file: !6, line: 669, baseType: !54, size: 64, offset: 320)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !416, globals: !417)
!352 = !{!5, !15, !32, !353, !380, !219, !386, !392, !413}
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !220, line: 125, size: 32, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!355 = !DIEnumerator(name: "NO_ERROR", value: 0)
!356 = !DIEnumerator(name: "CREATED_2_01", value: 65)
!357 = !DIEnumerator(name: "DELETED_2_02", value: 66)
!358 = !DIEnumerator(name: "VALID_2_03", value: 67)
!359 = !DIEnumerator(name: "CHANGED_2_04", value: 68)
!360 = !DIEnumerator(name: "CONTENT_2_05", value: 69)
!361 = !DIEnumerator(name: "BAD_REQUEST_4_00", value: 128)
!362 = !DIEnumerator(name: "UNAUTHORIZED_4_01", value: 129)
!363 = !DIEnumerator(name: "BAD_OPTION_4_02", value: 130)
!364 = !DIEnumerator(name: "FORBIDDEN_4_03", value: 131)
!365 = !DIEnumerator(name: "NOT_FOUND_4_04", value: 132)
!366 = !DIEnumerator(name: "METHOD_NOT_ALLOWED_4_05", value: 133)
!367 = !DIEnumerator(name: "NOT_ACCEPTABLE_4_06", value: 134)
!368 = !DIEnumerator(name: "PRECONDITION_FAILED_4_12", value: 140)
!369 = !DIEnumerator(name: "REQUEST_ENTITY_TOO_LARGE_4_13", value: 141)
!370 = !DIEnumerator(name: "UNSUPPORTED_MEDIA_TYPE_4_15", value: 143)
!371 = !DIEnumerator(name: "INTERNAL_SERVER_ERROR_5_00", value: 160)
!372 = !DIEnumerator(name: "NOT_IMPLEMENTED_5_01", value: 161)
!373 = !DIEnumerator(name: "BAD_GATEWAY_5_02", value: 162)
!374 = !DIEnumerator(name: "SERVICE_UNAVAILABLE_5_03", value: 163)
!375 = !DIEnumerator(name: "GATEWAY_TIMEOUT_5_04", value: 164)
!376 = !DIEnumerator(name: "PROXYING_NOT_SUPPORTED_5_05", value: 165)
!377 = !DIEnumerator(name: "MEMORY_ALLOCATION_ERROR", value: 192)
!378 = !DIEnumerator(name: "PACKET_SERIALIZATION_ERROR", value: 193)
!379 = !DIEnumerator(name: "MANUAL_RESPONSE", value: 194)
!380 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !220, line: 109, size: 32, elements: !381)
!381 = !{!382, !383, !384, !385}
!382 = !DIEnumerator(name: "COAP_TYPE_CON", value: 0)
!383 = !DIEnumerator(name: "COAP_TYPE_NON", value: 1)
!384 = !DIEnumerator(name: "COAP_TYPE_ACK", value: 2)
!385 = !DIEnumerator(name: "COAP_TYPE_RST", value: 3)
!386 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !220, line: 117, size: 32, elements: !387)
!387 = !{!388, !389, !390, !391}
!388 = !DIEnumerator(name: "COAP_GET", value: 1)
!389 = !DIEnumerator(name: "COAP_POST", value: 2)
!390 = !DIEnumerator(name: "COAP_PUT", value: 3)
!391 = !DIEnumerator(name: "COAP_DELETE", value: 4)
!392 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !220, line: 162, size: 32, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!394 = !DIEnumerator(name: "COAP_OPTION_IF_MATCH", value: 1)
!395 = !DIEnumerator(name: "COAP_OPTION_URI_HOST", value: 3)
!396 = !DIEnumerator(name: "COAP_OPTION_ETAG", value: 4)
!397 = !DIEnumerator(name: "COAP_OPTION_IF_NONE_MATCH", value: 5)
!398 = !DIEnumerator(name: "COAP_OPTION_OBSERVE", value: 6)
!399 = !DIEnumerator(name: "COAP_OPTION_URI_PORT", value: 7)
!400 = !DIEnumerator(name: "COAP_OPTION_LOCATION_PATH", value: 8)
!401 = !DIEnumerator(name: "COAP_OPTION_URI_PATH", value: 11)
!402 = !DIEnumerator(name: "COAP_OPTION_CONTENT_TYPE", value: 12)
!403 = !DIEnumerator(name: "COAP_OPTION_MAX_AGE", value: 14)
!404 = !DIEnumerator(name: "COAP_OPTION_URI_QUERY", value: 15)
!405 = !DIEnumerator(name: "COAP_OPTION_ACCEPT", value: 17)
!406 = !DIEnumerator(name: "COAP_OPTION_TOKEN", value: 19)
!407 = !DIEnumerator(name: "COAP_OPTION_LOCATION_QUERY", value: 20)
!408 = !DIEnumerator(name: "COAP_OPTION_BLOCK2", value: 23)
!409 = !DIEnumerator(name: "COAP_OPTION_BLOCK1", value: 27)
!410 = !DIEnumerator(name: "COAP_OPTION_SIZE", value: 28)
!411 = !DIEnumerator(name: "COAP_OPTION_PROXY_URI", value: 35)
!412 = !DIEnumerator(name: "OPTION_MAX_VALUE", value: 65535)
!413 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !220, line: 100, size: 32, elements: !414)
!414 = !{!415}
!415 = !DIEnumerator(name: "OPTION_MAP_SIZE", value: 8)
!416 = !{!79, !107, !186, !54}
!417 = !{!259, !418}
!418 = !DIGlobalVariableExpression(var: !419)
!419 = distinct !DIGlobalVariable(name: "response", scope: !261, file: !262, line: 207, type: !420, isLocal: true, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 1664, elements: !486)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "coap_packet_t", file: !220, line: 264, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !220, line: 219, size: 1664, elements: !423)
!423 = !{!424, !425, !426, !428, !429, !430, !434, !436, !437, !441, !444, !445, !447, !448, !449, !459, !460, !461, !462, !463, !464, !465, !466, !467, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !422, file: !220, line: 220, baseType: !186, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !422, file: !220, line: 222, baseType: !107, size: 8, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !422, file: !220, line: 223, baseType: !427, size: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "coap_message_type_t", file: !220, line: 114, baseType: !380)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !422, file: !220, line: 224, baseType: !107, size: 8, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !422, file: !220, line: 225, baseType: !79, size: 16, offset: 144)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !422, file: !220, line: 227, baseType: !431, size: 40, offset: 160)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 40, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 5)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !422, file: !220, line: 229, baseType: !435, size: 32, offset: 224)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "coap_content_type_t", file: !220, line: 209, baseType: !219)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "max_age", scope: !422, file: !220, line: 230, baseType: !86, size: 32, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_uri_len", scope: !422, file: !220, line: 231, baseType: !438, size: 64, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !439, line: 62, baseType: !440)
!439 = !DIFile(filename: "/home/stly/Documents/binutils-gdb/build/installed/lib/clang/5.0.0/include/stddef.h", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!440 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_uri", scope: !422, file: !220, line: 232, baseType: !442, size: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "etag_len", scope: !422, file: !220, line: 233, baseType: !107, size: 8, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !422, file: !220, line: 234, baseType: !446, size: 64, offset: 456)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 64, elements: !91)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "uri_host_len", scope: !422, file: !220, line: 235, baseType: !438, size: 64, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "uri_host", scope: !422, file: !220, line: 236, baseType: !442, size: 64, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "location_path", scope: !422, file: !220, line: 237, baseType: !450, size: 64, offset: 704)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "multi_option_t", file: !220, line: 216, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_multi_option_t", file: !220, line: 211, size: 192, elements: !453)
!453 = !{!454, !456, !457, !458}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !452, file: !220, line: 212, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "is_static", scope: !452, file: !220, line: 213, baseType: !107, size: 8, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !452, file: !220, line: 214, baseType: !107, size: 8, offset: 72)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !452, file: !220, line: 215, baseType: !186, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "uri_port", scope: !422, file: !220, line: 238, baseType: !79, size: 16, offset: 768)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "location_query_len", scope: !422, file: !220, line: 239, baseType: !438, size: 64, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "location_query", scope: !422, file: !220, line: 240, baseType: !186, size: 64, offset: 896)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "uri_path", scope: !422, file: !220, line: 241, baseType: !450, size: 64, offset: 960)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "observe", scope: !422, file: !220, line: 242, baseType: !86, size: 32, offset: 1024)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "token_len", scope: !422, file: !220, line: 243, baseType: !107, size: 8, offset: 1056)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !422, file: !220, line: 244, baseType: !446, size: 64, offset: 1064)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "accept_num", scope: !422, file: !220, line: 245, baseType: !107, size: 8, offset: 1128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !422, file: !220, line: 246, baseType: !468, size: 32, offset: 1136)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 32, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 2)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "if_match_len", scope: !422, file: !220, line: 247, baseType: !107, size: 8, offset: 1168)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "if_match", scope: !422, file: !220, line: 248, baseType: !446, size: 64, offset: 1176)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "block2_num", scope: !422, file: !220, line: 249, baseType: !86, size: 32, offset: 1248)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "block2_more", scope: !422, file: !220, line: 250, baseType: !107, size: 8, offset: 1280)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "block2_size", scope: !422, file: !220, line: 251, baseType: !79, size: 16, offset: 1296)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "block2_offset", scope: !422, file: !220, line: 252, baseType: !86, size: 32, offset: 1312)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "block1_num", scope: !422, file: !220, line: 253, baseType: !86, size: 32, offset: 1344)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "block1_more", scope: !422, file: !220, line: 254, baseType: !107, size: 8, offset: 1376)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "block1_size", scope: !422, file: !220, line: 255, baseType: !79, size: 16, offset: 1392)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "block1_offset", scope: !422, file: !220, line: 256, baseType: !86, size: 32, offset: 1408)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !422, file: !220, line: 257, baseType: !86, size: 32, offset: 1440)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "uri_query", scope: !422, file: !220, line: 258, baseType: !450, size: 64, offset: 1472)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "if_none_match", scope: !422, file: !220, line: 259, baseType: !107, size: 8, offset: 1536)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !422, file: !220, line: 261, baseType: !79, size: 16, offset: 1552)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !422, file: !220, line: 262, baseType: !186, size: 64, offset: 1600)
!486 = !{!487}
!487 = !DISubrange(count: 1)
!488 = !{}
!489 = !DIGlobalVariableExpression(var: !490)
!490 = distinct !DIGlobalVariable(name: "current_mid", scope: !491, file: !492, line: 66, type: !79, isLocal: true, isDefinition: true)
!491 = distinct !DICompileUnit(language: DW_LANG_C99, file: !492, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !493, retainedTypes: !494, globals: !550)
!492 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/er-coap-13/er-coap-13.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!493 = !{!353, !380, !219, !392, !413}
!494 = !{!495, !107, !186, !54, !504, !547, !435, !548, !117, !79, !442}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "multi_option_t", file: !220, line: 216, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_multi_option_t", file: !220, line: 211, size: 192, elements: !498)
!498 = !{!499, !501, !502, !503}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !220, line: 212, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "is_static", scope: !497, file: !220, line: 213, baseType: !107, size: 8, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !497, file: !220, line: 214, baseType: !107, size: 8, offset: 72)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !497, file: !220, line: 215, baseType: !186, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "coap_packet_t", file: !220, line: 264, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !220, line: 219, size: 1664, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !506, file: !220, line: 220, baseType: !186, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !506, file: !220, line: 222, baseType: !107, size: 8, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !506, file: !220, line: 223, baseType: !427, size: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !506, file: !220, line: 224, baseType: !107, size: 8, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !506, file: !220, line: 225, baseType: !79, size: 16, offset: 144)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !506, file: !220, line: 227, baseType: !431, size: 40, offset: 160)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !506, file: !220, line: 229, baseType: !435, size: 32, offset: 224)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "max_age", scope: !506, file: !220, line: 230, baseType: !86, size: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_uri_len", scope: !506, file: !220, line: 231, baseType: !438, size: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_uri", scope: !506, file: !220, line: 232, baseType: !442, size: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "etag_len", scope: !506, file: !220, line: 233, baseType: !107, size: 8, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !506, file: !220, line: 234, baseType: !446, size: 64, offset: 456)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "uri_host_len", scope: !506, file: !220, line: 235, baseType: !438, size: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "uri_host", scope: !506, file: !220, line: 236, baseType: !442, size: 64, offset: 640)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "location_path", scope: !506, file: !220, line: 237, baseType: !495, size: 64, offset: 704)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "uri_port", scope: !506, file: !220, line: 238, baseType: !79, size: 16, offset: 768)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "location_query_len", scope: !506, file: !220, line: 239, baseType: !438, size: 64, offset: 832)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "location_query", scope: !506, file: !220, line: 240, baseType: !186, size: 64, offset: 896)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "uri_path", scope: !506, file: !220, line: 241, baseType: !495, size: 64, offset: 960)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "observe", scope: !506, file: !220, line: 242, baseType: !86, size: 32, offset: 1024)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "token_len", scope: !506, file: !220, line: 243, baseType: !107, size: 8, offset: 1056)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !506, file: !220, line: 244, baseType: !446, size: 64, offset: 1064)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "accept_num", scope: !506, file: !220, line: 245, baseType: !107, size: 8, offset: 1128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !506, file: !220, line: 246, baseType: !468, size: 32, offset: 1136)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "if_match_len", scope: !506, file: !220, line: 247, baseType: !107, size: 8, offset: 1168)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "if_match", scope: !506, file: !220, line: 248, baseType: !446, size: 64, offset: 1176)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "block2_num", scope: !506, file: !220, line: 249, baseType: !86, size: 32, offset: 1248)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "block2_more", scope: !506, file: !220, line: 250, baseType: !107, size: 8, offset: 1280)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "block2_size", scope: !506, file: !220, line: 251, baseType: !79, size: 16, offset: 1296)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "block2_offset", scope: !506, file: !220, line: 252, baseType: !86, size: 32, offset: 1312)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "block1_num", scope: !506, file: !220, line: 253, baseType: !86, size: 32, offset: 1344)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "block1_more", scope: !506, file: !220, line: 254, baseType: !107, size: 8, offset: 1376)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "block1_size", scope: !506, file: !220, line: 255, baseType: !79, size: 16, offset: 1392)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "block1_offset", scope: !506, file: !220, line: 256, baseType: !86, size: 32, offset: 1408)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !506, file: !220, line: 257, baseType: !86, size: 32, offset: 1440)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "uri_query", scope: !506, file: !220, line: 258, baseType: !495, size: 64, offset: 1472)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "if_none_match", scope: !506, file: !220, line: 259, baseType: !107, size: 8, offset: 1536)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !506, file: !220, line: 261, baseType: !79, size: 16, offset: 1552)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !506, file: !220, line: 262, baseType: !186, size: 64, offset: 1600)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!550 = !{!551, !554, !489}
!551 = !DIGlobalVariableExpression(var: !552)
!552 = distinct !DIGlobalVariable(name: "coap_error_code", scope: !491, file: !492, line: 68, type: !553, isLocal: false, isDefinition: true)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "coap_status_t", file: !220, line: 159, baseType: !353)
!554 = !DIGlobalVariableExpression(var: !555)
!555 = distinct !DIGlobalVariable(name: "coap_error_message", scope: !491, file: !492, line: 69, type: !548, isLocal: false, isDefinition: true)
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !558, retainedTypes: !559)
!557 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/liblwm2m.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!558 = !{!5, !15, !32}
!559 = !{!560, !54, !58, !107}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_context_t", file: !6, line: 670, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 646, size: 384, elements: !563)
!563 = !{!564, !621, !622, !623, !624, !645}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "clientList", scope: !562, file: !6, line: 659, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_client_t", file: !6, line: 557, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_client_", file: !6, line: 543, size: 704, elements: !568)
!568 = !{!569, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !596}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !567, file: !6, line: 545, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "internalID", scope: !567, file: !6, line: 546, baseType: !79, size: 16, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !567, file: !6, line: 547, baseType: !117, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "binding", scope: !567, file: !6, line: 548, baseType: !132, size: 32, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "msisdn", scope: !567, file: !6, line: 549, baseType: !117, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "altPath", scope: !567, file: !6, line: 550, baseType: !117, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "supportJSON", scope: !567, file: !6, line: 551, baseType: !136, size: 8, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !567, file: !6, line: 552, baseType: !86, size: 32, offset: 416)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "endOfLife", scope: !567, file: !6, line: 553, baseType: !139, size: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sessionH", scope: !567, file: !6, line: 554, baseType: !54, size: 64, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "objectList", scope: !567, file: !6, line: 555, baseType: !581, size: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_client_object_t", file: !6, line: 541, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_client_object_", file: !6, line: 536, size: 192, elements: !584)
!584 = !{!585, !587, !588}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !583, file: !6, line: 538, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !583, file: !6, line: 539, baseType: !79, size: 16, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "instanceList", scope: !583, file: !6, line: 540, baseType: !589, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_list_t", file: !6, line: 216, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_list_t", file: !6, line: 212, size: 128, elements: !592)
!592 = !{!593, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !591, file: !6, line: 214, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !591, file: !6, line: 215, baseType: !79, size: 16, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "observationList", scope: !567, file: !6, line: 556, baseType: !597, size: 64, offset: 640)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_observation_t", file: !6, line: 502, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_observation_", file: !6, line: 493, size: 448, elements: !600)
!600 = !{!601, !603, !604, !605, !613, !614, !620}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !599, file: !6, line: 495, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !599, file: !6, line: 496, baseType: !79, size: 16, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "clientP", scope: !599, file: !6, line: 497, baseType: !570, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !599, file: !6, line: 498, baseType: !606, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_uri_t", file: !6, line: 259, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 253, size: 64, elements: !608)
!608 = !{!609, !610, !611, !612}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !607, file: !6, line: 255, baseType: !107, size: 8)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "objectId", scope: !607, file: !6, line: 256, baseType: !79, size: 16, offset: 16)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !607, file: !6, line: 257, baseType: !79, size: 16, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "resourceId", scope: !607, file: !6, line: 258, baseType: !79, size: 16, offset: 48)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !599, file: !6, line: 499, baseType: !178, size: 32, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !599, file: !6, line: 500, baseType: !615, size: 64, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_result_callback_t", file: !6, line: 482, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !79, !619, !58, !185, !186, !58, !54}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !599, file: !6, line: 501, baseType: !54, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "monitorCallback", scope: !562, file: !6, line: 660, baseType: !615, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "monitorUserData", scope: !562, file: !6, line: 661, baseType: !54, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nextMID", scope: !562, file: !6, line: 667, baseType: !79, size: 16, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "transactionList", scope: !562, file: !6, line: 668, baseType: !625, size: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_transaction_t", file: !6, line: 566, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_transaction_", file: !6, line: 570, size: 768, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !644}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !627, file: !6, line: 572, baseType: !625, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mID", scope: !627, file: !6, line: 573, baseType: !79, size: 16, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "peerH", scope: !627, file: !6, line: 574, baseType: !54, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ack_received", scope: !627, file: !6, line: 575, baseType: !107, size: 8, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "response_timeout", scope: !627, file: !6, line: 576, baseType: !139, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_counter", scope: !627, file: !6, line: 577, baseType: !107, size: 8, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_time", scope: !627, file: !6, line: 578, baseType: !139, size: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !627, file: !6, line: 579, baseType: !54, size: 64, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_len", scope: !627, file: !6, line: 580, baseType: !79, size: 16, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !627, file: !6, line: 581, baseType: !186, size: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !627, file: !6, line: 582, baseType: !640, size: 64, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_transaction_callback_t", file: !6, line: 568, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !625, !54}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !627, file: !6, line: 583, baseType: !54, size: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !562, file: !6, line: 669, baseType: !54, size: 64, offset: 320)
!646 = distinct !DICompileUnit(language: DW_LANG_C99, file: !647, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !648, retainedTypes: !664)
!647 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/uri.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!648 = !{!649, !245}
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !650, line: 46, size: 32, elements: !651)
!650 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!652 = !DIEnumerator(name: "_ISupper", value: 256)
!653 = !DIEnumerator(name: "_ISlower", value: 512)
!654 = !DIEnumerator(name: "_ISalpha", value: 1024)
!655 = !DIEnumerator(name: "_ISdigit", value: 2048)
!656 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!657 = !DIEnumerator(name: "_ISspace", value: 8192)
!658 = !DIEnumerator(name: "_ISprint", value: 16384)
!659 = !DIEnumerator(name: "_ISgraph", value: 32768)
!660 = !DIEnumerator(name: "_ISblank", value: 1)
!661 = !DIEnumerator(name: "_IScntrl", value: 2)
!662 = !DIEnumerator(name: "_ISpunct", value: 4)
!663 = !DIEnumerator(name: "_ISalnum", value: 8)
!664 = !{!665, !54, !117, !107, !79, !58, !66, !186}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_uri_t", file: !6, line: 259, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 253, size: 64, elements: !668)
!668 = !{!669, !670, !671, !672}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !667, file: !6, line: 255, baseType: !107, size: 8)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "objectId", scope: !667, file: !6, line: 256, baseType: !79, size: 16, offset: 16)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !667, file: !6, line: 257, baseType: !79, size: 16, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "resourceId", scope: !667, file: !6, line: 258, baseType: !79, size: 16, offset: 48)
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !488)
!674 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/objects.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !677, retainedTypes: !678)
!676 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/tlv.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!677 = !{!41}
!678 = !{!186, !54, !438, !107, !253, !679}
!679 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!680 = distinct !DICompileUnit(language: DW_LANG_C99, file: !681, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !682, retainedTypes: !683)
!681 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/data.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!682 = !{!41, !32}
!683 = !{!684, !54, !186, !712, !253, !107, !58}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_data_t", file: !6, line: 298, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_data_t", file: !6, line: 300, size: 192, elements: !687)
!687 = !{!688, !690, !691}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !686, file: !6, line: 302, baseType: !689, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_data_type_t", file: !6, line: 296, baseType: !41)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !686, file: !6, line: 303, baseType: !79, size: 16, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !686, file: !6, line: 324, baseType: !692, size: 128, offset: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !686, file: !6, line: 304, size: 128, elements: !693)
!693 = !{!694, !695, !696, !697, !702, !707}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "asBoolean", scope: !692, file: !6, line: 306, baseType: !136, size: 8)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "asInteger", scope: !692, file: !6, line: 307, baseType: !254, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "asFloat", scope: !692, file: !6, line: 308, baseType: !253, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "asBuffer", scope: !692, file: !6, line: 313, baseType: !698, size: 128)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !692, file: !6, line: 309, size: 128, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !698, file: !6, line: 311, baseType: !438, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !698, file: !6, line: 312, baseType: !186, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "asChildren", scope: !692, file: !6, line: 318, baseType: !703, size: 128)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !692, file: !6, line: 314, size: 128, elements: !704)
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !703, file: !6, line: 316, baseType: !438, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !703, file: !6, line: 317, baseType: !684, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "asObjLink", scope: !692, file: !6, line: 323, baseType: !708, size: 32)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !692, file: !6, line: 319, size: 32, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "objectId", scope: !708, file: !6, line: 321, baseType: !79, size: 16)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "objectInstanceId", scope: !708, file: !6, line: 322, baseType: !79, size: 16, offset: 16)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !80, line: 36, baseType: !713)
!713 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!714 = distinct !DICompileUnit(language: DW_LANG_C99, file: !715, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !488, retainedTypes: !716)
!715 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/list.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!716 = !{!54}
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !719, retainedTypes: !720)
!718 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/transaction.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!719 = !{!386, !380, !5, !15, !32, !219, !392, !413}
!720 = !{!54, !721, !186, !107, !741, !748}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_transaction_t", file: !6, line: 566, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_transaction_", file: !6, line: 570, size: 768, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !740}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !723, file: !6, line: 572, baseType: !721, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mID", scope: !723, file: !6, line: 573, baseType: !79, size: 16, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "peerH", scope: !723, file: !6, line: 574, baseType: !54, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ack_received", scope: !723, file: !6, line: 575, baseType: !107, size: 8, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "response_timeout", scope: !723, file: !6, line: 576, baseType: !139, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_counter", scope: !723, file: !6, line: 577, baseType: !107, size: 8, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_time", scope: !723, file: !6, line: 578, baseType: !139, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !723, file: !6, line: 579, baseType: !54, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_len", scope: !723, file: !6, line: 580, baseType: !79, size: 16, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !723, file: !6, line: 581, baseType: !186, size: 64, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !723, file: !6, line: 582, baseType: !736, size: 64, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_transaction_callback_t", file: !6, line: 568, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !721, !54}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !723, file: !6, line: 583, baseType: !54, size: 64, offset: 704)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_list_t", file: !6, line: 216, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_list_t", file: !6, line: 212, size: 128, elements: !744)
!744 = !{!745, !747}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !743, file: !6, line: 214, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !743, file: !6, line: 215, baseType: !79, size: 16, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !751, retainedTypes: !752)
!750 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/registration.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!751 = !{!5, !15, !32, !380, !219}
!752 = !{!54, !107, !435, !753, !777, !769, !809, !117, !79, !186}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_client_t", file: !6, line: 557, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_client_", file: !6, line: 543, size: 704, elements: !756)
!756 = !{!757, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !784}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !755, file: !6, line: 545, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "internalID", scope: !755, file: !6, line: 546, baseType: !79, size: 16, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !755, file: !6, line: 547, baseType: !117, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "binding", scope: !755, file: !6, line: 548, baseType: !132, size: 32, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "msisdn", scope: !755, file: !6, line: 549, baseType: !117, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "altPath", scope: !755, file: !6, line: 550, baseType: !117, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "supportJSON", scope: !755, file: !6, line: 551, baseType: !136, size: 8, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !755, file: !6, line: 552, baseType: !86, size: 32, offset: 416)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "endOfLife", scope: !755, file: !6, line: 553, baseType: !139, size: 64, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sessionH", scope: !755, file: !6, line: 554, baseType: !54, size: 64, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "objectList", scope: !755, file: !6, line: 555, baseType: !769, size: 64, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_client_object_t", file: !6, line: 541, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_client_object_", file: !6, line: 536, size: 192, elements: !772)
!772 = !{!773, !775, !776}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !771, file: !6, line: 538, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !771, file: !6, line: 539, baseType: !79, size: 16, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "instanceList", scope: !771, file: !6, line: 540, baseType: !777, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_list_t", file: !6, line: 216, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_list_t", file: !6, line: 212, size: 128, elements: !780)
!780 = !{!781, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !779, file: !6, line: 214, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !779, file: !6, line: 215, baseType: !79, size: 16, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "observationList", scope: !755, file: !6, line: 556, baseType: !785, size: 64, offset: 640)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_observation_t", file: !6, line: 502, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_observation_", file: !6, line: 493, size: 448, elements: !788)
!788 = !{!789, !791, !792, !793, !801, !802, !808}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !787, file: !6, line: 495, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !787, file: !6, line: 496, baseType: !79, size: 16, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "clientP", scope: !787, file: !6, line: 497, baseType: !758, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !787, file: !6, line: 498, baseType: !794, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_uri_t", file: !6, line: 259, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 253, size: 64, elements: !796)
!796 = !{!797, !798, !799, !800}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !795, file: !6, line: 255, baseType: !107, size: 8)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "objectId", scope: !795, file: !6, line: 256, baseType: !79, size: 16, offset: 16)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !795, file: !6, line: 257, baseType: !79, size: 16, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "resourceId", scope: !795, file: !6, line: 258, baseType: !79, size: 16, offset: 48)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !787, file: !6, line: 499, baseType: !178, size: 32, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !787, file: !6, line: 500, baseType: !803, size: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_result_callback_t", file: !6, line: 482, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !79, !807, !58, !185, !186, !58, !54}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !787, file: !6, line: 501, baseType: !54, size: 64, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!810 = distinct !DICompileUnit(language: DW_LANG_C99, file: !811, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !488)
!811 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/bootstrap.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!812 = distinct !DICompileUnit(language: DW_LANG_C99, file: !813, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !814, retainedTypes: !815)
!813 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/management.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!814 = !{!5, !15, !32, !386, !380, !219, !392, !413}
!815 = !{!816, !840, !54, !107, !872, !880, !186, !932}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_client_t", file: !6, line: 557, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_client_", file: !6, line: 543, size: 704, elements: !819)
!819 = !{!820, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !847}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !818, file: !6, line: 545, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "internalID", scope: !818, file: !6, line: 546, baseType: !79, size: 16, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !818, file: !6, line: 547, baseType: !117, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "binding", scope: !818, file: !6, line: 548, baseType: !132, size: 32, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "msisdn", scope: !818, file: !6, line: 549, baseType: !117, size: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "altPath", scope: !818, file: !6, line: 550, baseType: !117, size: 64, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "supportJSON", scope: !818, file: !6, line: 551, baseType: !136, size: 8, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !818, file: !6, line: 552, baseType: !86, size: 32, offset: 416)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "endOfLife", scope: !818, file: !6, line: 553, baseType: !139, size: 64, offset: 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sessionH", scope: !818, file: !6, line: 554, baseType: !54, size: 64, offset: 512)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "objectList", scope: !818, file: !6, line: 555, baseType: !832, size: 64, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_client_object_t", file: !6, line: 541, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_client_object_", file: !6, line: 536, size: 192, elements: !835)
!835 = !{!836, !838, !839}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !834, file: !6, line: 538, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !834, file: !6, line: 539, baseType: !79, size: 16, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "instanceList", scope: !834, file: !6, line: 540, baseType: !840, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_list_t", file: !6, line: 216, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_list_t", file: !6, line: 212, size: 128, elements: !843)
!843 = !{!844, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !842, file: !6, line: 214, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !842, file: !6, line: 215, baseType: !79, size: 16, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "observationList", scope: !818, file: !6, line: 556, baseType: !848, size: 64, offset: 640)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_observation_t", file: !6, line: 502, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_observation_", file: !6, line: 493, size: 448, elements: !851)
!851 = !{!852, !854, !855, !856, !864, !865, !871}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !850, file: !6, line: 495, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !850, file: !6, line: 496, baseType: !79, size: 16, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "clientP", scope: !850, file: !6, line: 497, baseType: !821, size: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !850, file: !6, line: 498, baseType: !857, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_uri_t", file: !6, line: 259, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 253, size: 64, elements: !859)
!859 = !{!860, !861, !862, !863}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !858, file: !6, line: 255, baseType: !107, size: 8)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "objectId", scope: !858, file: !6, line: 256, baseType: !79, size: 16, offset: 16)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !858, file: !6, line: 257, baseType: !79, size: 16, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "resourceId", scope: !858, file: !6, line: 258, baseType: !79, size: 16, offset: 48)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !850, file: !6, line: 499, baseType: !178, size: 32, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !850, file: !6, line: 500, baseType: !866, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_result_callback_t", file: !6, line: 482, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !79, !870, !58, !185, !186, !58, !54}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !850, file: !6, line: 501, baseType: !54, size: 64, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "dm_data_t", file: !246, line: 223, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 217, size: 256, elements: !875)
!875 = !{!876, !877, !878, !879}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "clientID", scope: !874, file: !246, line: 219, baseType: !79, size: 16)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !874, file: !246, line: 220, baseType: !857, size: 64, offset: 16)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !874, file: !246, line: 221, baseType: !866, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !874, file: !246, line: 222, baseType: !54, size: 64, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "coap_packet_t", file: !220, line: 264, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !220, line: 219, size: 1664, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !882, file: !220, line: 220, baseType: !186, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !882, file: !220, line: 222, baseType: !107, size: 8, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !882, file: !220, line: 223, baseType: !427, size: 32, offset: 96)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !882, file: !220, line: 224, baseType: !107, size: 8, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !882, file: !220, line: 225, baseType: !79, size: 16, offset: 144)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !882, file: !220, line: 227, baseType: !431, size: 40, offset: 160)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !882, file: !220, line: 229, baseType: !435, size: 32, offset: 224)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "max_age", scope: !882, file: !220, line: 230, baseType: !86, size: 32, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_uri_len", scope: !882, file: !220, line: 231, baseType: !438, size: 64, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_uri", scope: !882, file: !220, line: 232, baseType: !442, size: 64, offset: 384)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "etag_len", scope: !882, file: !220, line: 233, baseType: !107, size: 8, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !882, file: !220, line: 234, baseType: !446, size: 64, offset: 456)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "uri_host_len", scope: !882, file: !220, line: 235, baseType: !438, size: 64, offset: 576)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "uri_host", scope: !882, file: !220, line: 236, baseType: !442, size: 64, offset: 640)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "location_path", scope: !882, file: !220, line: 237, baseType: !899, size: 64, offset: 704)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "multi_option_t", file: !220, line: 216, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_multi_option_t", file: !220, line: 211, size: 192, elements: !902)
!902 = !{!903, !905, !906, !907}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !901, file: !220, line: 212, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "is_static", scope: !901, file: !220, line: 213, baseType: !107, size: 8, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !901, file: !220, line: 214, baseType: !107, size: 8, offset: 72)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !901, file: !220, line: 215, baseType: !186, size: 64, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "uri_port", scope: !882, file: !220, line: 238, baseType: !79, size: 16, offset: 768)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "location_query_len", scope: !882, file: !220, line: 239, baseType: !438, size: 64, offset: 832)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "location_query", scope: !882, file: !220, line: 240, baseType: !186, size: 64, offset: 896)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "uri_path", scope: !882, file: !220, line: 241, baseType: !899, size: 64, offset: 960)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "observe", scope: !882, file: !220, line: 242, baseType: !86, size: 32, offset: 1024)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "token_len", scope: !882, file: !220, line: 243, baseType: !107, size: 8, offset: 1056)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !882, file: !220, line: 244, baseType: !446, size: 64, offset: 1064)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "accept_num", scope: !882, file: !220, line: 245, baseType: !107, size: 8, offset: 1128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !882, file: !220, line: 246, baseType: !468, size: 32, offset: 1136)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "if_match_len", scope: !882, file: !220, line: 247, baseType: !107, size: 8, offset: 1168)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "if_match", scope: !882, file: !220, line: 248, baseType: !446, size: 64, offset: 1176)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "block2_num", scope: !882, file: !220, line: 249, baseType: !86, size: 32, offset: 1248)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "block2_more", scope: !882, file: !220, line: 250, baseType: !107, size: 8, offset: 1280)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "block2_size", scope: !882, file: !220, line: 251, baseType: !79, size: 16, offset: 1296)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "block2_offset", scope: !882, file: !220, line: 252, baseType: !86, size: 32, offset: 1312)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "block1_num", scope: !882, file: !220, line: 253, baseType: !86, size: 32, offset: 1344)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "block1_more", scope: !882, file: !220, line: 254, baseType: !107, size: 8, offset: 1376)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "block1_size", scope: !882, file: !220, line: 255, baseType: !79, size: 16, offset: 1392)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "block1_offset", scope: !882, file: !220, line: 256, baseType: !86, size: 32, offset: 1408)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !882, file: !220, line: 257, baseType: !86, size: 32, offset: 1440)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "uri_query", scope: !882, file: !220, line: 258, baseType: !899, size: 64, offset: 1472)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "if_none_match", scope: !882, file: !220, line: 259, baseType: !107, size: 8, offset: 1536)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !882, file: !220, line: 261, baseType: !79, size: 16, offset: 1552)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !882, file: !220, line: 262, baseType: !186, size: 64, offset: 1600)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_transaction_t", file: !6, line: 566, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_transaction_", file: !6, line: 570, size: 768, elements: !935)
!935 = !{!936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !951}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !934, file: !6, line: 572, baseType: !932, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "mID", scope: !934, file: !6, line: 573, baseType: !79, size: 16, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "peerH", scope: !934, file: !6, line: 574, baseType: !54, size: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ack_received", scope: !934, file: !6, line: 575, baseType: !107, size: 8, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "response_timeout", scope: !934, file: !6, line: 576, baseType: !139, size: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_counter", scope: !934, file: !6, line: 577, baseType: !107, size: 8, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_time", scope: !934, file: !6, line: 578, baseType: !139, size: 64, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !934, file: !6, line: 579, baseType: !54, size: 64, offset: 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_len", scope: !934, file: !6, line: 580, baseType: !79, size: 16, offset: 512)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !934, file: !6, line: 581, baseType: !186, size: 64, offset: 576)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !934, file: !6, line: 582, baseType: !947, size: 64, offset: 640)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_transaction_callback_t", file: !6, line: 568, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !932, !54}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !934, file: !6, line: 583, baseType: !54, size: 64, offset: 704)
!952 = distinct !DICompileUnit(language: DW_LANG_C99, file: !953, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !814, retainedTypes: !954)
!953 = !DIFile(filename: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/core/observe.c", directory: "/home/stly/Documents/ProtocolEx/stubs/wakaama-LWM2M/server-build")
!954 = !{!955, !985, !1009, !54, !107, !1010, !1012, !1032, !1039, !58, !1040}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwm2m_observation_t", file: !6, line: 502, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lwm2m_observation_", file: !6, line: 493, size: 448, elements: !958)
!958 = !{!959, !961, !962, !993, !1001, !1002, !1008}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !957, file: !6, line: 495, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !957, file: !6, line: 496, baseType: !79, size: 16, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "clientP", scope: !957, file: !6, line: 497, baseType: !963, size: 64, offset: 128)
